[
  {
    "title": "PERANCANGAN PERBAIKAN PROSES BISNIS PENGADAAN BAHAN BAKU MENGGUNAKAN ANALISIS PARETO (Studi Kasus : PT INDO GLOBAL IMPEK) - Dalam bentuk buku karya ilmiah ",
    "classification": "Karya Ilmiah - Skripsi (S1) - Reference",
    "type_publication": "Business Process Management",
    "subject": "104 kali",
    "abstract": "PT Indo Global Impex merupakan sebuah perusahaan usaha menengah ke bawah yang bergerak di bidang pertanian yaitu cabe, perusahaan ini juga sering mendapatkan berbagai customer dari dalam dan luar kota Sidoarjo. Hal tersebut dikarenakan pasar saat ini sangat membutuhkan banyak stok bahan baku pedas, sehingga sangat berpotensi bagi bisnis perusahaan. Namun, ketika permintaan pasar tinggi, terdapat beberapa masalah yang muncul, seperti kehabisan stok bahan baku yang dapat merugikan perusahaan pada aspek biaya dan waktu. Oleh karena itu, tujuan penelitian ini adalah untuk menganalisis improvement yang dapat dilakukan pada proses pengadaan bahan baku demi menghindari kerugian permintaan pasar sepanjang tahun. Untuk mencapai tujuan tersebut, dibuatlah perancangan dan pendekatan Business Process Management. Business Process Management (BPM) adalah pendekatan strategis yang digunakan oleh suatu bisnis untuk merancang, menjalankan, mengukur, dan memperbaiki proses keberhasilan bisnis. BPM bertujuan untuk meningkatkan efisiensi, efektivitas, dan fleksibilitas dalam menjalankan operasi bisnis yang relevan. Metode yang digunakan dalam penelitian ini yaitu metode kualitatif dengan teknik pengumpulan data melalui observasi dan wawancara. Adapun tahap - tahap penelitian yang dilakukan adalah (1) mengidentifikasi proses bisnis, untuk mengetahui masalah proses bisnis pengadaan. Kemudian (2) dilakukan pemodelan kondisi proses bisnis pengadaan barang yang saat ini yang sedang berjalan (as-is) di PT Indo Global Impex menggunakan Business Process Model and Nation (BPMN). Selanjutnya (3) dilakukan pendeketan analisis Lifecycle Business Process Management melalui pengelompokkan perbaikan Value Adding (VA) untuk menyelesaikan masalah. Tahap terakhir adalah (4) dilakukan analisis perbaikan simulasi proses bisnis pengadaan barang (to-be). Hasil penelitian ini berupa analisis (as is), (to be), dan hasil simulasi perbaikan proses pengadaan barang di PT Indo Global Impex. Hasil ini kemudian diharapkan dapat dijadikan referensi perbaikan proses bisnis terkait agar proses tersebut dapat menjadi lebih cepat, efisien, dan sesuai yang diharapkan untuk memenuhi permintaan pelanggan di PT Indo Global Impex.\nPT Indo Global Impex merupakan sebuah perusahaan usaha menengah ke bawah yang bergerak di bidang pertanian yaitu cabe, perusahaan ini juga sering mendapatkan berbagai customer dari dalam dan luar kota Sidoarjo. Hal tersebut dikarenakan pasar saat ini sangat membutuhkan banyak stok bahan baku pedas, sehingga sangat berpotensi bagi bisnis perusahaan. Namun, ketika permintaan pasar tinggi, terdapat beberapa masalah yang muncul, seperti kehabisan stok bahan baku yang dapat merugikan perusahaan pada aspek biaya dan waktu. Oleh karena itu, tujuan penelitian ini adalah untuk menganalisis improvement yang dapat dilakukan pada proses pengadaan bahan baku demi menghindari kerugian permintaan pasar sepanjang tahun. Untuk mencapai tujuan tersebut, dibuatlah perancangan dan pendekatan Business Process Management. Business Process Management (BPM) adalah pendekatan strategis yang digunakan oleh suatu bisnis untuk merancang, menjalankan, mengukur, dan memperbaiki proses keberhasilan bisnis. BPM bertujuan untuk meningkatkan efisiensi, efektivitas, dan fleksibilitas dalam menjalankan operasi bisnis yang relevan. Metode yang digunakan dalam penelitian ini yaitu metode kualitatif dengan teknik pengumpulan data melalui observasi dan wawancara. Adapun tahap - tahap penelitian yang dilakukan adalah (1) mengidentifikasi proses bisnis, untuk mengetahui masalah proses bisnis pengadaan. Kemudian (2) dilakukan pemodelan kondisi proses bisnis pengadaan barang yang saat ini yang sedang berjalan (as-is) di PT Indo Global Impex menggunakan Business Process Model and Nation (BPMN). Selanjutnya (3) dilakukan pendeketan analisis Lifecycle Business Process Management melalui pengelompokkan perbaikan Value Adding (VA) untuk menyelesaikan masalah. Tahap terakhir adalah (4) dilakukan analisis perbaikan simulasi proses bisnis pengadaan barang (to-be). Hasil penelitian ini berupa analisis (as is), (to be), dan hasil simulasi perbaikan proses pengadaan barang di PT Indo Global Impex. Hasil ini kemudian diharapkan dapat dijadikan referensi perbaikan proses bisnis terkait agar proses tersebut dapat menjadi lebih cepat, efisien, dan sesuai yang diharapkan untuk memenuhi permintaan pelanggan di PT Indo Global Impex.",
    "keywords": "",
    "author": "AMIRUL ALAMSYAH IRIANTO",
    "lecturer": "Jancok koe",
    "publisher": "Universitas Telkom, S1 Sistem Informasi - Kampus Surabaya",
    "publish_year": "2024"
  },
  {
    "title": "Analisa Layanan pada Aplikasi Kesehatan dengan Framework ITIL V3 Domain Service Operation dan Standar SKM (Studi Kasus: Puskesmas Klampis) - Dalam bentuk buku karya ilmiah ",
    "classification": "Karya Ilmiah - Skripsi (S1) - Reference",
    "type_publication": "Service Management",
    "subject": "87 kali",
    "abstract": "Kementerian Kesehatan sudah melakukan transformasi digitalisasi kesehatan untuk meningkatkan efektifitas dan efisiensi pencatatan dan pelaporan dipuskesmas. Saat ini puskesmas sudah menerapkan penggunaan aplikasi-aplikasi layanan yang sudah terpusat. Tetapi layanan penggunaan aplikasi pada Puskesmas Klampis belum maksimal, banyaknya aplikasi yang harus digunakan tetapi kurangnya integrasi dapat mengakibatkan tidak efisien dan kesalahan saat manajemen data. Hal ini dapat mempengaruhi pelayanan pada Puskesmas Klampis. Tujuan penelitian ini yaitu menganalisis layanan penggunaan aplikasi-aplikasi yang ada pada Puskesmas Klampis untuk meminimalisir kendala, meningkatkan pelayanan untuk mencapai visi & misi puskesmas dan Peraturan Kementerian Kesehatan Permenkes. Maka dari itu keluaran penelitian ini mengimplementasikan Information Technology Infrastructure Library (ITIL) versi 3 dengan domain service operation dan analisis standar Survei Kepuasan Masyarakat (SKM) yang sudah diuji oleh Puskesmas Klampis dalam bentuk rekomendasi perbaikan pada layanan yang telah di validasi oleh Dinas Kesehatan Bangkalan dan Kepala Puskesmas Klampis. Penelitian ini menggunakan metode kuantitatif dengan analisis statistik deskriptif. Berdasarkan hasil penelitian didapatkan hasil persentase variabel event management 74,5%, incident management 75,5%, request fulfillment 74,5%, problem management 79%, dan access management 79% yang berarti jawaban responden “setuju” terhadap layanan aplikasi kesehatan. Meskipun demikian, pada variabel event management dan request fulfillment memerlukan rekomendasi perbaikan, dan hasil analisa SKM mendapatkan indeks A yang berarti kualitas pelayanan Puskesmas Klampis sangat baik. Hasil rekomendasi analisa yang sudah diverifikasi dan divalidasi agar mengetahui posisi penilaian, permasalahan dan bisa diperbaiki jika tidak sesuai dengan tujuan penggunaan aplikasi.",
    "keywords": "",
    "author": "ASTARI SHOFAATUL AZHAR",
    "lecturer": "Hamdan Azani",
    "publisher": "Universitas Telkom, S1 Sistem Informasi",
    "publish_year": "2024"
  },
  {
    "title": "ANALISIS KEAMANAN SISTEM INFORMASI MENGGUNAKAN KERANGKA KERJA INFORMATION SYSTEM SECURITY ASSESSMENT FRAMEWORK (ISSAF) PADA WEBSITE YDSF - LAZNAS (STUDI KASUS : YAYASAN DANA SOSIAL AL-FALAH) - Dalam bentuk buku karya ilmiah ",
    "classification": "Karya Ilmiah - Skripsi (S1) - Reference",
    "type_publication": "Keamanan",
    "subject": "65 kali",
    "abstract": "Tragedi serangan siber saat ini sudah menjadi hal yang lumrah terjadi pada berbagai website. Pada tahun 2022 Indonesia mengalami peningkatan kasus serangan siber, selain itu serangan terhadap website menjadi tiga insiden serangan teratas. Serangan siber ini juga berpotensi terjadi pada website milik Yayasan Dana Sosial Al-Falah Surabaya. Selain itu serangan siber seperti kebocoran data maupun serangan terhadap website dapat menyebabkan kerugian bagi perusahaan, sehingga jika ditemukan kerentanan pada sistem seperti kerentanan SQL Injection yang dapat digolongkan sebagai kerentanan dengan risiko tinggi yang dapat memberikan kemungkinan bagi peretas untuk mendapatkan informasi dari database website dan pada kasus tertentu mampu merusak konten pada halaman website (Defaceing). Tujuan dari penelitian ini untuk menganalisis keamanan sistem informasi pada website YDSF – LAZNAS menggunakan kerangka kerja uji penetrasi ISSAF (Information System Security Assessment Framework). Penetration Testing ini adalah salah satu cara untuk melihat tingkat keamanan sebuah sistem, membantu mengidentifikasi celah potensial pada sistem yang dapat dieksploitasi oleh penyerang atau peretas. ISSAF juga digunakan untuk menghubungkan langkah-langkah pentesting dengan tujuan untuk memberikan panduan komprehensif dalam melakukan penetration testing. Kriteria keberhasilan penelitian ini meliputi peningkatan kesadaran pihak YDSF – LAZNAS akan keamanan sistem informasi, dan  peningkatan perlindungan data donatur dengan cara memberikan hasil uji penetrasi melalui Final Report yang dibuat menggunakan kerangka kerja ISSAF. Oleh karena itu uji penetrasi yang dilakukan dapat memberikan beberapa kesimpulan seperti masih didapatkannya beberapa kerentanan, port terbuka dan eksploitasi yang berhasil dilakukan dimana strategi perlindungan dan mitigasi resiko beserta perbaikan berdasarkan solusi dari kerentanan yang didapatkan perlu dilakukan. Dikarenakan hal tersebut, prioritas perbaikan terhadap keamanan sistem informasi pada website YDSF – LAZNAS perlu berfokus pada beberapa kerentanan yang teridentifikasi saat berlangsungnya uji penetrasi.\n\nKata kunci— Keamanan Sistem Informasi, ISSAF, Pentest, OWASP, YDSF-LAZNAS",
    "keywords": "",
    "author": "JOHAN CALVIN TEURUPUN",
    "lecturer": "Deden Syarif Hidayatullah",
    "publisher": "Universitas Telkom, S1 Sistem Informasi - Kampus Surabaya",
    "publish_year": "2024"
  },
  {
    "title": "ANALISIS KEAMANAN SISTEM INFORMASI PADA WEBSITE E-RAPORT SEKOLAH XYZ MENGGUNAKAN INFORMATION SYSTEM SECURITY ASSESSMENT FRAMEWORK (ISSAF) - Dalam bentuk buku karya ilmiah ",
    "classification": "Karya Ilmiah - Skripsi (S1) - Reference",
    "type_publication": "Cyber Security",
    "subject": "93 kali",
    "abstract": "Kemajuan TIK telah memberikan kemudahan bagi manusia dalam mengakses dan berbagi informasi. Salah satu contoh dari kemajuan TIK dapat diblihat dari banyaknya situs web online, serta penggunaan media sosial yang semakin meningkat. Merujuk hasil survei yang dilakukan oleh Asosiasi Penyelenggara Jasa Internet Indonesia (APJII) pada tahun 2021-2022, pengguna internet di Indonesia mencapai 77,02% dari populasi penduduk Indonesia atau setara 210.026.769 juta pengguna. Angka ini menunjukkan peningkatan sebesar 3,32% dibandingkan dengan tahun 2019-2020 [3].Salah satu bentuk pemanfaatan internet adalah dengan menggunakan website. Website dapat digunakan oleh individu, organisasi, maupun perusahaan untuk berbagai tujuan, salah satu pemanfaatan website untuk pendidikan adalah E-Raport merupakan aplikasi raport eletronik untuk sekolah, yang memiliki dua jenis login, yaitu login untuk admin dan login untuk guru sekolah. Keamanan sistem informasi aplikasi e-raport berbasis website menjadi hal yang penting untuk diperhatikan, mengingat sistem tersebut memuat data peserta didik dan data yang berkaitan dengan proses pembelajaran. Apabila terdapat celah keamanan, maka celah keamanan tersebut dapat dimanfaatkan oleh penyerang untuk melakukan serangan, seperti pencurian data, penyalahgunaan data, dan gangguan layanan. Penelitian ini bertujuan untuk menganalisis keamanan sistem informasi aplikasi berbasis website e-raportt sekolah XYZ dengan menggunakan kerangka kerja Information System Security Assessment Framework (ISSAF). Berdasarkan hasil pengujian menggunakan framework ISSAF ditemukan beberapa celah keamanan yaitu: 2 celah keamanan medium, 4 celah keamanan low dan 3 celah keamanan informational. Selain itu terdapat banyak port yang terbuka pada website e raport yang bisa diekploitasi oleh penyerang. Namun untuk database dan password pana pengujian ini tidak dapat ditembus oleh penguji. Kendati demikian website eraport tergolong secure serta penulis mencantumkan rekomendasi untuk membantu pihak sekolah untuk melakukan perbaikan terhapap website e-raport. Dengan adanya dapat membantu pengelola system sekolah XYZ untuk meningkatkan keamanan sistem tersebut.\nKata Kunci: Aplikasi Berbasis Website, ISSAF, Keamanan Sistem Informasi, Penetration Testing",
    "keywords": "",
    "author": "DERY SYAMS AHNAF",
    "lecturer": "Nazhrin Nazarudin Achmad, Raihan Khoerul Imam",
    "publisher": "Universitas Telkom, S1 Sistem Informasi - Kampus Surabaya",
    "publish_year": "2024"
  },
  {
    "title": "ANALISIS KERENTANAN KEAMANAN WEBSITE DINAS KOPERASI DAN USAHA MIKRO SIDOARJO MENGGUNAKAN METODE PENETRATION TESTING DAN PENDEKATAN OWASP TOP 10 FRAMEWORK - Dalam bentuk buku karya ilmiah ",
    "classification": "Karya Ilmiah - Skripsi (S1) - Reference",
    "type_publication": "Keamanan",
    "subject": "58 kali",
    "abstract": "Berdasarkan laporan LANSKAP Keamanan Siber Indonesia BSSN 2023 bahwa sektor yang sering mengalami serangan siber terjadi pada sektor adminsitrasi pemerintahan. Website Dinas Koperasi dan Usaha Mikro Kabupaten Sidoarjo merupakan layanan yang menyediakan informasi untuk mendukung kesejahteraan ekonomi masyarakat Sidoarjo terkait pinjaman modal koperasi dan para pelaku UMKM. Website tersebut pernah terjadi kerentanan melalui serangan SQL Injection hingga mandapatkan database yang masih aktif. Oleh karena itu, Dinas tersebut memerlukan langkah keamanan yang kuat untuk melindungi segala informasi dan mencegah adanya potensi serangan siber lainnya dengan cara melakukan pengujian menggunakan metode penetration testing dengan pendekatan OWASP Top 10 – 2017.  Pengujian ini dilakukan terhadap tiga website dan hasil pengujian dari ketiga website tersebut memiliki total kerentanan sebanyak empat puluh dua kerentanan dengan risiko 4 kerentanan bersifat high, 17 kerentanan bersifat medium, dan 21 kerentanan bersifat low. Pengukuran prioritas risiko kerentanan didasarkan pada OWASP Risk Rating Methodology, dengan kerentanan risiko tertinggi adalah SQL Injection – MySQL, Cross-Site Scripting (XSS), dan Weak Password Change or Reset Functionalities. Salah satu kerentanan yang bersifat high yaitu berhasil mendapatkan database sehingga suatu saat website tersebut bisa saja dapat dimanfaatkan atau dimanipulasi oleh penyerang. Rekomendasi yang disarankan kepada organisasi adalah segera memperbaiki kerentanan yang telah ditemukan dan mengganti komponen-komponen ke versi lebih terbaru.\n\nKata kunci— Penetration testing, Website, OWASP Top 10, OWASP  Risk Rating Methodology, Keamanan sistem informasi",
    "keywords": "",
    "author": "NATASYA AMELIA SUKMAWATI",
    "lecturer": "Fajar Adi Prabowo, Sofia Sa'Idah",
    "publisher": "Universitas Telkom, S1 Sistem Informasi - Kampus Surabaya",
    "publish_year": "2024"
  },
  {
    "title": "ANALISIS PENGARUH JOB SATISFACTION, MOTIVATION DAN EMPLOYEE ENGAGEMENT TERHADAP EMPLOYEE PERFORMANCE (STUDI KASUS: CV. POLARIS LASER DAN CNC SURABAYA) - Dalam bentuk buku karya ilmiah ",
    "classification": "Karya Ilmiah - Skripsi (S1) - Reference",
    "type_publication": "Sumber Daya Manusia",
    "subject": "57 kali",
    "abstract": "ABSTRAK\nKaryawan adalah individu yang dipekerjakan pada sebuah organisasi atau perusahaan yang di dalamnya memiliki peran dan tanggung jawab sesuai dengan jenis pekerjaan dan industri tempat kerja. Dalam mengerjakan tugas-tugas yang diberikan, karyawan juga diharapkan untuk mematuhi kebijakan perusahaan, bekerja sesuai dengan standar etika dan profesionalisme yang ditetapkan, dan berkontribusi pada pencapaian tujuan perusahaan. Hal ini bertujuan untuk menghasilkan karyawan yang memiliki karakter yang kuat dan aktif terlibat dalam pemenuhan tugas-tugasnya. Faktor yang dapat mendorong performa karyawan adalah pada aspek keterlibatan karyawan yang mencakup kepuasan kerja, motivasi hingga dampak kinerja karyawan yang bisa dirasakan oleh rekan kerja hingga perusahaan. Salah satu bentuk partisipasi dari keterlibatan karyawan yang diambil sebagai studi kasus adalah yang terjadi pada CV. Polaris Laser & CNC Surabaya sebuah perusahaan yang bergerak dibidang industri kreatif yang produk periklanan dan interior. Penelitian ini bertujuan untuk mengetahui pengaruh dari job satisfaction (kepuasan kerja), motivation (motivasi), employee performance (kinerja karyawan) terhadap employee engagement (keterlibatan karyawan). Penelitian ini dilakukan menggunakan metode  Partial Least Square structural equation modelling (PLS-SEM)  untuk menguji hubungan korelasi antar variabel. Teknik pengambilan sampel yang digunakan adalah menggunakan populasi dari karyawan yang bekerja pada CV. Polaris Laser & CNC Surabaya dengan jumlah 39 karyawan. Penelitian ini menguji variabel job satisfaction (kepuasan kerja), motivation (motivasi), employee performance (kinerja karyawan) terhadap employee engagement (keterlibatan karyawan) dan hubungannya antar variabel. Pada penelitian ini adalah bahwa variabel motivasi (Motivation) memiliki efek positif terhadap variabel keterlibatan karyawan (Employee Engagement) dengan nilai p-value 0,000 serta pada performa karyawan (Employee Performance) nilai dari p-value yakni 0,005, di sisi lain pada variabel kepuasan kerja (Job Satisfaction) tidak memiliki dampak pada keterlibatan karyawan (Employee Engagement) dengan nilai p-value 0,415. Terakhir dalam penelitian ini ditemukan juga bahwa variabel keterlibatan karyawan (Employee Engagement) memiliki pengaruh yang signifikan pada performa karyawan (Employee Performance) dengan nilai p-value 0,019 yang dengan nilai ini dapat mendorong pihak perusahan CV. Polaris Laser & CNC Surabaya untuk mendapatkan hasil yang optimal dengan performa yang juga baik.\nKata kunci: employee engagement, job satisfaction, motivation, employee performance. ",
    "keywords": "",
    "author": "FIRMAN THOBIAS UKY",
    "lecturer": "Alfat Mahardika, Aufar Fikri Dimyati",
    "publisher": "Universitas Telkom, S1 Teknik Industri - Kampus Surabaya",
    "publish_year": "2024"
  },
  {
    "title": "ANALISIS SENTIMEN MASYARAKAT INDONESIA TERHADAP PASANGAN CALON PRESIDEN PEMILU 2024 MENGGUNAKAN METODE EXTREME GRADIENT BOOSTING - Dalam bentuk buku karya ilmiah ",
    "classification": "Karya Ilmiah - Skripsi (S1) - Reference",
    "type_publication": "Data Mining",
    "subject": "76 kali",
    "abstract": "Negara Kesatuan Republik Indonesia (NKRI) adalah salah satu negara di dunia yang memegang ideologi demokrasi dengan menerapkan nilai-nilai Pancasila di seluruh aspek kehidupan masyarakatnya. Pemilu Presiden merupakan salah satu implementasi demokrasi yang dilaksanakan setiap lima tahun sekali dan merupakan salah satu peristiwa politik terbesar di Indonesia, di mana Pasangan Calon (Paslon) yang memiliki suara terbanyak dari rakyat menjadi pemenangnya. Opini dan sentimen masyarakat Indonesia berperan sangat besar terhadap kemenangan Paslon, bahkan dapat memengaruhi opini sesama pendukung Paslon lainnya. Dalam politik, memahami sentimen masyarakat sangat penting untuk keberhasilan kampanye. Sentimen yang positif dapat digunakan untuk memperkuat citra kandidat, sedangkan sentimen negatif membutuhkan strategi khusus untuk mengatasinya. Analisis sentimen juga dapat membantu partai politik menyusun strategi kampanye yang lebih efektif dan berbasis data, memastikan bahwa pesan yang disampaikan sesuai dengan harapan masyarakat.  Penelitian ini berfokus pada analisis sentimen yang bertujuan untuk mengetahui apakah opini masyarakat Indonesia yang dikumpulkan dari platform media sosial memiliki sentimen netral, positif, atau negatif terhadap Paslon Presiden dan Wakil Presiden. Hal ini sangat berguna bagi kandidat dan anggota partai politik. Kami menggunakan metode Extreme Gradient Boosting (XGBoost) karena memiliki akurasi yang tinggi, relatif cepat dilatih, mampu mengolah data besar dan kompleks, serta tahan terhadap data outlier dan tidak umum. XGBoost dikenal unggul dalam menangani data dengan struktur dan kompleksitas tinggi, yang sering ditemui dalam data media sosial. Tahapan dalam penelitian ini meliputi : mengumpulkan data teks dari platform yang telah dipilih, membersihkan data, dan mengubah format data dengan Case Folding, Tokenizing, Stopword Removal, dan Stemming. Untuk meningkatkan akurasi prediksi sentimen, langkah-langkah ini sangat penting. Case Folding mengubah teks menjadi huruf kecil untuk konsistensi, Tokenizing memecah kalimat menjadi kata-kata individu, Stopwords Removal menghapus kata-kata umum yang tidak penting, dan Stemming mengurangi kata-kata ke bentuk aslinya. Ekstraksi fitur teks menggunakan metode Term Frequency-Inverse Document Frequency (TF-IDF), melatih dan menguji XGBoost sebagai metode klasifikasinya, karena merupakan algoritma pembelajaran mesin yang sangat efektif dalam klasifikasi dan regresi. Algoritma ini menggabungkan hasil prediksi dari berbagai model dasar untuk menghasilkan prediksi yang lebih akurat. XGBoost sangat cocok untuk analisis sentimen berbasis media sosial karena memiliki kecepatan pemrosesan tinggi dan kemampuan untuk menangani data yang hilang, tidak terstruktur, dan bervariasi.  Serta menyusun sebuah dashboard atau grafik untuk visualisasi data hasil dari penelitian menggunakan Power BI sebagai alat bantu. Dashboard dan grafik yang dihasilkan melalui Power BI memungkinkan visualisasi data yang mudah dipahami. Visualisasi ini memberikan pandangan yang jelas dan terstruktur mengenai sentimen masyarakat, membantu kandidat dan partai politik untuk mengidentifikasi area kekuatan dan kelemahan dalam kampanye mereka. Penelitian ini tidak hanya memberikan manfaat langsung bagi aktor politik tetapi juga menawarkan wawasan bagi akademisi dan peneliti lainnya yang tertarik pada analisis sentimen dan penggunaannya dalam konteks sosial dan politik. Selain itu, masyarakat umum juga mendapatkan kesempatan untuk lebih memahami bagaimana opini dan sentimen mereka dapat memengaruhi proses politik di negara ini, penelitian ini juga bertujuan untuk meningkatkan pemahaman analisis sentimen kepada sesama peneliti, serta mendorong partisipasi dan pemahaman dinamika sosial kepada masyarakat Indonesia secara keseluruhan. Berdasarkan penelitian yang telah dilakukan model XGBoost memberikan performa yang cukup baik dalam tahapan latih dan uji, menggunakan hyperparameter dengan nilai Nestimators = 100, Maxdepth = 8, Learningrate = 1, Subsample = 1, Colsamplebytree = 1, Objective = Multi, Num_class = 3 menghasilkan nilai Accuracy =  0.87, Precision = 0.85, Recall = 0.82, dan F1-Score = 0.82. Yang merupakan hasil dengan nilai paling tinggi setelah beberapa kali merubah dan mengevaluasi hyperparameter. Penelitian ini menggunakan algoritma XGBoost untuk mengkategorikan komentar publik ke dalam tiga kategori: positif, netral, dan negatif. Hasilnya menunjukkan bahwa komentar positif mendominasi dataset untuk semua pertanyaan, sementara komentar negatif berbeda untuk pertanyaan yang berbeda. Pasangan 03 memiliki lebih banyak komentar positif daripada yang lain, mungkin karena tanggapan yang lebih baik. Sebaliknya, komentar negatif untuk Pasangan 01 lebih banyak, mungkin karena kurangnya tanggapan yang lebih baik dari masyarakat. Studi ini memberikan wawasan berharga tentang opini publik terhadap capres dan cawapres.",
    "keywords": "",
    "author": "LUKMAN SATRIYO BAGUS WICAKSONO",
    "lecturer": "Moh. Hamim Zajuli Al Faroby, Mochamad Nizar Palefi Ma'ady",
    "publisher": "Universitas Telkom, S1 Sistem Informasi - Kampus Surabaya",
    "publish_year": "2024"
  },
  {
    "title": "ANALISIS TINGKAT ADOPSI PENGGUNAAN MOBILE  PAYMENT DI UMKM BINAAN JAWA TIMUR  MENGGUNAKAN EXTENDED TECHNOLOGYORGANIZATION-ENVIRONMENT (TOE) - Dalam bentuk buku karya ilmiah ",
    "classification": "Karya Ilmiah - Skripsi (S1) - Reference",
    "type_publication": "Technological Innovation-adoption",
    "subject": "67 kali",
    "abstract": "Teknologi informasi memiliki manfaat dalam mendukung dan mendorong keputusan organisasi. Namun survei Dinas Koperasi dan UKM Jawa Timur tahun 2022, menyatakan penggunakan teknologi pembayaran oleh UMKM binaan masih dibawah 10%. Observasi awal sejumlah UMKM Binaan di Jawa Timur merasa penggunaan mobile payment mampu mempermudah proses transaksi, beberapa pembeli meminta pembayaran transfer, dan tidak khawatir dengan uang kembalian. Akan tetapi terdapat UMKM Binaan yang menyesalkan adanya potongan biaya, pemahaman yang kurang, terbiasa dengan pembayaran manual, dan keterbatasan penggunaan. Oleh karena itu, peneliti melakukan pengujian model extended Technology-Organization-Environment (TOE) oleh Tran Hung dengan perluasan kerangka melalui identifikasi pengaruh adoption intention, Number of employees, Firm age terhadap Business performance. Analisis dilakukan menggunakan teknik analisis CB-SEM pada software SmartPLS 4. Mobile payment yang dikaji pada penelitian ini merupakan penyesuaian dari penggunaan paling banyak oleh UMKM binaan Provinsi Jawa Timur yaitu mobile banking, QRIS, dan ShopeePay. Berdasarkan hasil penelitian pada UMKM binaan di Jawa Timur, menunjukkan bahwa adopsi mobile payment dipengaruhi secara positif signifikan oleh technological orientation sebesar 0.019. Relative advantage sebesar 0.583, observability sebesar 0.309, perceived tren sebesar 0.151, dan legal framework sebesar 0.144 dengan memberikan pengaruh secara positif namun tidak signifikan pada adopsi mobile payment. Sedangkan untuk hubungan negatif tidak signifikan dipengaruhi oleh compatibility 0.214 sebesar, top manajement support sebesar 0.731, firm size sebesar 0.646, entrepreneurial orientation sebesar 0.101, competitive pressure sebesar 0.155 dan government support sebesar 0.247. Sementara itu business performance dari umkm binaan dipengaruhi oleh mobile payment adoption intention sebesar 0.00, dan firm age sebesar 0.005 yang memiliki hubungan secara positif signifikan, serta dipengaruhi secara negatif tidak signifikan oleh number of employee sebesar 0.502. Demikian hasil analisis faktor dapat dijadikan rekomendasi bagi pemerintah dan pelaku UMKM binaan untuk meningkatkan adopsi mobile payment guna menunjang kinerja usahanya. Selain itu, penelitian ini dapat digunakan sebagai referensi penelitian selanjutnya.",
    "keywords": "",
    "author": "SIWI WIRATNA PAMUNGKAS",
    "lecturer": "Noerma Pudji Istyanto, Alifiansyah Arrizqy Hidayat",
    "publisher": "Universitas Telkom, S1 Sistem Informasi",
    "publish_year": "2024"
  },
  {
    "title": "Aplikasi Konsultasi Makanan Diet Menggunakan Deep  Learning - Capstone ",
    "classification": "Karya Ilmiah - Skripsi (S1) - Reference",
    "type_publication": "Deep Learning",
    "subject": "52 kali",
    "abstract": "Kesehatan merupakan aspek penting dalam kehidupan manusia, di mana obesitas dan rendahnya literasi gizi menjadi masalah serius yang mempengaruhi individu serta masyarakat secara keseluruhan. Data menunjukkan peningkatan signifikan angka obesitas di berbagai kelompok usia di Indonesia, termasuk anak-anak dan wanita reproduktif. Selain itu, rendahnya literasi gizi mengakibatkan pemahaman yang buruk tentang pola makan sehat, memperburuk kondisi ini. Masalah utama penelitian ini adalah keterbatasan waktu untuk berkonsultasi dengan ahli gizi, yang menghambat upaya mengatasi obesitas secara efektif.\n\nUntuk mengatasi masalah tersebut, penelitian ini menawarkan solusi berupa aplikasi konsultasi diet berbasis Deep Learning yang diberi nama \"Dietary\". Aplikasi ini dirancang untuk memberikan rekomendasi diet yang personal dan sesuai kebutuhan pengguna dengan menggunakan teknologi Deep Learning. Melalui aplikasi ini, pengguna dapat mengakses informasi gizi dan rekomendasi diet kapan saja tanpa harus bertemu langsung dengan ahli gizi, sehingga mengatasi keterbatasan waktu dan meningkatkan literasi gizi masyarakat.\n\nHasil penelitian menunjukkan bahwa penggunaan aplikasi \"Dietary\" secara signifikan meningkatkan kesadaran dan pengetahuan gizi pengguna, serta membantu mereka dalam menurunkan berat badan. Hasil pengujian menunjukkan bahwa aplikasi ini efektif dalam mendeteksi makanan, menyediakan informasi gizi, dan memberikan rekomendasi diet yang akurat dan pengguna melaporkan peningkatan kepuasan rata-rata di atas 87% . Aplikasi ini sudah dilakukan uji coba oleh nutrisionis dan memberikan umpan balik yang baik untuk aplikasi. Nutrisionis memvalidasi semua aspek perhitungan dan rumus yang digunakan aplikasi untuk memastikan kesesuaian dalam penggunaan perhitungan gizi. Berdasarkan hasil evaluasi aplikasi lulus dalam penggunaan rumus dan perhitungan dan dinilai sebagai aplikasi yang dapat membantu pengguna dalam melakukan diet baik itu pengguna non obesitas maupun pengidap obesitas. Kesimpulannya, aplikasi \"Dietary\" dapat menjadi alat yang efektif dalam mengatasi masalah obesitas dan literasi gizi, dengan potensi untuk meningkatkan kesehatan masyarakat secara keseluruhan.\n\nKata kunci : aplikasi kesehatan, deep learning, konsultasi diet, literasi gizi, obesitas",
    "keywords": "",
    "author": "HARVAN NURLUTHFI IRAWAN",
    "lecturer": "Casi Setianingsih, Anggunmeka Luhur Prasasti",
    "publisher": "Universitas Telkom, S1 Teknik Komputer",
    "publish_year": "2024"
  },
  {
    "title": "Aplikasi Monitoring Makanan Kucing Peliharaan Berbasis IoT - Capstone ",
    "classification": "Karya Ilmiah - Skripsi (S1) - Reference",
    "type_publication": "Internet Of Things",
    "subject": "59 kali",
    "abstract": "Kucing merupakan hewan peliharaan yang pintar, lucu, dan membutuhkan perhatian khusus terutama terkait dengan pola makan mereka. Pemberian makanan yang teratur dan sesuai merupakan aspek penting dalam perawatan hewan peliharaan. Pemilik sering menghadapi kesulitan dalam menjaga jadwal makan hewan mereka, terutama jika memiliki lebih dari satu jenis hewan atau jenis makanan yang berbeda. Selain itu, permasalahan pemilik kucing dalam memberikan makanan tidak sesuai takaran dapat mengakibatkan overfeeding dan menyebabkan kucing peliharaanya menjadi obesitas. Tugas akhir ini bertujuan untuk mengembangkan aplikasi monitoring kucing peliharaan berbasis Internet of Things (IoT) yang menawarkan solusi inovatif untuk mempermudah pemberian makanan, aplikasi ini dinamakan ”IFT PetFeeder”. IFT Pet Feeder adalah sebuah aplikasi yang terintergrasi dengan perangkat IoT yang menawarkan berbagai fitur, termasuk monitoring isi penampungan makanan, mengatur penjadwalan pemberian makanan, mengatur porsi makanan sesuai takaran, pemberian makanan realtime, dan terdapat kamera monitoring untuk memantau aktivitas kucing. Perangkat IoT yang terintegrasi dengan aplikasi juga memiliki spesifikasi untuk menampung 2 jenis makanan yang berbeda, memiliki wadah penampungan yang mudah diisi ulang dan dibersihkan, takaran makanan yang dikeluarkan dapat diatur oleh pengguna melalui aplikasi, dan wadah yang dapat berputar sesuai dengan jenis makanan yang dipilih. Dari hasil pengujian User Acceptance Testing (UAT) menunjukkan bahwa aplikasi dan perangkat IoT ini layak digunakan dengan rata-rata presentase kelayakan diatas 80% dengan hasil 82,4% dari pengujian secara langsung untuk aplikasi dan 87,5% dari pengujian virtual untuk aplikasi. 82.4% dari pengujian langsung untuk alat dan 95.2 % dari pengujian virtual untuk alat. Hasil tersebut menegaskan bahwa aplikasi dan perangkat IoT IFT PetFeeder mudah digunakan, serta memenuhi kebutuhan dan ekspektasi pengguna dalam berbagai kondisi.\n\nkata kunci: Kucing, IoT (Internet of Things), IFT Pet Feeder, Overfeeding, User Acceptance Testing (UAT), Aplikasi.",
    "keywords": "",
    "author": "IVAN FERNANDA PRAYOGA",
    "lecturer": "Purba Daru Kusuma, Rifqi Muhammad Fikri",
    "publisher": "Universitas Telkom, S1 Teknik Komputer",
    "publish_year": "2024"
  },
  {
    "title": "Aplikasi Monitoring Makanan Kucing Peliharaan Berbasis IoT - Dalam bentuk buku karya ilmiah ",
    "classification": "Karya Ilmiah - Skripsi (S1) - Reference",
    "type_publication": "Internet Of Things",
    "subject": "57 kali",
    "abstract": "Kucing merupakan hewan peliharaan yang pintar, lucu, dan membutuhkan perhatian khusus terutama terkait dengan pola makan mereka. Pemberian makanan yang teratur dan sesuai merupakan aspek penting dalam perawatan hewan peliharaan. Pemilik sering menghadapi kesulitan dalam menjaga jadwal makan hewan mereka, terutama jika memiliki lebih dari satu jenis hewan atau jenis makanan yang berbeda. Selain itu, permasalahan pemilik kucing dalam memberikan makanan tidak sesuai takaran dapat mengakibatkan overfeeding dan menyebabkan kucing peliharaanya menjadi obesitas. Tugas akhir ini bertujuan untuk mengembangkan aplikasi monitoring kucing peliharaan berbasis Internet of Things (IoT) yang menawarkan solusi inovatif untuk mempermudah pemberian makanan, aplikasi ini dinamakan ”IFT PetFeeder”.\n            IFT Pet Feeder adalah sebuah aplikasi yang terintergrasi dengan perangkat IoT yang menawarkan berbagai fitur, termasuk monitoring isi  penampungan makanan, mengatur penjadwalan pemberian makanan, mengatur porsi makanan sesuai takaran, pemberian makanan realtime, dan terdapat kamera monitoring untuk memantau aktivitas kucing. Perangkat IoT yang terintegrasi dengan aplikasi juga memiliki spesifikasi untuk menampung 2 jenis makanan yang berbeda, memiliki wadah penampungan yang mudah diisi ulang dan dibersihkan, takaran makanan yang dikeluarkan dapat diatur oleh pengguna melalui aplikasi, dan wadah yang dapat berputar sesuai dengan jenis makanan yang dipilih.\n            Dari hasil pengujian  User Acceptance Testing (UAT) menunjukkan bahwa aplikasi dan perangkat IoT ini layak digunakan dengan rata-rata presentase kelayakan diatas 80% dengan hasil 82,4% dari pengujian secara langsung untuk aplikasi dan 87,5% dari pengujian virtual untuk aplikasi. 82.4% dari pengujian langsung untuk alat dan 95.2 % dari pengujian virtual untuk alat. Hasil tersebut menegaskan bahwa aplikasi dan perangkat IoT IFT PetFeeder mudah digunakan, serta memenuhi kebutuhan dan ekspektasi pengguna dalam berbagai kondisi.\n \nkata kunci: Kucing, IoT (Internet of Things), IFT Pet Feeder, Overfeeding, User Acceptance Testing (UAT), Aplikasi.",
    "keywords": "",
    "author": "TASSYA RAMADHANTI",
    "lecturer": "Purba Daru Kusuma, Rifqi Muhammad Fikri",
    "publisher": "Universitas Telkom, S1 Teknik Komputer",
    "publish_year": "2024"
  },
  {
    "title": "Aplikasi Monitoring Makanan Kucing Peliharaan Berbasis IoT - Dalam bentuk buku karya ilmiah ",
    "classification": "Karya Ilmiah - Skripsi (S1) - Reference",
    "type_publication": "Internet Of Things",
    "subject": "50 kali",
    "abstract": "Kucing merupakan hewan peliharaan yang pintar, lucu, dan membutuhkan perhatian khusus terutama terkait dengan pola makan mereka. Pemberian makanan yang teratur dan sesuai merupakan aspek penting dalam perawatan hewan peliharaan. Pemilik sering menghadapi kesulitan dalam menjaga jadwal makan hewan mereka, terutama jika memiliki lebih dari satu jenis hewan atau jenis makanan yang berbeda. Selain itu, permasalahan pemilik kucing dalam memberikan makanan tidak sesuai takaran dapat mengakibatkan overfeeding dan menyebabkan kucing peliharaanya menjadi obesitas. Tugas akhir ini bertujuan untuk mengembangkan aplikasi monitoring kucing peliharaan berbasis Internet of Things (IoT) yang menawarkan solusi inovatif untuk mempermudah pemberian makanan, aplikasi ini dinamakan ”IFT PetFeeder”. IFT Pet Feeder adalah sebuah aplikasi yang terintergrasi dengan perangkat IoT yang menawarkan berbagai fitur, termasuk monitoring isi penampungan makanan, mengatur penjadwalan pemberian makanan, mengatur porsi makanan sesuai takaran, pemberian makanan realtime, dan terdapat kamera monitoring untuk memantau aktivitas kucing. Perangkat IoT yang terintegrasi dengan aplikasi juga memiliki spesifikasi untuk menampung 2 jenis makanan yang berbeda, memiliki wadah penampungan yang mudah diisi ulang dan dibersihkan, takaran makanan yang dikeluarkan dapat diatur oleh pengguna melalui aplikasi, dan wadah yang dapat berputar sesuai dengan jenis makanan yang dipilih. Dari hasil pengujian User Acceptance Testing (UAT) menunjukkan bahwa aplikasi dan perangkat IoT ini layak digunakan dengan rata-rata presentase kelayakan diatas 80% dengan hasil 82,4% dari pengujian secara langsung untuk aplikasi dan 87,5% dari pengujian virtual untuk aplikasi. 82.4% dari pengujian langsung untuk alat dan 95.2 % dari pengujian virtual untuk alat. Hasil tersebut menegaskan bahwa aplikasi dan perangkat IoT IFT PetFeeder mudah digunakan, serta memenuhi kebutuhan dan ekspektasi pengguna dalam berbagai kondisi.\n\nkata kunci: Kucing, IoT (Internet of Things), IFT Pet Feeder, Overfeeding, User Acceptance Testing (UAT), Aplikasi.",
    "keywords": "",
    "author": "FASYA HANIFAH PUTTI",
    "lecturer": "Purba Daru Kusuma, Rifqi Muhammad Fikri",
    "publisher": "Universitas Telkom, S1 Teknik Komputer",
    "publish_year": "2024"
  },
  {
    "title": "Dari Kertas ke Akurasi Digital: Otomatisasi Pelaporan Formulir C1 Pemilu dengan Machine Learning untuk Peningkatan Transparansi dan Integritas - Capstone ",
    "classification": "Karya Ilmiah - Skripsi (S1) - Reference",
    "type_publication": "Tugas Akhir",
    "subject": "60 kali",
    "abstract": "Pemilu merupakan salah satu pilar utama dalam proses demokrasi yang memungkinkan warga negara untuk memilih wakil mereka secara langsung. Pada laporan ini membahas tentang sistem pemilu campuran yang menggabungkan sistem distrik dan sistem perwakilan berimbang. Selain itu, dan juga mengulas tentang konsep dasar machine learning, yang merupakan aplikasi komputer yang memungkinkan pembelajaran dari data untuk membuat prediksi di masa depan. Tiga kategori utama dalam machine learning adalah Supervised Learning, Unsupervised Learning, dan Reinforcement Learning.\n\nTerakhir, laporan ini menjelaskan tentang cloud computing, sebuah sistem operasi aplikasi yang memungkinkan penyimpanan dan pemrosesan data secara terdistribusi, tanpa memerlukan pengetahuan lokasi pasti sumber daya tersebut. Pada era digital ini, teknologi berkembang secara cepat, salah satunya adalah machine learning. Laporan ini membahas penerapan teknologi machine learning dalam proses pelaporan Formulir C1 Pemilu untuk meningkatkan transparansi dan integritas dalam konteks pemilihan umum. Metode penelitian melibatkan pengumpulan data dari sejumlah pemilihan umum sebelumnya, serta pengembangan model Machine Learning untuk mendeteksi dan memvalidasi data dari formulir C1 secara otomatis.\n\nModel machine learning yang digunakan adalah YOLOv8 untuk melakukan deteksi objek pada formulir hasil pemilu. Deteksi objek pada angka hasil pemilu dilakukan training terlebih dahulu agar mendapatkan hasil yang akurat. Hasil analisis menunjukkan bahwa penggunaan teknologi ini mampu mengurangi kesalahan manusia dan potensial kecurangan dalam pelaporan hasil pemilu. Implikasi praktis dari penelitian ini adalah meningkatnya kepercayaan publik terhadap proses pemilihan umum dan penguatan integritas demokrasi. Penelitian lebih lanjut diperlukan untuk mengoptimalisasi kinerja model dan memastikan implementasi yang sukses dalam skala yang lebih luas.",
    "keywords": "",
    "author": "VITO DEVARA SYIFA",
    "lecturer": "Kris Sujatmoko, Suryo Adhi Wibowo",
    "publisher": "Universitas Telkom, S1 Teknik Telekomunikasi",
    "publish_year": "2024"
  },
  {
    "title": "Dari Kertas ke Akurasi Digital: Otomatisasi Pelaporan Formulir C1 Pemilu dengan Machine Learning untuk Peningkatan Transparansi dan Integritas - Capstone ",
    "classification": "Karya Ilmiah - Skripsi (S1) - Reference",
    "type_publication": "Tugas Akhir",
    "subject": "53 kali",
    "abstract": "Pemilu merupakan salah satu pilar utama dalam proses demokrasi yang memungkinkan warga negara untuk memilih wakil mereka secara langsung. Pada laporan ini membahas tentang sistem pemilu campuran yang menggabungkan sistem distrik dan sistem perwakilan berimbang. Selain itu, dan juga mengulas tentang konsep dasar machine learning, yang merupakan aplikasi komputer yang memungkinkan pembelajaran dari data untuk membuat prediksi di masa depan. Tiga kategori utama dalam machine learning adalah Supervised Learning, Unsupervised Learning, dan Reinforcement Learning.\n\nTerakhir, laporan ini menjelaskan tentang cloud computing, sebuah sistem operasi aplikasi yang memungkinkan penyimpanan dan pemrosesan data secara terdistribusi, tanpa memerlukan pengetahuan lokasi pasti sumber daya tersebut. Pada era digital ini, teknologi berkembang secara cepat, salah satunya adalah machine learning. Laporan ini membahas penerapan teknologi machine learning dalam proses pelaporan Formulir C1 Pemilu untuk meningkatkan transparansi dan integritas dalam konteks pemilihan umum. Metode penelitian melibatkan pengumpulan data dari sejumlah pemilihan umum sebelumnya, serta pengembangan model Machine Learning untuk mendeteksi dan memvalidasi data dari formulir C1 secara otomatis.\n\nModel machine learning yang digunakan adalah YOLOv8 untuk melakukan deteksi objek pada formulir hasil pemilu. Deteksi objek pada angka hasil pemilu dilakukan training terlebih dahulu agar mendapatkan hasil yang akurat. Hasil analisis menunjukkan bahwa penggunaan teknologi ini mampu mengurangi kesalahan manusia dan potensial kecurangan dalam pelaporan hasil pemilu. Implikasi praktis dari penelitian ini adalah meningkatnya kepercayaan publik terhadap proses pemilihan umum dan penguatan integritas demokrasi. Penelitian lebih lanjut diperlukan untuk mengoptimalisasi kinerja model dan memastikan implementasi yang sukses dalam skala yang lebih luas.",
    "keywords": "",
    "author": "ANGELITA GUSDI",
    "lecturer": "Kris Sujatmoko, Suryo Adhi Wibowo",
    "publisher": "Universitas Telkom, S1 Teknik Telekomunikasi",
    "publish_year": "2024"
  },
  {
    "title": "Dari Kertas ke Akurasi Digital: Otomatisasi Pelaporan Formulir C1 Pemilu dengan Machine Learning untuk Peningkatan Transparansi dan Integritas - Capstone ",
    "classification": "Karya Ilmiah - Skripsi (S1) - Reference",
    "type_publication": "Tugas Akhir",
    "subject": "50 kali",
    "abstract": "Pemilu merupakan salah satu pilar utama dalam proses demokrasi yang memungkinkan warga negara untuk memilih wakil mereka secara langsung. Pada laporan ini membahas tentang sistem pemilu campuran yang menggabungkan sistem distrik dan sistem perwakilan berimbang. Selain itu, dan juga mengulas tentang konsep dasar machine learning, yang merupakan aplikasi komputer yang memungkinkan pembelajaran dari data untuk membuat prediksi di masa depan. Tiga kategori utama dalam machine learning adalah Supervised Learning, Unsupervised Learning, dan Reinforcement Learning.\n\nTerakhir, laporan ini menjelaskan tentang cloud computing, sebuah sistem operasi aplikasi yang memungkinkan penyimpanan dan pemrosesan data secara terdistribusi, tanpa memerlukan pengetahuan lokasi pasti sumber daya tersebut. Pada era digital ini, teknologi berkembang secara cepat, salah satunya adalah machine learning. Laporan ini membahas penerapan teknologi machine learning dalam proses pelaporan Formulir C1 Pemilu untuk meningkatkan transparansi dan integritas dalam konteks pemilihan umum. Metode penelitian melibatkan pengumpulan data dari sejumlah pemilihan umum sebelumnya, serta pengembangan model Machine Learning untuk mendeteksi dan memvalidasi data dari formulir C1 secara otomatis.\n\nModel machine learning yang digunakan adalah YOLOv8 untuk melakukan deteksi objek pada formulir hasil pemilu. Deteksi objek pada angka hasil pemilu dilakukan training terlebih dahulu agar mendapatkan hasil yang akurat. Hasil analisis menunjukkan bahwa penggunaan teknologi ini mampu mengurangi kesalahan manusia dan potensial kecurangan dalam pelaporan hasil pemilu. Implikasi praktis dari penelitian ini adalah meningkatnya kepercayaan publik terhadap proses pemilihan umum dan penguatan integritas demokrasi. Penelitian lebih lanjut diperlukan untuk mengoptimalisasi kinerja model dan memastikan implementasi yang sukses dalam skala yang lebih luas.",
    "keywords": "",
    "author": "JEREMIA PANDU PUTRA PRIHANANTO",
    "lecturer": "Kris Sujatmoko, Suryo Adhi Wibowo",
    "publisher": "Universitas Telkom, S1 Teknik Telekomunikasi",
    "publish_year": "2024"
  },
  {
    "title": "DESAIN DAN IMPLEMENTASI LAYANAN DIGITAL AGENCY BERBASIS WEBSITE MENGGUNAKAN UML ICONIX PROCESS (STUDI KASUS: WEBSITE MAS DZIKRY)  - Dalam bentuk buku karya ilmiah ",
    "classification": "Karya Ilmiah - Skripsi (S1) - Reference",
    "type_publication": "Website",
    "subject": "41 kali",
    "abstract": "Dalam era digital yang terus berkembang, layanan digital agency semakin penting bagi perusahaan yang ingin memperluas jangkauan pemasaran mereka. Perubahan perilaku konsumen menuju penggunaan platform digital menuntut perusahaan untuk beradaptasi agar tetap relevan dan kompetitif. Digital agency, dengan keahlian dalam strategi pemasaran online, menjadi mitra yang berharga dalam merancang dan melaksanakan kampanye digital yang efektif. Perusahaan Mas Dzikry, sebuah digital agency berbasis di Surabaya, menyediakan layanan pemasaran digital seperti press release media nasional dan optimasi website. Meskipun demikian, evaluasi menunjukkan bahwa website dan proses bisnis mereka saat ini tidak lagi efektif dan tidak memenuhi tuntutan pasar. Penelitian ini bertujuan untuk mendesain dan mengimplementasikan layanan digital agency berbasis website untuk Mas Dzikry menggunakan metode UML Iconix Process. Pembaruan proses bisnis memungkinkan pelanggan untuk melakukan pembayaran langsung melalui website menggunakan payment gateway, menggantikan metode pembayaran manual. Fitur tambahan seperti dashboard admin untuk data pelanggan dan penjualan, serta integrasi payment gateway, terbukti efektif dalam mengelola proses bisnis di Mas Dzikry. Pengujian menggunakan Black Box Testing dan Boundary Value Analysis memastikan kualitas dan keandalan sistem, dengan hasil menunjukkan tidak adanya bug atau input yang gagal. Hasil UAT menunjukkan tingkat kepuasan pengguna rata-rata sebesar 87,2%, menunjukkan bahwa pelanggan merasa puas dengan website Mas Dzikry yang baru. Implementasi website yang lebih modern, interaktif, dan responsif diharapkan dapat meningkatkan visibilitas merek, memperluas jangkauan pemasaran, serta meningkatkan pengalaman pengguna secara signifikan. Dengan demikian, penelitian ini berhasil menciptakan website yang lebih efisien dan memenuhi kebutuhan serta preferensi pelanggan, meningkatkan efisiensi operasional dan kepuasan pelanggan.",
    "keywords": "",
    "author": "NUR FAJRI FADHIL HUMAM",
    "lecturer": "Achmad Muzakki, Adzanil Rachmadhi Putra",
    "publisher": "Universitas Telkom, S1 Sistem Informasi - Kampus Surabaya",
    "publish_year": "2024"
  },
  {
    "title": "DESAIN DAN IMPLEMENTASI WEBSITE E-COMMERCE PENJUALAN MERCHANDISE DAN KOMIK DENGAN UML ICONIX PROCESS (STUDI KASUS: PT WIBER INDONESIA MULTIBISNIS-NEO PARADIGM COMICS) - Dalam bentuk buku karya ilmiah ",
    "classification": "Karya Ilmiah - Skripsi (S1) - Reference",
    "type_publication": "Website",
    "subject": "38 kali",
    "abstract": "Neo Paradigm Comics (NPC) adalah perusahaan yang bergerak di bidang industri kreatif termasuk di dalamnya adalah pengelolaan Kekayaan Intelektual.   Kekayaan Intelektual adalah suatu hasil karya yang timbul dari kegiatan kreatif dan intelektual seseorang, meliputi berbagai jenis karya dan inovasi yang dapat dilindungi oleh hukum, seperti hak cipta, merek, paten, rahasia dagang, dan desain industri. Neo Paradigma Comic pertama kali didirikan di Surabaya pada bulan Desember 2006 dengan nama Neo Paradigma Studio. Neo Paradigma Comic telah memiliki website resmi untuk profil perusahaan Neo Paradigma Studio. Dari website perusahaan yang telah dibuat, terdapat beberapa kekurangan pada website tersebut, kekurangan tersebut antara lain UI/UX pada profil perusahaan yang kurang efisien, saat ini pembayaran belum menyediakan hingga payment gateway, hal ini menjadi penghambat perusahaan pada website tersebut. Metode yang digunakan untuk menyelesaikan permasalahan tersebut adalah dengan menggunakan metode pengembangan Software Development Life Cycle (Prototype) yaitu pendekatan pengembangan perangkat lunak yang melibatkan serangkaian tahapan yang berulang-ulang, dan untuk metode perancangan menggunakan UML ICONIX PROCESS yaitu metode yang lebih berfokus pada kebutuhan perusahaan dan menyederhanakan proses serta tidak terlalu banyak membahas tentang analisis, desain dan implementasi program, sehingga proses pengembangan website akan lebih efisien. Metode UML ICONIX PROCESS meliputi empat tahapan, yaitu: 1. Analisis kebutuhan (Kebutuhan Fungsional, Pemodelan Domain, GUI Storyboard, Pemodelan Use Case); 2. Analisis dan desain awal (Analisis Robustness, Pembaruan Model Domain), 3. Desain Detail (Sequence Diagram, Pembaruan Model Domain), 4. Implementasi (Pengkodean/Pengujian Unit, Integrasi dan Pengujian Skenario). Berdasarkan latar belakang tersebut, perusahaan membutuhkan sebuah website yang lebih praktis dan efisien. Selain itu, perusahaan juga membutuhkan sebuah website E-Commerce yang dapat menjual produk perusahaan, pengujian dilakukan dengan menggunakan metode black box testing, boundary value analysis testing (BVA), dan user acceptance testing (UAT). Tujuan dari penelitian ini adalah membangun sebuah website e-commerce dengan website final menggunakan Laravel. Dengan adanya website yang akan dibuat, perusahaan dapat meningkatkan efisiensi, dan memperkuat bisnis. Namun, aplikasi ini memiliki batasan dimana hanya Neo Paradigma Comic yang dapat menggunakan aplikasi ini.\n \nKata Kunci: NPC, Laravel, SDLC Prototype, UML ICONIX PROCESS, E- Commerce",
    "keywords": "",
    "author": "ADYAN IZZA MUHAMMAD ARKANANTA",
    "lecturer": "Achmad Muzakki, Adzanil Rachmadhi Putra",
    "publisher": "Universitas Telkom, S1 Sistem Informasi - Kampus Surabaya",
    "publish_year": "2024"
  },
  {
    "title": "DESAIN DAN REALISASI RADIO KOMUNIKASI PENDETEKSI KAPAL MULTI KANAL  UNTUK MUATAN SATELIT NANO - Dalam bentuk buku karya ilmiah ",
    "classification": "Karya Ilmiah - Skripsi (S1) - Reference",
    "type_publication": "Komunikasi Satelit",
    "subject": "31 kali",
    "abstract": "Automatic Identification System (AIS)  merupakan teknologi penting dalam pelacakan dan pengelolaan lalu lintas kapal serta keselamatan maritim. Namun, jangkauan komunikasi yang terbatas antara kapal dan stasiun darat menjadi kendala utama dalam efektivitas pemantauan, terutama di wilayah maritim yang luas dan terpencil. Untuk mengatasi hambatan tersebut, penelitian ini bertujuan mengembangkan sistem penerima AIS multi-kanal yang terintegrasi pada satelit nano. Integrasi penerima AIS ke dalam satelit nano dengan orbit rendah (LEO) dengan ketinggian (300-400 km) memungkinkan perluasan jangkauan pemantauan secara signifikan, sehingga kapal yang berada di lokasi terpencil tetap dapat terpantau dengan baik.",
    "keywords": "",
    "author": "I PUTU GEDE RUSMA WIRAWAN",
    "lecturer": "Rizki Ardianto Priramadhi, Edwar",
    "publisher": "Universitas Telkom, S1 Teknik Elektro",
    "publish_year": "2024"
  },
  {
    "title": "Desain dan Realisasi Radio Komunikasi Pendeteksi Kapal Multi Kanal untuk Muatan Satelit Nano - Dalam bentuk buku karya ilmiah ",
    "classification": "Karya Ilmiah - Skripsi (S1) - Reference",
    "type_publication": "Komunikasi Satelit",
    "subject": "33 kali",
    "abstract": "Automatic Identification System (AIS) merupakan teknologi penting dalam pelacakan dan pengelolaan lalu lintas kapal serta keselamatan maritim. Namun, jangkauan komunikasi yang terbatas antara kapal dan stasiun darat menjadi kendala utama dalam efektivitas pemantauan, terutama di wilayah maritim yang luas dan terpencil. Untuk mengatasi hambatan tersebut, penelitian ini bertujuan mengembangkan sistem penerima AIS multi-kanal yang terintegrasi pada satelit nano. Integrasi penerima AIS ke dalam satelit nano dengan orbit rendah (LEO) dengan ketinggian (300-400 km) memungkinkan perluasan jangkauan pemantauan secara signifikan, sehingga kapal yang berada di lokasi terpencil tetap dapat terpantau dengan baik. Penelitian ini berfokus pada pengembangan papan sirkuit cetak (PCB) penerima AIS yang mampu menerima dan menerjemahkan komunikasi AIS dua kanal. Penerima AIS ini dirancang agar dapat terintegrasi dengan satelit nano. Pengujian dan validasi dilakukan untuk memastikan bahwa penerima AIS dapat berfungsi dengan optimal ketika sudah terintegrasi dengan satelit nano. Hasil dari penelitian ini menunjukkan bahwa penerima AIS yang dikembangkan berhasil diintegrasikan ke dalam satelit nano dengan format PCB PC/104 (89 x 92 mm) dan memiliki konsumsi daya kurang dari 2 Watt. Perangkat mampu menerima dan mendekode sinyal AIS dari kapal secara akurat dengan jangkauan terjauh 55km secara riil dan mampu menjangkau 400km secara teoritis. Informasi yang diberikan dari hasil dekode tersebut berupa MMSI, kecepatan, arah gerak dan posisi geografis kapal. Dengan teknologi ini, jangkauan pemantauan kapal dapat diperluas secara global, memberikan kontribusi signifikan dalam pengelolaan lalu lintas maritim dan peningkatan keselamatan. Sistem ini juga membuka peluang untuk pengembangan lebih lanjut dalam pemantauan maritim yang lebih efisien dan efektif, serta memberikan data yang lebih komprehensif bagi otoritas maritim.",
    "keywords": "",
    "author": "MUHAMMAD IQBAL PRASETYA",
    "lecturer": "Rizki Ardianto Priramadhi, Edwar",
    "publisher": "Universitas Telkom, S1 Teknik Elektro",
    "publish_year": "2024"
  },
  {
    "title": "DESAIN DAN REALISASI RADIO KOMUNIKASI PENDETEKSI KAPAL MULTI KANAL UNTUK MUATAN SATELIT NANO - Dalam bentuk buku karya ilmiah ",
    "classification": "Karya Ilmiah - Skripsi (S1) - Reference",
    "type_publication": "Communication-satellites",
    "subject": "32 kali",
    "abstract": "Automatic Identification System (AIS) merupakan teknologi penting dalam pelacakan dan pengelolaan lalu lintas kapal serta keselamatan maritim. Namun, jangkauan komunikasi yang terbatas antara kapal dan stasiun darat menjadi kendala utama dalam efektivitas pemantauan, terutama di wilayah maritim yang luas dan terpencil. Untuk mengatasi hambatan tersebut, penelitian ini bertujuan mengembangkan sistem penerima AIS multi-kanal yang terintegrasi pada satelit nano. Integrasi penerima AIS ke dalam satelit nano dengan orbit rendah (LEO) dengan ketinggian (300-400 km) memungkinkan perluasan jangkauan pemantauan secara signifikan, sehingga kapal yang berada di lokasi terpencil tetap dapat terpantau dengan baik.",
    "keywords": "",
    "author": "DIVA AULIYA ZULKARNAEN",
    "lecturer": "Rizki Ardianto Priramadhi, Edwar",
    "publisher": "Universitas Telkom, S1 Teknik Elektro",
    "publish_year": "2024"
  },
  {
    "title": "Deteksi Kondisi Kesehatan Gigi Pada Citra Intraoral Menggunakan Convolutional Neural Network (CNN) - Dalam bentuk buku karya ilmiah ",
    "classification": "Karya Ilmiah - Skripsi (S1) - Reference",
    "type_publication": "Machine Learning",
    "subject": "44 kali",
    "abstract": "Kesehatan gigi dan mulut memiliki dampak signifikan terhadap kesehatan manusia secara keseluruhan. Permasalahan utama yang dihadapi dalam menjaga kesehatan gigi dan mulut di Indonesia adalah rendahnya kesadaran masyarakat tentang pentingnya perawatan gigi, distribusi dokter gigi yang tidak merata, antrian panjang, dan keterbatasan jam kerja di klinik gigi. Meskipun pemeriksaan gigi idealnya dilakukan setiap enam bulan sekali, banyak masyarakat yang mengabaikan hal ini karena berbagai kendala, seperti biaya yang mahal dn antrian yang panjang. Penelitian ini bertujuan untuk mendeteksi kondisi kesehatan gigi menggunakan metode convolutional neural network (CNN). Metode ini dipilih karena kemampuannya dalam mengenali pola dan fitur pada citra digital. CNN adalah salah satu metode deep learning  yang paling sering digunakan untuk pemecahan masalah deteksi objek dan klasifikasi gambar. CNN memiliki tingkat akurasi yang tinggi dan telah menunjukkan hasil yang signifikan dalam pengenalan citra. Data yang digunakan dalam penelitian ini didapatkan dari google images dan dokter gigi ortodontis. Dataset pada penelitian ini berupa citra intraoral dengan total keseluruhan 5404 citra yang terbagi menjadi lima kelas, yaitu normal, karies, impaksi, sisa akar, dan selain gigi. Dataset ini kemudian dibagi menjadi tiga subset, yaitu 70% data training, 20% data validation, dan 10% data testing. Teknik pelabelan dilakukan secara langsung oleh dokter gigi untuk memastikan keakuratan label pada citra yang digunakan. Proses preprocessing meliputi cleansing data, resize images, dan augmentasi data. Cleansing data dilakukan untuk memastikan kualitas citra yang digunakan dalam pelatihan model. Resize images dilakukan untuk menyeragamkan ukuran citra. Augmentasi data dilakukan untuk meningkatkan variasi dataset dan mencegah overfitting pada model. Model CNN yang digunakan pada penelitian ini dirancang melalui berbagai eksperimen berdasarkan layer, filter, learning rate, dan batch size. Konfigurasi terbaik yang ditemukan berdasarkan eksperimen adalah model dengan layer dan filter sebesar 32, 32, 64, 64, 64, 128, learning rate sebesar 0,001, dan batch size sebesar 64. Model ini berhasil mencapai akurasi keseluruhan sebesar 96%, yang menunjukkan performa yang sangat baik dalam mendeteksi kondisi kesehatan gigi. Hasil penelitian ini diimplementasikan ke website yang ditujukan untuk membantu dokter dalam mendeteksi masalah kesehatan gigi secara lebih cepat dan akurat. Dengan adanya alat bantu ini, diharapkan dapat mengurangi masalah distribusi dokter gigi yang tidak merata, antrian panjang di klinik, dan meningkatkan efisiensi pelayanan kesehatan gigi. Secara keseluruhan, penelitian ini menunjukkan bahwa penerapan teknologi deep learning, seperti CNN dalam bidang kesehatan gigi memiliki potensi besar untuk meningkatkan kualitas layanan kesehatan. Dengan akurasi yang tinggi, model ini dapat menjadi alat bantu yang efektif bagi dokter gigi, serta memberikan kesadaran lebih kepada masyarakat mengenai pentingnya perawatan gigi yang rutin. Penelitian ini juga membuka peluang untuk pengembangan lebih lanjut dalam aplikasi teknologi AI di bidang kesehatan lainnya. Dengan adanya sistem deteksi otomatis ini, diharapkan masyarakat dapat lebih proaktif dalam menjaga kesehatan gigi dan mulut manusia. Peningkatan kesadaran dan deteksi masalah gigi dapat mengurangi risiko komplikasi yang memerlukan perawatan lebih lanjut. Implementasi teknologi deep learning  dalam sistem deteksi kesehatan gigi ini merupakan langkah maju dalam integrasi teknologi informasi dan kesehatan. Dengan adanya penelitian ini, diharapkan dapat menjadi inspirasi bagi penelitian-penelitian selanjutnya dalam penerapan teknologi AI untuk berbagai aspek kesehatan lainnya. Dengan demikian, penggunaan teknologi AI dapat semakin luas dan memberikan manfaat bagi kehidupan manusia.",
    "keywords": "",
    "author": "WULAN PERMATA SANDHI",
    "lecturer": "Moh. Hamim Zajuli Al Faroby",
    "publisher": "Universitas Telkom, S1 Sistem Informasi - Kampus Surabaya",
    "publish_year": "2024"
  },
  {
    "title": "ENHANCING PRICE PREDICTION ACCURACY FOR INDONESIA RICE COMMODITY: A MACHINE LEARNING AND FACTOR-BASED RESEARCH - Dalam bentuk buku karya ilmiah ",
    "classification": "Karya Ilmiah - Skripsi (S1) - Reference",
    "type_publication": "Machine Learning",
    "subject": "57 kali",
    "abstract": "Harga komoditas pangan memegang peranan penting dalam stabilitas ekonomi dan kesejahteraan masyarakat. Riset dari Badan Pusat Statistik menunjukkan bahwa pada Maret 2018, Garis Kemiskinan Makanan (GKM) menyumbang 73,48% terhadap garis kemiskinan, sementara sisanya berasal dari komoditas non pangan (perumahan, sandang, pendidikan, dan kesehatan). Namun, terdapat tantangan dalam pengelolaan harga pangan, yaitu keterbatasan kemampuan untuk mengidentifikasi periode-periode tertentu di mana harga pangan mengalami kenaikan signifikan. Oleh sebab itu, akses informasi yang akurat dan real time mengenai pergerakan harga pangan di masa depan sangat penting untuk pengambilan kebijakan yang efektif, seperti melalui intervensi pasar yang tepat maupun kebijakan lainnya.\n\nUntuk mengatasi masalah ini, solusi yang diusulkan melalui Capstone Design, yang merupakan hasil kerjasama antara Telkom University, Badan Pangan Nasional, dan Badan Riset dan Inovasi Nasional, adalah aplikasi berbasis website yang menampilkan data historis serta prediksi harga pangan dengan menggunakan algoritma Temporal Fusion Transformer (TFT). Model ini dirancang dengan mempertimbangkan berbagai faktor yang mempengaruhi fluktuasi harga pangan, termasuk tanggal-tanggal penting, stok pangan, dan variabel-variabel relevan lainnya. Tujuannya adalah untuk menyediakan visualisasi pergerakan historis harga pangan, prediksi harga di masa mendatang, serta pengaruh berbagai variabel terhadap prediksi tersebut.\n\nPengujian menunjukkan bahwa algoritma yang dikembangkan memiliki akurasi hingga 99% untuk prediksi selama 30 hari. Website yang terintegrasi dengan algoritma ini juga memberikan pengalaman pengguna yang baik, terbukti dengan skor rata-rata SUS mencapai 87,08. Secara keseluruhan, performa website ini optimal dan efisien dengan waktu loading di bawah 5 detik.",
    "keywords": "",
    "author": "MAULAYA RADHIBILLA",
    "lecturer": "Suryo Adhi Wibowo, Koredianto Usman",
    "publisher": "Universitas Telkom, S1 Teknik Telekomunikasi",
    "publish_year": "2024"
  },
  {
    "title": "ENHANCING PRICE PREDICTION ACCURACY FOR INDONESIA RICE COMMODITY: A MACHINE LEARNING AND FACTOR-BASED RESEARCH - Dalam bentuk buku karya ilmiah ",
    "classification": "Karya Ilmiah - Skripsi (S1) - Reference",
    "type_publication": "Machine Learning",
    "subject": "51 kali",
    "abstract": "Harga komoditas pangan memegang peranan penting dalam stabilitas ekonomi dan kesejahteraan masyarakat. Riset dari Badan Pusat Statistik menunjukkan bahwa pada Maret 2018, Garis Kemiskinan Makanan (GKM) menyumbang 73,48% terhadap garis kemiskinan, sementara sisanya berasal dari komoditas non pangan (perumahan, sandang, pendidikan, dan kesehatan). Namun, terdapat tantangan dalam pengelolaan harga pangan, yaitu keterbatasan kemampuan untuk mengidentifikasi periode-periode tertentu di mana harga pangan mengalami kenaikan signifikan. Oleh sebab itu, akses informasi yang akurat dan real time mengenai pergerakan harga pangan di masa depan sangat penting untuk pengambilan kebijakan yang efektif, seperti melalui intervensi pasar yang tepat maupun kebijakan lainnya.\n\nUntuk mengatasi masalah ini, solusi yang diusulkan melalui Capstone Design, yang merupakan hasil kerjasama antara Telkom University, Badan Pangan Nasional, dan Badan Riset dan Inovasi Nasional, adalah aplikasi berbasis website yang menampilkan data historis serta prediksi harga pangan dengan menggunakan algoritma Temporal Fusion Transformer (TFT). Model ini dirancang dengan mempertimbangkan berbagai faktor yang mempengaruhi fluktuasi harga pangan, termasuk tanggal-tanggal penting, stok pangan, dan variabel-variabel relevan lainnya. Tujuannya adalah untuk menyediakan visualisasi pergerakan historis harga pangan, prediksi harga di masa mendatang, serta pengaruh berbagai variabel terhadap prediksi tersebut.\n\nPengujian menunjukkan bahwa algoritma yang dikembangkan memiliki akurasi hingga 99% untuk prediksi selama 30 hari. Website yang terintegrasi dengan algoritma ini juga memberikan pengalaman pengguna yang baik, terbukti dengan skor rata-rata SUS mencapai 87,08. Secara keseluruhan, performa website ini optimal dan efisien dengan waktu loading di bawah 5 detik.",
    "keywords": "",
    "author": "MUHAMMAD BILLY JULYANO",
    "lecturer": "Suryo Adhi Wibowo, Koredianto Usman",
    "publisher": "Universitas Telkom, S1 Teknik Telekomunikasi",
    "publish_year": "2024"
  },
  {
    "title": "EVALUASI DAN PERANCANGAN ULANG UI/UX  APLIKASI DLU FERRY MENGGUNAKAN METODE UX HONEYCOMB DAN HUMAN CENTERED DESIGN - Dalam bentuk buku karya ilmiah ",
    "classification": "Karya Ilmiah - Skripsi (S1) - Reference",
    "type_publication": "Human Computer Interaction",
    "subject": "33 kali",
    "abstract": "Dalam era digital saat ini, aplikasi DLU Ferry memegang peran penting dalam",
    "keywords": "",
    "author": "AHMAD ZHILAL FANANI",
    "lecturer": "Ully Asfari, Rosyid Abdillah",
    "publisher": "Universitas Telkom, S1 Sistem Informasi Kampus surabaya",
    "publish_year": "2024"
  },
  {
    "title": "EVALUASI KEAMANAN SISTEM INFORMASI WEBSITE RUMAH SAKIT XYZ MELALUI PENETRATION TESTING MENGGUNAKAN FRAMEWORK ISSAF - Dalam bentuk buku karya ilmiah ",
    "classification": "Karya Ilmiah - Skripsi (S1) - Reference",
    "type_publication": "Keamanan",
    "subject": "43 kali",
    "abstract": "Dalam proses pengembangan sebuah situs web, keamanan merupakan aspek krusial yang harus diperhatikan. RUMAH SAKIT XYZ adalah sebuah organisasi pelayanan kesehatan yang berlokasi di. RUMAH SAKIT XYZ memiliki sebuah situs web layanan masyarakat yang mengelola data sensitif pasien dan operasional rumah sakit. Website ini menyimpan data sensitif yang memerlukan pengujian keamanan untuk mencegah pencurian data medis atau penyalahgunaan hak akses. Berdasarkan hasil wawancara peneliti dengan pihak terkait, di ketahui bahwa dalam dua tahun terakhir Website XYZ sudah dua kali mendapat percobaan cyber crime. Penting untuk mengambil tindakan preventif dalam mengamankan Website XYZ dan pada penelitian ini scoupe pengujian meliputi Domain XYZ dan Subdomain XYZ. Penelitian ini mengusulkan metode Penetration testing dengan memanfaatkan kerangka kerja ISSAF (Information Systems Security Assessment Framework) guna mengidentifikasi potensi celah keamanan dan mengevaluasi tingkat keamanan jaringan pada situs web rumah sakit tersebut. Framework ISSAF mencakup sembilan tahap pengujian serangan yang meliputi Information Gathering, Network Mapping, Vulnerability Identification, Penetration, Gauining Access and Privilege Escalation, Enumerating Further, Compromise Remote User/Sites, Maintaining Access, dan Covering Tracks. Tujuan penelitian ini adalah untuk mencari celah keamanan dan mengetahui tingkat keamanan jaringan XYZ, guna menghindari adanya tindakan yang tidak diinginkan seperti pencurian data medis atau penyalahgunaan hak akses situs web rumah sakit. Hasil penelitian menunjukkan bahwa sistem keamanan website RUMAH SAKIT XYZmemiliki beberapa kelemahan yang signifikan, termasuk kerentanan terhadap serangan brute force dan SQL injection. Namun, mekanisme perlindungan seperti WAF/IPS dan CAPTCHA terbukti efektif dalam mencegah beberapa serangan yang dicoba, menyoroti perlunya peningkatan lebih lanjut dalam konfigurasi keamanan dan pemantauan sistem secara berkala.",
    "keywords": "",
    "author": "BEIVENLY ANDREA JAYADIVA SAMPELAN",
    "lecturer": "Kharisma Monika Dian Pertiwi, Purnama Anaking",
    "publisher": "Universitas Telkom, S1 Sistem Informasi - Kampus Surabaya",
    "publish_year": "2024"
  },
  {
    "title": "FishQ: Aplikasi Pengidentifikasi Kesegaran Ikan Menggunakan Metode Deep Learning - Capstone ",
    "classification": "Karya Ilmiah - Skripsi (S1) - Reference",
    "type_publication": "Pengolahan Sinyal Informasi",
    "subject": "59 kali",
    "abstract": "Industri perikanan di Indonesia memiliki peran penting dalam perekonomian nasional dan kesejahteraan masyarakat. Namun, proses sortasi ikan masih sering dilakukan secara konvensional dengan mengandalkan pengamatan visual, yang rentan terhadap kesalahan dan kurang efisien. Pengamatan konvensional ini dapat mengakibatkan penurunan kualitas produk serta kerugian ekonomi yang signifikan karena ikan yang tidak segar mungkin lolos dalam proses sortasi. Oleh karena itu, diperlukan solusi yang dapat meningkatkan keakuratan dan efisiensi dalam penilaian kesegaran ikan.\n\nSebagai solusi untuk mengatasi masalah tersebut, dikembangkanlah FishQ, sebuah aplikasi berbasis metode deep learning yang menggunakan model YOLOv8 untuk mendeteksi dan mengklasifikasikan kesegaran ikan. FishQ dirancang untuk dapat diakses oleh berbagai pemangku kepentingan dalam rantai pasok perikanan. Aplikasi ini mengintegrasikan teknologi deteksi objek untuk menganalisis citra ikan secara otomatis dan memberikan penilaian yang akurat mengenai kesegaran ikan tersebut.\n\nHasil penelitian menunjukkan bahwa aplikasi FishQ mampu mengidentifikasi kesegaran ikan cakalang baik dalam kondisi beku maupun tidak beku dengan nilai mAP 94,7% untuk ikan beku dan 91,3% untuk ikan tidak beku. Berdasarkan pengujian terhadap citra ikan, FishQ berhasil mendeteksi hingga 91% citra ikan secara tepat. Berdasarkan hasil pengujian system usability yang dilakukan oleh 103 responden, aplikasi FishQ mendapatkan total nilai SUS (System Usability Scale) sebesar 86,87 dengan grade A yang menunjukkan bahwa aplikasi dapat diterima dan digunakan oleh pengguna dengan sistem operasi Android. Penggunaan aplikasi ini diharapkan dapat mempercepat proses penilaian kesegaran dibandingkan dengan metode konvensional.\n\nKata kunci: FishQ, kesegaran ikan, deep learning, YOLOv8, deteksi objek.",
    "keywords": "",
    "author": "RABBY FITRIANA ADAWIYAH",
    "lecturer": "Ledya Novamizanti, Suryo Adhi Wibowo",
    "publisher": "Universitas Telkom, S1 Teknik Telekomunikasi",
    "publish_year": "2024"
  },
  {
    "title": "FishQ: Aplikasi Pengidentifikasi Kesegaran Ikan Menggunakan Metode Deep Learning - Dalam bentuk buku karya ilmiah ",
    "classification": "Karya Ilmiah - Skripsi (S1) - Reference",
    "type_publication": "Pengolahan Sinyal Informasi",
    "subject": "40 kali",
    "abstract": "Industri perikanan di Indonesia memiliki peran penting dalam perekonomian nasional dan kesejahteraan masyarakat. Namun, proses sortasi ikan masih sering dilakukan secara konvensional dengan mengandalkan pengamatan visual, yang rentan terhadap kesalahan dan kurang efisien. Pengamatan konvensional ini dapat mengakibatkan penurunan kualitas produk serta kerugian ekonomi yang signifikan karena ikan yang tidak segar mungkin lolos dalam proses sortasi. Oleh karena itu, diperlukan solusi yang dapat meningkatkan keakuratan dan efisiensi dalam penilaian kesegaran ikan.\n\nSebagai solusi untuk mengatasi masalah tersebut, dikembangkanlah FishQ, sebuah aplikasi berbasis metode deep learning yang menggunakan model YOLOv8 untuk mendeteksi dan mengklasifikasikan kesegaran ikan. FishQ dirancang untuk dapat diakses oleh berbagai pemangku kepentingan dalam rantai pasok perikanan. Aplikasi ini mengintegrasikan teknologi deteksi objek untuk menganalisis citra ikan secara otomatis dan memberikan penilaian yang akurat mengenai kesegaran ikan tersebut.\n\nHasil penelitian menunjukkan bahwa aplikasi FishQ mampu mengidentifikasi kesegaran ikan cakalang baik dalam kondisi beku maupun tidak beku dengan nilai mAP 94,7% untuk ikan beku dan 91,3% untuk ikan tidak beku. Berdasarkan pengujian terhadap citra ikan, FishQ berhasil mendeteksi hingga 91% citra ikan secara tepat. Berdasarkan hasil pengujian system usability yang dilakukan oleh 103 responden, aplikasi FishQ mendapatkan total nilai SUS (System Usability Scale) sebesar 86,87 dengan grade A yang menunjukkan bahwa aplikasi dapat diterima dan digunakan oleh pengguna dengan sistem operasi Android. Penggunaan aplikasi ini diharapkan dapat mempercepat proses penilaian kesegaran dibandingkan dengan metode konvensional.\n\nKata kunci: FishQ, kesegaran ikan, deep learning, YOLOv8, deteksi objek.",
    "keywords": "",
    "author": "RIFQI FADHILAH FIRDAUS",
    "lecturer": "Ledya Novamizanti, Suryo Adhi Wibowo",
    "publisher": "Universitas Telkom, S1 Teknik Telekomunikasi",
    "publish_year": "2024"
  },
  {
    "title": "IDENTIFIKASI KEPRIBADIAN ANAK SEBAGAI REKOMENDASI PENDAMPINGAN UNTUK GURU DAN ORANG TUA - Dalam bentuk buku karya ilmiah ",
    "classification": "Karya Ilmiah - Skripsi (S1) - Reference",
    "type_publication": "Machine - Learning",
    "subject": "43 kali",
    "abstract": "Kepribadian seseorang mencerminkan identitas individu yang tidak selalu terlihat secara fisik. Kepribadian atau personality dapat dipengaruhi oleh lingkungan, keluarga, dan bawaan sejak lahir. Masa emas anak, atau the Golden Age, adalah periode kritis dalam perkembangan di mana potensi kepribadian harus distimulasi secara optimal untuk menghindari masalah di masa depan. Kepribadian anak yang terbentuk dari pola asuh di rumah memiliki dampak signifikan yang terbawa ke lingkungan sekolah, sehingga penting bagi orang tua dan guru untuk memahami kepribadian anak guna memberikan dukungan yang tepat. Namun, tes psikologi yang digunakan saat ini untuk menilai kepribadian anak sering kali kurang maksimal karena durasi yang panjang dan kurangnya persetujuan dari orang tua.\nSebagai solusi, proyek ini mengembangkan sebuah sistem berbasis pembelajaran mesin yang dapat mengidentifikasi kepribadian anak melalui analisis garis telapak tangan yang disajikan dalam bentuk aplikasi mobile bernama Persona. Aplikasi ini dirancang untuk memberikan cara yang lebih efisien dan akurat dalam mengidentifikasi kepribadian anak. Dengan aplikasi ini, diharapkan dapat membantu guru dan orang tua dalam mengenali kepribadian siswa dan anaknya.\nHasil pengujian menunjukkan bahwa aplikasi Persona efektif dalam mengidentifikasi kepribadian anak dengan tingkat akurasi yang tinggi. Pengujian algoritma deteksi telapak tangan mencapai akurasi 100%, mAP50 99,5%, dan mAP50-95 97,4%. Algoritma klasifikasi menunjukkan akurasi 92,3% pada data pelatihan dan 92,2% pada data pengujian untuk model pertama, serta akurasi 100% pada data pelatihan dan 93,3% pada data pengujian untuk model kedua. Pengujian sistem deteksi pada aplikasi menunjukkan akurasi sebesar 100% ketika kondisi di luar ruangan dengan jarak pengambilan gambar 30 cm dan sudut 90°. Pengujian alfa menunjukkan bahwa aplikasi berfungsi 100% sesuai fungsinya, pengujian unit mencapai 100%, pengujian beban mengindikasikan bahwa sistem API dapat berjalan efisien pada beban ringan hingga sedang, namun tidak efisien ketika menghadapi beban berat. Pengujian beta mendapatkan nilai Koefisien Cronbach Alpha sebesar 0,91, melebihi titik kritis 0,220. Hasil identifikasi sudah divalidasi oleh guru BK dengan rata-rata sebesar 78,39%. Sementara itu, validasi dengan membandingkan hasil identifikasi dengan aplikasi lain mendapatkan rata-rata 57,78%. UAT di SD Maria Bintang Laut oleh Guru BK menyatakan bahwa aplikasi Persona membantu dalam mengidentifikasi kepribadian siswa.\n\nKata kunci: garis telapak tangan, aplikasi mobile, kepribadian anak, pembelajaran mesin",
    "keywords": "",
    "author": "ALIFIA MUTIARA RAHMA",
    "lecturer": "Casi Setianingsih, Marisa W. Paryasto",
    "publisher": "Universitas Telkom, S1 Teknik Komputer",
    "publish_year": "2024"
  },
  {
    "title": "IDENTIFIKASI KEPRIBADIAN ANAK SEBAGAI REKOMENDASI PENDAMPINGAN UNTUK GURU DAN ORANG TUA - Dalam bentuk buku karya ilmiah ",
    "classification": "Karya Ilmiah - Skripsi (S1) - Reference",
    "type_publication": "Machine Learning",
    "subject": "45 kali",
    "abstract": "Kepribadian seseorang mencerminkan identitas individu yang tidak selalu terlihat secara fisik. Kepribadian atau personality dapat dipengaruhi oleh lingkungan, keluarga, dan bawaan sejak lahir. Masa emas anak, atau the Golden Age, adalah periode kritis dalam perkembangan di mana potensi kepribadian harus distimulasi secara optimal untuk menghindari masalah di masa depan. Kepribadian anak yang terbentuk dari pola asuh di rumah memiliki dampak signifikan yang terbawa ke lingkungan sekolah, sehingga penting bagi orang tua dan guru untuk memahami kepribadian anak guna memberikan dukungan yang tepat. Namun, tes psikologi yang digunakan saat ini untuk menilai kepribadian anak sering kali kurang maksimal karena durasi yang panjang dan kurangnya persetujuan dari orang tua.\nSebagai solusi, proyek ini mengembangkan sebuah sistem berbasis pembelajaran mesin yang dapat mengidentifikasi kepribadian anak melalui analisis garis telapak tangan yang disajikan dalam bentuk aplikasi mobile bernama Persona. Aplikasi ini dirancang untuk memberikan cara yang lebih efisien dan akurat dalam mengidentifikasi kepribadian anak. Dengan aplikasi ini, diharapkan dapat membantu guru dan orang tua dalam mengenali kepribadian siswa dan anaknya.\n?Hasil pengujian menunjukkan bahwa aplikasi Persona efektif dalam mengidentifikasi kepribadian anak dengan tingkat akurasi yang tinggi. Pengujian algoritma deteksi telapak tangan mencapai akurasi 100%, mAP50 99,5%, dan mAP50-95 97,4%. Algoritma klasifikasi menunjukkan akurasi 92,3% pada data pelatihan dan 92,2% pada data pengujian untuk model pertama, serta akurasi 100% pada data pelatihan dan 93,3% pada data pengujian untuk model kedua. Pengujian sistem deteksi pada aplikasi menunjukkan akurasi sebesar 100% ketika kondisi di luar ruangan dengan jarak pengambilan gambar 30 cm dan sudut 90°. Pengujian alfa menunjukkan bahwa aplikasi berfungsi 100% sesuai fungsinya, pengujian unit mencapai 100%, pengujian beban mengindikasikan bahwa sistem API dapat berjalan efisien pada beban ringan hingga sedang, namun tidak efisien ketika menghadapi beban berat. Pengujian beta mendapatkan nilai Koefisien Cronbach Alpha sebesar 0,91, melebihi titik kritis 0,220. Hasil identifikasi sudah divalidasi oleh guru BK dengan rata-rata sebesar 78,39%. Sementara itu, validasi dengan membandingkan hasil identifikasi dengan aplikasi lain mendapatkan rata-rata 57,78%. UAT di SD Maria Bintang Laut oleh Guru BK menyatakan bahwa aplikasi Persona membantu dalam mengidentifikasi kepribadian siswa.\n\nKata kunci: garis telapak tangan, aplikasi mobile, kepribadian anak, pembelajaran mesin",
    "keywords": "",
    "author": "RIZKY RAMADHANI SYAM",
    "lecturer": "Casi Setianingsih, Marisa W. Paryasto",
    "publisher": "Universitas Telkom, S1 Teknik Komputer",
    "publish_year": "2024"
  },
  {
    "title": "IDENTIFIKASI KEPRIBADIAN ANAK SEBAGAI REKOMENDASI PENDAMPINGAN UNTUK GURU DAN ORANG TUA - Dalam bentuk buku karya ilmiah ",
    "classification": "Karya Ilmiah - Skripsi (S1) - Reference",
    "type_publication": "Machine Learning",
    "subject": "38 kali",
    "abstract": "Kepribadian seseorang mencerminkan identitas individu yang tidak selalu terlihat secara",
    "keywords": "",
    "author": "GALIH KARYA GEMILANG",
    "lecturer": "Casi Setianingsih, Marisa W. Paryasto",
    "publisher": "Universitas Telkom, S1 Teknik Komputer",
    "publish_year": "2024"
  },
  {
    "title": "IMPLEMENTASI SISTEM INFORMASI PEMINJAMAN BARANG DAN RUANGAN BERBASIS WEBSITE MENGGUNAKAN SDLC PROTOTYPE (STUDI KASUS: UNIT LOGISTIK TELKOM UNIVERSITY SURABAYA - Dalam bentuk buku karya ilmiah ",
    "classification": "Karya Ilmiah - Skripsi (S1) - Reference",
    "type_publication": "Sistem Informasi",
    "subject": "32 kali",
    "abstract": "Unit logistik merupakan bagian penting yang ada di Telkom University Surabaya. Tugas dan tanggung jawabnya adalah mengelola dan memelihara aset Telkom University Surabaya. Aset tersebut berupa fasilitas ruangan dan fasilitas barang guna menunjang aktivitas belajar mengajar. Semakin meningkat aktivitas mahasiswa, maka semakin tinggi pula jumlah peminjaman pada unit logistik. Proses peminjaman barang seringkali mengalami berbagai kendala, terutama pada proses pencatatan dan pengajuan peminjaman yang masih manual sehingga berdampak pada ketertiban mahasiswa dalam pengembalian barang. Oleh karena itu, dalam upaya menertibkan administrasi peminjaman aset logistik, perlu dilakukan perancangan sistem informasi peminjaman barang dan ruang, untuk menangani permasalahan proses peminjaman aset unit logistik Telkom University Surabaya. Sistem informasi berbasis website ini juga akan memudahkan mahasiswa untuk melihat ketersediaan barang yang akan dipinjam. Penelitian ini menggunakan metode SDLC yaitu prototype untuk membangun sistem informasi peminjaman barang dan ruang unit logistik Telkom University Surabaya. Penggunaan metode prototype pada penelitian ini dikarenakan pengguna memiliki requirement yang cenderung berubah-ubah. Dengan metode prototype, akan ada komunikasi yang baik antara pengembang dan pengguna sistem, sehingga dapat memberikan penyamaan presepsi dan pemahaman awal dari sistem yang akan dikembangkan. Dalam mengembangkan Sistem Informasi peminjaman barang dan ruang berbasis website digunakan bahasa pemrograman PHP dengan framework laravel. Hasil pengujian sistem website menggunakan black box testing dengan menyusun poin poin pengujian fungsionalitas sistem untuk mengukur sebuah sistem telah sesuai dengan requirement-nya.\n \nKata Kunci: Sistem Informasi, Peminjaman Aset, PHP, Metode Prototype",
    "keywords": "",
    "author": "SINTA REGITA PUTRI",
    "lecturer": "Muhamad Nasrullah, Adzanil Rachmadhi Putra",
    "publisher": "Universitas Telkom, S1 Sistem Informasi kampus surabaya",
    "publish_year": "2024"
  },
  {
    "title": "Implementation Intelligent Monitoring System based on Electricity Consumption for Telkom University Classroom - Dalam bentuk buku karya ilmiah ",
    "classification": "Karya Ilmiah - Skripsi (S1) - Reference",
    "type_publication": "Tugas Akhir",
    "subject": "38 kali",
    "abstract": "Gedung Telkom University Landmark Tower (TULT) merupakan salah satu gedung perkuliahan yang berada di Universitas Telkom, pada setiap ruangan kelas sudah terpasang CCTV untuk memantau atau memonitor ruangan selama 24 jam. Berdasarkan hasil observasi dalam penggunaan fasilitas elektronik, pengguna secara tidak sengaja meninggalkan ruangan dengan kondisi lampu, TV, dan AC masih dalam keadaan menyala. Hal tersebut dapat mengakibatkan adanya kerugian dari Universitas Telkom karena harus membayar biaya penggunaan energi listrik lebih banyak.\nOleh karena itu pada penelitian ini, menjelaskan mengenai pengimplementasian Intelligent Monitoring System (IMS) yang digunakan untuk memantau dan mengontrol kondisi ruang kelas dari jarak jauh, alat yang digunakan untuk memantau ruang kelas adalah CCTV, sedangkan untuk alat kontrol menggunakan perangkat IoT, dan menggunakan sebuah website untuk mengetahui kondisi ruang kelas dari jarak jauh. Penulis menggunakan saklar yang dapat terhubung internet sebagai perangkat IoT untuk dapat mengontrol lampu, TV dan AC yang tersedia pada ruangan kelas. Dalam konteks ini, penulis menggunakan salah satu cabang ilmu deep learning dengan metode YOLOv8 dan nilai confidence level 0.1 untuk mendeteksi keberadaan manusia pada ruang kelas. Hasil pengujian ini menunjukkan bahwa penggunaan metode YOLOv8 dan nilai confidence level 0.1 dalam mendeteksi manusia pada ruang kelas diperoleh tingkat akurasi 100%, sensitifitas 100%, dan spesifisitas 100%. Sehingga metode YOLOv8 dan nilai confidence level 0.1 yang digunakan dalam penelitian ini.\nBerdasarkan hasil penelitian mengungkapkan bahwa mayoritas pengguna memberikan penilaian sangat ramah (64,3%) dan ramah (28,6%) dengan skor 4-5 (skala 5) terhadap fitur pilihan pada menu mobile website, hal ini menunjukkan tingkat kepuasan tinggi terhadap efektivitas dan kegunaan fitur tersebut. Sementara itu, Sebagian kecil (7,1%) menyatakan cukup ramah terhadap fitur yang tersedia pada mobile website. Penelitian ini melibatkan 14 orang yang terdiri dari satpam, pegawai dan mahasiswa Universitas Telkom. Kesimpulan singkat dari pengimplementasian IMS ini menunjukkan bahwa sistem tersebut berhasil memenuhi kebutuhan teknis dan ekspektasi pengguna sebagai alat bantu yang efektif dalam menangani permasalahan. kata kunci : Fasilitas Elektronik, IMS, Ruang Kelas, Website.",
    "keywords": "",
    "author": "ILHAM KURNIAWAN",
    "lecturer": "Suryo Adhi Wibowo, Taufan Umbara",
    "publisher": "Universitas Telkom, S1 Teknik Telekomunikasi",
    "publish_year": "2024"
  },
  {
    "title": "Implementation Intelligent Monitoring System based on Electricity Consumption for Telkom University Classroom - Dalam bentuk buku karya ilmiah ",
    "classification": "Karya Ilmiah - Skripsi (S1) - Reference",
    "type_publication": "Tugas Akhir",
    "subject": "33 kali",
    "abstract": "Gedung Telkom University Landmark Tower (TULT) merupakan salah satu gedung perkuliahan yang berada di Universitas Telkom, pada setiap ruangan kelas sudah terpasang CCTV untuk memantau atau memonitor ruangan selama 24 jam. Berdasarkan hasil observasi dalam penggunaan fasilitas elektronik, pengguna secara tidak sengaja meninggalkan ruangan dengan kondisi lampu, TV, dan AC masih dalam keadaan menyala. Hal tersebut dapat mengakibatkan adanya kerugian dari Universitas Telkom karena harus membayar biaya penggunaan energi listrik lebih banyak.\nOleh karena itu pada penelitian ini, menjelaskan mengenai pengimplementasian Intelligent Monitoring System (IMS) yang digunakan untuk memantau dan mengontrol kondisi ruang kelas dari jarak jauh, alat yang digunakan untuk memantau ruang kelas adalah CCTV, sedangkan untuk alat kontrol menggunakan perangkat IoT, dan menggunakan sebuah website untuk mengetahui kondisi ruang kelas dari jarak jauh. Penulis menggunakan saklar yang dapat terhubung internet sebagai perangkat IoT untuk dapat mengontrol lampu, TV dan AC yang tersedia pada ruangan kelas. Dalam konteks ini, penulis menggunakan salah satu cabang ilmu deep learning dengan metode YOLOv8 dan nilai confidence level 0.1 untuk mendeteksi keberadaan manusia pada ruang kelas. Hasil pengujian ini menunjukkan bahwa penggunaan metode YOLOv8 dan nilai confidence level 0.1 dalam mendeteksi manusia pada ruang kelas diperoleh tingkat akurasi 100%, sensitifitas 100%, dan spesifisitas 100%. Sehingga metode YOLOv8 dan nilai confidence level 0.1 yang digunakan dalam penelitian ini.\nBerdasarkan hasil penelitian mengungkapkan bahwa mayoritas pengguna memberikan penilaian sangat ramah (64,3%) dan ramah (28,6%) dengan skor 4-5 (skala 5) terhadap fitur pilihan pada menu mobile website, hal ini menunjukkan tingkat kepuasan tinggi terhadap efektivitas dan kegunaan fitur tersebut. Sementara itu, Sebagian kecil (7,1%) menyatakan cukup ramah terhadap fitur yang tersedia pada mobile website. Penelitian ini melibatkan 14 orang yang terdiri dari satpam, pegawai dan mahasiswa Universitas Telkom. Kesimpulan singkat dari pengimplementasian IMS ini menunjukkan bahwa sistem tersebut berhasil memenuhi kebutuhan teknis dan ekspektasi pengguna sebagai alat bantu yang efektif dalam menangani permasalahan",
    "keywords": "",
    "author": "FIONA OKKI RAHMALISTY",
    "lecturer": "Suryo Adhi Wibowo, Taufan Umbara",
    "publisher": "Universitas Telkom, S1 Teknik Telekomunikasi",
    "publish_year": "2024"
  },
  {
    "title": "KLASIFIKASI KUALITAS AIR SUNGAI CITARUM MENGGUNAKAN PEMBELAJARAN MESIN  BERBASIS WEBSITE - Dalam bentuk buku karya ilmiah ",
    "classification": "Karya Ilmiah - Skripsi (S1) - Reference",
    "type_publication": "Machine - Learning",
    "subject": "44 kali",
    "abstract": "Sungai terpanjang di Jawa Barat yaitu Sungai Citarum memiliki panjang 323 km dan mengalir dari Situ Cisanti di Kabupaten Bandung ke Laut Jawa. Sungai tersebut memiliki peran penting dalam ekosistem dan kehidupan masyarakat setempat. Pada tahun 2018, itu dinobatkan sebagai sungai terkotor di dunia. Kondisi ini menyebabkan banyak masalah lingkungan dan kesehatan yang serius yang berpengaruh terhadap kehidupan masyarakat sekitar. Masyarakat tentu tidak mengetahui apakah kualitas air sungai tersebut tercemar\nringan, tercemar sedang, ataupun tercemar berat.\n\nUntuk mengatasi permasalahan seberapa tercemar kualitas air Sungai Citarum, dapat menggunakan sebuah cabang dari Machine Learning yaitu Supervised Learning. Ada 3 Model Machine Learning yang kami gunakan untuk mengetahui kualitas air sungai citarum yaitu Artificial Neural Network, Gaussian Naive Bayes, dan Weighted K-Nearest Neighbor dengan Euclidean Distance. Nantinya hasil klasifikasinya ditampilkan dalam sebuah website yang dilengkapi dengan peta interaktif dan kalkulator manual untuk menunjukkan seberapa tercemarnya aliran sungai citarum di beberapa titik.\n\nDari hasil penelitian yang sudah kami lakukan, didapatkan bahwa Weighted KNN with Euclidean Distance mendapatkan akurasi sebesar 97.3% lebih tinggi dibandingkan kedua model yang lain. Hasil ini yang kami tampilkan di dalam website kami yang bernama Citasi (Citarum Quality Water Classification). Dengan dibuatnya website ini masyarakat dapat dengan mudah mengetahui kualitas air Sungai Citarum di beberapa titik aliran sungai tersebut.\n\nKata kunci: Kualitas Air Sungai, Machine Learning, Website",
    "keywords": "",
    "author": "ARDHIEN FADHILLAH SUHARTONO",
    "lecturer": "Meta Kallista, Ig. Prasetya Dwi Wibawa",
    "publisher": "Universitas Telkom, S1 Teknik Komputer",
    "publish_year": "2024"
  },
  {
    "title": "KLASIFIKASI KUALITAS AIR SUNGAI CITARUM MENGGUNAKAN PEMBELAJARAN MESIN BERBASIS WEBSITE - Dalam bentuk buku karya ilmiah ",
    "classification": "Karya Ilmiah - Skripsi (S1) - Reference",
    "type_publication": "Machine - Learning",
    "subject": "37 kali",
    "abstract": "Sungai terpanjang di Jawa Barat yaitu Sungai Citarum memiliki panjang 323 km dan mengalir dari Situ Cisanti di Kabupaten Bandung ke Laut Jawa. Sungai tersebut memiliki peran penting dalam ekosistem dan kehidupan masyarakat setempat. Pada tahun 2018, itu dinobatkan sebagai sungai terkotor di dunia. Kondisi ini menyebabkan banyak masalah lingkungan dan kesehatan yang serius yang berpengaruh terhadap kehidupan masyarakat sekitar. Masyarakat tentu tidak mengetahui apakah kualitas air sungai tersebut tercemar ringan, tercemar sedang, ataupun tercemar berat. Untuk mengatasi permasalahan seberapa tercemar kualitas air Sungai Citarum, dapat menggunakan sebuah cabang dari Machine Learning yaitu Supervised Learning. Ada 3 Model Machine Learning yang kami gunakan untuk mengetahui kualitas air sungai citarum yaitu Artificial Neural Network, Gaussian Naive Bayes, dan Weighted K-Nearest Neighbor dengan Euclidean Distance. Nantinya hasil klasifikasinya ditampilkan dalam sebuah website yang dilengkapi dengan peta interaktif dan kalkulator manual untuk menunjukkan seberapa tercemarnya aliran sungai citarum di beberapa titik. Dari hasil penelitian yang sudah kami lakukan, didapatkan bahwa Weighted KNN with Euclidean Distance mendapatkan akurasi sebesar 97.3% lebih tinggi dibandingkan kedua model yang lain. Hasil ini yang kami tampilkan di dalam website kami yang bernama Citasi (Citarum Quality Water Classification). Dengan dibuatnya website ini masyarakat dapat dengan mudah mengetahui kualitas air Sungai Citarum di beberapa titik aliran sungai tersebut.\n\nKata kunci: Kualitas Air Sungai, Machine Learning, Website",
    "keywords": "",
    "author": "DAFFA ASYQAR AHMAD KHALISHEKA",
    "lecturer": "Meta Kallista, Ig. Prasetya Dwi Wibawa",
    "publisher": "Universitas Telkom, S1 Teknik Komputer",
    "publish_year": "2024"
  },
  {
    "title": "OPTIMASI AKSESIBILITAS MESSENGER BAGI PENGGUNA KETERBATASAN MOBILITAS MENGGUNAKAN OBSERVASI SEMI-STRUCTURED INTERVIEWS TESTING (STUDI KASUS : WHATSAPP) - Dalam bentuk buku karya ilmiah ",
    "classification": "Karya Ilmiah - Skripsi (S1) - Reference",
    "type_publication": "Design User Interface",
    "subject": "38 kali",
    "abstract": "Whatsapp telah banyak digunakan di Indonesia sebagai aplikasi untuk berkomunikasi dengan keluarga dan teman. Aplikasi Whatsapp adalah aplikasi cukup         familiar dan mudah digunakan oleh beberapa kalangan, dan aplikasi tersebut telah menyediakan berbagai fasilitas aksesibilitas untuk beberapa kelompok disabilitas, termasuk tuna rungu, tuna wicara, dan tuna netra. Namun, masih terdapat kekurangan                    dalam aksesibilitas, khususnya bagi pengguna dengan keterbatasan mobilitas Cerebral Palsy. Hal ini mengakibatkan penggunaan layanan Whatsapp belum dapat  diakses sepenuhnya oleh semua kalangan. Penelitian ini bertujuan untuk mengatasi masalah tersebut melalui evaluasi disability dengan accessibility Whatsapp terhadap siswa-siswi dengan keterbatasan mobilitas Cerebral Palsy di Sekolah Luar Biasa-D YPAC Surabaya. Evaluasi dalam penelitian ini dilakukan dengan menggunakan Observations dan Semi-Structured Interviews. \nSelama proses Interviews akan direkam, di transkrip, dan dianalisis menggunakan thematic analysis. Parameter utama dalam proses Usability Testing tersebut adalah Inclusive Design dengan Web Content Accessibility Guidelines 2.1 (WCAG 2.1). Setelah didapatkan hasil evaluasi   disability dan accessibility penggunaan Whatsapp, proses perancangan ulang Whatsapp dengan menggunakan metode Design Thinking dan luaran yang dihasilkan dari metode ini adalah Empathize, Define, Ideate, Prototype. Hasil dari penelitian ini adalah data analisis aksesibilitas dan usabilitas pengguna aplikasi whatsapp bagi pengguna keterbatasan mobilitas cerebral palsy jenis cerebral palsy spastik diplegia dan quadriplegia yaitu pasrtisipan mengalami kesulitan dalam beberapa pengunaan menu dan halaman pada whatsapp. Dan terdapat juga rekomendasi perbaikan yang diberikan oleh peneliti dari sisi user interface dan user experience bagi pengguna keterbatasan mobilitas cerebral palsy spastik diplegia dan quadriplegia adalah menambahkan button scrollbar disetiap tampilan halaman pada aplikasi, khususnya tampilan pesan, panggilan, status, dan mengganti profil foto pribadi\nKata kunci— Whatsapp, Cerebral Palsy, Inclusive Design, Design Thinking, Usability, Accessibility",
    "keywords": "",
    "author": "NUR IKA AINI OKTAVIA",
    "lecturer": "Ully Asfari, Rosyid Abdillah",
    "publisher": "Universitas Telkom, S1 Sistem Informasi - Kampus Surabaya",
    "publish_year": "2024"
  },
  {
    "title": "PEMANFAATAN SAMPAH ORGANIK RUMAH TANGGA MENJADI BIOGAS SEBAGAI ENERGI TERBARUKAN DAN TERINTEGRASI DENGAN INTERNET OF THINGS - Capstone ",
    "classification": "Karya Ilmiah - Skripsi (S1) - Reference",
    "type_publication": "Iot",
    "subject": "46 kali",
    "abstract": "Peningkatan kebutuhan energi dan keinginan untuk mengurangi ketergantungan pada sumber daya fosil mendorong pengembangan sumber energi terbarukan, salah satunya adalah biogas. Proyek tugas akhir ini berfokus pada implementasi sistem Internet of Things (IoT) untuk memonitor dan mengoptimalkan produksi biogas. Sistem ini dirancang untuk mengumpulkan, menganalisis, dan menampilkan data real-time dari proses produksi biogas menggunakan berbagai sensor yang terhubung melalui jaringan IoT.\nSistem IoT ini mencakup sensor suhu, kelembaban, dan tekanan gas yang semuanya terintegrasi ke dalam sebuah platform. Data yang dikumpulkan oleh sensor-sensor ini dikirim ke server untuk dianalisis dan kemudian ditampilkan dalam bentuk yang mudah dipahami melalui antarmuka pengguna yang ramah. Analisis data dilakukan untuk mengidentifikasi pola dan anomali yang dapat mempengaruhi efisiensi produksi biogas, serta untuk memberikan rekomendasi dalam pengelolaan sistem.\nHasil dari implementasi sistem IoT pada reaktor biogas menunjukkan peningkatan efisiensi produksi dan pengurangan gangguan operasional. Sistem ini memungkinkan pengawasan yang lebih akurat dan responsif terhadap kondisi reaktor, serta membantu dalam pengambilan keputusan yang lebih tepat berdasarkan data real-time. Dengan demikian, proyek ini menunjukkan bahwa integrasi teknologi IoT dalam produksi biogas dapat menjadi solusi yang efektif untuk meningkatkan kinerja dan keberlanjutan sistem energi terbarukan.\nKata kunci: Biogas, Internet of Things (IoT), energi terbarukan, sensor, monitoring, analisis data.\n",
    "keywords": "",
    "author": "PRADIPA CATYA WISESA",
    "lecturer": "Rendy Munadi, Sussi",
    "publisher": "Universitas Telkom, S1 Teknik Telekomunikasi",
    "publish_year": "2024"
  },
  {
    "title": "PEMANFAATAN SAMPAH ORGANIK RUMAH TANGGA MENJADI BIOGAS SEBAGAI ENERGI TERBARUKAN DAN TERINTEGRASI DENGAN INTERNET OF THINGS - Dalam bentuk buku karya ilmiah ",
    "classification": "Karya Ilmiah - Skripsi (S1) - Reference",
    "type_publication": "Biogas",
    "subject": "47 kali",
    "abstract": "Peningkatan kebutuhan energi dan keinginan untuk mengurangi ketergantungan pada sumber daya fosil mendorong pengembangan sumber energi terbarukan, salah satunya adalah biogas. Proyek tugas akhir ini berfokus pada implementasi sistem Internet of Things (IoT) untuk memonitor dan mengoptimalkan produksi biogas. Sistem ini dirancang untuk mengumpulkan, menganalisis, dan menampilkan data real-time dari proses produksi biogas menggunakan berbagai sensor yang terhubung melalui jaringan IoT.\nSistem IoT ini mencakup sensor suhu, kelembaban, dan tekanan gas yang semuanya terintegrasi ke dalam sebuah platform. Data yang dikumpulkan oleh sensor-sensor ini dikirim ke server untuk dianalisis dan kemudian ditampilkan dalam bentuk yang mudah dipahami melalui antarmuka pengguna yang ramah. Analisis data dilakukan untuk mengidentifikasi pola dan anomali yang dapat mempengaruhi efisiensi produksi biogas, serta untuk memberikan rekomendasi dalam pengelolaan sistem.\nHasil dari implementasi sistem IoT pada reaktor biogas menunjukkan peningkatan efisiensi produksi dan pengurangan gangguan operasional. Sistem ini memungkinkan pengawasan yang lebih akurat dan responsif terhadap kondisi reaktor, serta membantu dalam pengambilan keputusan yang lebih tepat berdasarkan data real-time. Dengan demikian, proyek ini menunjukkan bahwa integrasi teknologi IoT dalam produksi biogas dapat menjadi solusi yang efektif untuk meningkatkan kinerja dan keberlanjutan sistem energi terbarukan.\nKata kunci: Biogas, Internet of Things (IoT), energi terbarukan, sensor, monitoring, analisis data.",
    "keywords": "",
    "author": "BINTANG INDRA MAULANA",
    "lecturer": "Rendy Munadi, Sussi",
    "publisher": "Universitas Telkom, S1 Teknik Telekomunikasi",
    "publish_year": "2024"
  },
  {
    "title": "PEMBANGUNAN SISTEM INFORMASI MANAJEMEN INVENTORY STOCK BARANG  BERBASIS WEB MENGGUNAKAN METODE SDLC PROTOTYPE  PADA CV BERKAH BAN - Dalam bentuk buku karya ilmiah ",
    "classification": "Karya Ilmiah - Skripsi (S1) - Reference",
    "type_publication": "Inventory",
    "subject": "40 kali",
    "abstract": "CV Berkah Ban bergerak di sektor jual beli ban yang berlokasi di Surabaya. Saat ini, pengelolaan bisnisnya masih dilakukan secara manual sehingga terdapat beberapa kendala seperti pencatatan laporan keluar masuk barang, kesulitan mencari data barang, pengelolaan stok barang di gudang, dan pengecekan persediaan barang. Berdasarkan permasalahan di atas, dibutuhkan suatu sistem informasi manajemen pada CV Berkah Ban untuk mengatasi berbagai kendala tersebut. Metode yang digunakan dalam pengembangan sistem informasi ini adalah SDLC (System Development Life Cycle) prototyping. Metode ini dipilih karena memungkinkan pemahaman kebutuhan yang lebih baik dengan melibatkan pengguna sejak tahap awal pengembangan. Dengan metode prototyping, pengguna dapat melihat dan merasakan bagaimana sistem akan berfungsi di tahap awal, sehingga dapat memberikan umpan balik yang lebih konkret. Umpan balik ini sangat penting untuk memahami kebutuhan pengguna secara lebih mendalam dan memastikan bahwa sistem yang dikembangkan benar-benar sesuai dengan kebutuhan bisnis. Metode prototyping terdiri dari beberapa tahap, yaitu pengumpulan dan analisis kebutuhan (requirements gathering and analysis), desain cepat (quick design), pembangunan prototipe (build prototype), evaluasi pengguna (user evaluation), penyempurnaan prototipe (refining prototype), implementasi produk (implement product), dan pemeliharaan (maintain). Dalam tahap pengujian, digunakan metode blackbox testing dan white box testing untuk memastikan bahwa sistem berfungsi dengan baik dan memenuhi semua persyaratan yang telah ditetapkan. Pada tahap implementasi, digunakan framework Laravel dan database MySQL untuk membangun sistem informasi manajemen yang handal dan efisien. Dengan dibuatnya sistem informasi manajemen ini, berbagai permasalahan yang terjadi pada CV Berkah Ban dapat diatasi. Sistem ini mempermudah pencarian informasi, proses keluar masuk data barang, serta pengelolaan persediaan barang. Selain itu, sistem ini juga mampu menghasilkan grafik penjualan dan laporan penjualan yang sangat berguna untuk analisis bisnis dan pengambilan keputusan. Sistem informasi manajemen yang baru ini juga merupakan solusi yang hemat biaya untuk pencarian informasi dan pelaporan penjualan, karena mengurangi ketergantungan pada proses manual yang memakan waktu dan rentan terhadap kesalahan. Selain mengatasi masalah-masalah yang ada, sistem informasi manajemen ini juga membawa beberapa keuntungan tambahan. Pertama, sistem ini meningkatkan efisiensi operasional dengan mengotomatisasi berbagai proses yang sebelumnya dilakukan secara manual. Kedua, sistem ini meningkatkan akurasi data dengan mengurangi kesalahan manusia dalam pencatatan dan pelaporan. Ketiga, sistem ini memberikan visibilitas yang lebih baik terhadap stok barang dan penjualan, sehingga memudahkan manajemen dalam mengambil keputusan yang tepat.Implementasi sistem informasi manajemen ini juga berdampak positif pada kepuasan pelanggan. Dengan sistem yang lebih efisien dan akurat, CV Berkah Ban dapat memberikan layanan yang lebih cepat dan responsif kepada pelanggan. Misalnya, dengan kemampuan untuk melacak persediaan barang secara real-time, perusahaan dapat memastikan bahwa barang yang dibutuhkan pelanggan selalu tersedia. Selain itu, laporan penjualan yang akurat dan tepat waktu memungkinkan perusahaan untuk menyesuaikan strategi pemasaran dan penjualan mereka sesuai dengan tren pasar dan kebutuhan pelanggan. Secara keseluruhan, pengembangan dan implementasi sistem informasi manajemen pada CV Berkah Ban merupakan langkah penting untuk meningkatkan kinerja dan daya saing perusahaan. Dengan sistem yang baru ini, CV Berkah Ban dapat mengoptimalkan operasional bisnisnya, meningkatkan akurasi dan efisiensi, serta memberikan layanan yang lebih baik kepada pelanggan. Selain itu, sistem ini juga memberikan alat yang berguna untuk analisis dan pengambilan keputusan, yang sangat penting untuk pertumbuhan dan kesuksesan jangka panjang perusahaan.\nKata Kunci:  Sistem monitoring stock ban",
    "keywords": "",
    "author": "DANIEL CHRISTIAN WINOTO",
    "lecturer": "Rokhmatul Insani",
    "publisher": "Universitas Telkom, S1 Sistem Informasi - Kampus Surabaya",
    "publish_year": "2024"
  },
  {
    "title": "Pemilah Sampah Otomatis untuk Pengelolaan Sampah - Dalam bentuk buku karya ilmiah ",
    "classification": "Karya Ilmiah - Skripsi (S1) - Reference",
    "type_publication": "Machine - Learning",
    "subject": "39 kali",
    "abstract": "Pengelolaan sampah yang efisien dan efektif di lingkungan akademis merupakan hal yang penting untuk menjaga kebersihan dan kelestarian lingkungan. Pengelolaan sampah di Universitas Telkom masih memiliki tantangan, seperti kurangnya pemilahan sampah yang tepat dan keterbatasan fasilitas pendukung. Masalah utama penelitian ini adalah bagaimana mengembangkan sistem pemilahan sampah otomatis yang dapat mengatasi kendala tersebut. Penelitian ini menawarkan solusi dengan mengembangkan sebuah sistem pemilahan sampah otomatis yang menggunakan teknologi sensor dan pemrosesan data untuk memisahkan sampah berdasarkan kategori yang telah ditentukan. \nSistem ini dirancang untuk meningkatkan efisiensi dan efektivitas dalam pengelolaan sampah di lingkungan kampus, serta mengurangi beban kerja manual dalam proses pemilahan sampah. Hasil penelitian menunjukkan bahwa sistem pemilahan sampah otomatis mampu meningkatkan tingkat pemilahan sampah dibandingkan metode konvensional. Selain itu, sistem ini juga berhasil mengurangi waktu yang dibutuhkan untuk pemilahan sampah Kesimpulannya, pengembangan sistem ini dapat memberikan kontribusi positif dalam upaya pengelolaan sampah yang lebih baik di Universitas Telkom.",
    "keywords": "",
    "author": "ZULIAN WAHID",
    "lecturer": "Meta Kallista, Ig. Prasetya Dwi Wibawa",
    "publisher": "Universitas Telkom, S1 Teknik Komputer",
    "publish_year": "2024"
  },
  {
    "title": "Pengembangan Aplikasi Rekomendasi Makanan Sehat Berbasis Mobile - Dalam bentuk buku karya ilmiah ",
    "classification": "Karya Ilmiah - Skripsi (S1) - Reference",
    "type_publication": "Mobile Application",
    "subject": "57 kali",
    "abstract": "Isu kesehatan yang disebabkan oleh buruknya kualitas makanan tidak pernah memandang usia, berbagai pengaturan pola makan sehat dapat menjadi tindakan preventif demi mencegah terjadinya penyakit kronis. Dalam upaya meningkatkan kesehatan masyarakat, penggunaan teknologi informasi dapat meningkatkan layanan kesehatan secara signifikan khususnya seperti aplikasi kesehatan berbasis mobile yang memfasilitasi pengaturan pola makan. Oleh karena itu, dikembangkanlah aplikasi rekomendasi makanan sehat yang bertujuan untuk membantu pengguna dalam memilih variasi makanan berdasarkan nilai nutrisi, kondisi kesehatan, dan preferensi pribadi seperti penyakit, alergi, dan program diet yang dibutuhkan setiap pengguna. Metodologi pengembangan aplikasi meliputi pengumpulan dan analisis data nutrisi yang diikuti oleh implementasi machine learning dalam menyesuaikan variasi makanan dengan kondisi kesehatan serta preferensi pengguna. Hasil pengujian aplikasi menunjukkan bahwa aplikasi secara efektif dapat memberikan rekomendasi makanan yang sesuai dengan kebutuhan setiap penggunanya. Penggunaan aplikasi rekomendasi makanan sehat ini dapat memberikan kontribusi signifikan dalam membantu pengguna untuk membuat pilihan makanan yang lebih tepat.",
    "keywords": "",
    "author": "ACHMAD RIONOV FADDILLAH RAMADHAN",
    "lecturer": "Purba Daru Kusuma, Anggunmeka Luhur Prasasti",
    "publisher": "Universitas Telkom, S1 Teknik Komputer",
    "publish_year": "2024"
  },
  {
    "title": "PENGEMBANGAN APLIKASI REKOMENDASI MAKANAN SEHAT BERBASIS MOBILE - Dalam bentuk buku karya ilmiah ",
    "classification": "Karya Ilmiah - Skripsi (S1) - Reference",
    "type_publication": "Mobile Application",
    "subject": "46 kali",
    "abstract": "Isu kesehatan yang disebabkan oleh buruknya kualitas makanan tidak pernah memandang usia, berbagai pengaturan pola makan sehat dapat menjadi tindakan preventif demi mencegah terjadinya penyakit kronis. Dalam upaya meningkatkan kesehatan masyarakat, penggunaan teknologi informasi dapat meningkatkan layanan kesehatan secara signifikan khususnya seperti aplikasi kesehatan berbasis mobile yang memfasilitasi pengaturan pola makan. Oleh karena itu, dikembangkanlah aplikasi rekomendasi makanan sehat yang bertujuan untuk membantu pengguna dalam memilih variasi makanan berdasarkan nilai nutrisi, kondisi kesehatan, dan preferensi pribadi seperti penyakit, alergi, dan program diet yang dibutuhkan setiap pengguna. Metodologi pengembangan aplikasi meliputi pengumpulan dan analisis data nutrisi yang diikuti oleh implementasi machine learning dalam menyesuaikan variasi makanan dengan kondisi kesehatan serta preferensi pengguna. Hasil pengujian aplikasi menunjukkan bahwa aplikasi secara efektif dapat memberikan rekomendasi makanan yang sesuai dengan kebutuhan setiap penggunanya. Penggunaan aplikasi rekomendasi makanan sehat ini dapat memberikan kontribusi signifikan dalam membantu pengguna untuk membuat pilihan makanan yang lebih tepat.",
    "keywords": "",
    "author": "HURIN SALIMAH",
    "lecturer": "Purba Daru Kusuma, Anggunmeka Luhur Prasasti",
    "publisher": "Universitas Telkom, S1 Teknik Komputer",
    "publish_year": "2024"
  },
  {
    "title": "Pengembangan Aplikasi Rekomendasi Makanan Sehat Berbasis Mobile - Dalam bentuk buku karya ilmiah ",
    "classification": "Karya Ilmiah - Skripsi (S1) - Reference",
    "type_publication": "Mobile Application",
    "subject": "43 kali",
    "abstract": "Isu kesehatan yang disebabkan oleh buruknya kualitas makanan tidak pernah memandang usia, berbagai pengaturan pola makan sehat dapat menjadi tindakan preventif demi mencegah terjadinya penyakit kronis. Dalam upaya meningkatkan kesehatan masyarakat, penggunaan teknologi informasi dapat meningkatkan layanan kesehatan secara signifikan khususnya seperti aplikasi kesehatan berbasis mobile yang memfasilitasi pengaturan pola makan. Oleh karena itu, dikembangkanlah aplikasi rekomendasi makanan sehat yang bertujuan untuk membantu pengguna dalam memilih variasi makanan berdasarkan nilai nutrisi, kondisi kesehatan, dan preferensi pribadi seperti penyakit, alergi, dan program diet yang dibutuhkan setiap pengguna. Metodologi pengembangan aplikasi meliputi pengumpulan dan analisis data nutrisi yang diikuti oleh implementasi machine learning dalam menyesuaikan variasi makanan dengan kondisi kesehatan serta preferensi pengguna. Hasil pengujian aplikasi menunjukkan bahwa aplikasi secara efektif dapat memberikan rekomendasi makanan yang sesuai dengan kebutuhan setiap penggunanya. Penggunaan aplikasi rekomendasi makanan sehat ini dapat memberikan kontribusi signifikan dalam membantu pengguna untuk membuat pilihan makanan yang lebih tepat.",
    "keywords": "",
    "author": "ALVIN YOGA NUGRAHA",
    "lecturer": "Purba Daru Kusuma, Anggunmeka Luhur Prasasti",
    "publisher": "Universitas Telkom, S1 Teknik Komputer",
    "publish_year": "2024"
  },
  {
    "title": "Pengembangan Aplikasi Rekomendasi Makanan Sehat Berbasis Mobile - Dalam bentuk buku karya ilmiah ",
    "classification": "Karya Ilmiah - Skripsi (S1) - Reference",
    "type_publication": "Mobile Application",
    "subject": "37 kali",
    "abstract": "Isu kesehatan yang disebabkan oleh buruknya kualitas makanan tidak pernah memandang usia, berbagai pengaturan pola makan sehat dapat menjadi tindakan preventif demi mencegah terjadinya penyakit kronis. Dalam upaya meningkatkan kesehatan masyarakat, penggunaan teknologi informasi dapat meningkatkan layanan kesehatan secara signifikan khususnya seperti aplikasi kesehatan berbasis mobile yang memfasilitasi pengaturan pola makan. Oleh karena itu, dikembangkanlah aplikasi rekomendasi makanan sehat yang bertujuan untuk membantu pengguna dalam memilih variasi makanan berdasarkan nilai nutrisi, kondisi kesehatan, dan preferensi pribadi seperti penyakit, alergi, dan program diet yang dibutuhkan setiap pengguna. Metodologi pengembangan aplikasi meliputi pengumpulan dan analisis data nutrisi yang diikuti oleh implementasi machine learning dalam menyesuaikan variasi makanan dengan kondisi kesehatan serta preferensi pengguna. Hasil pengujian aplikasi menunjukkan bahwa aplikasi secara efektif dapat memberikan rekomendasi makanan yang sesuai dengan kebutuhan setiap penggunanya. Penggunaan aplikasi rekomendasi makanan sehat ini dapat memberikan kontribusi signifikan dalam membantu pengguna untuk membuat pilihan makanan yang lebih tepat.",
    "keywords": "",
    "author": "RATIKA DWI ANGGRAINI",
    "lecturer": "Purba Daru Kusuma, Anggunmeka Luhur Prasasti",
    "publisher": "Universitas Telkom, S1 Teknik Komputer",
    "publish_year": "2024"
  },
  {
    "title": "PENGEMBANGAN APLIKASI UNTUK MENDUKUNG KETERLIBATAN MAHASISWA DALAM KEGIATAN PROGRAM STUDI TEKNIK KOMPUTER  - Capstone ",
    "classification": "Karya Ilmiah - Skripsi (S1) - Reference",
    "type_publication": "Aplikasi",
    "subject": "40 kali",
    "abstract": "Perkembangan teknologi informasi khususnya di bidang komputer berdampak pada berbagai aspek kehidupan mahasiswa. Himpunan Mahasiswa Teknik Komputer (HMTK) berfungsi sebagai wadah bagi mahasiswa untuk mengembangkan kemampuan sosial dan kepemimpinan serta memfasilitasi pertukaran informasi terkait jurusan Teknik Komputer. Meskipun jejaring sosial menjadi sarana utama komunikasi dan pengumpulan informasi, namun masih terdapat beberapa ketidakefisienan dalam menerima dan berinteraksi informasi antar anggota HMTK. Masalah utama yang diidentifikasi adalah ketidakefektifan dalam penyebaran informasi melalui media sosial, yang menyebabkan keterlibatan mahasiswa dalam kegiatan akademik dan non-akademik menjadi kurang optimal. Media sosial digunakan oleh banyak mahasiswa untuk mendapatkan informasi tentang jurusan, tetapi informasi seringkali tersebar dan sulit diikuti, mengakibatkan kebingungan dan kurangnya partisipasi.\nPengembangan aplikasi My-HMTK dapat mengintegrasikan semua informasi yang relevan tentang kegiatan, acara, dan perkembangan jurusan disarankan. Aplikasi ini diharapkan dapat mempermudah mahasiswa dalam mengakses informasi, meningkatkan keterlibatan, dan mengoptimalkan komunikasi antara mahasiswa, dan dosen. Dengan adanya aplikasi ini, diharapkan mahasiswa dapat lebih aktif dalam kegiatan jurusan, yang akan berdampak positif pada pencapaian akademik, pengembangan keterampilan sosial, dan membangun rasa identitas serta keterikatan dengan jurusan.\n\nKata kunci : Teknologi Informasi, Teknik Komputer, HMTK, Ketidakefektifan",
    "keywords": "",
    "author": "RIZKY EKA PUTRA KUSNADY",
    "lecturer": "Anggunmeka Luhur Prasasti, Astri Novianty",
    "publisher": "Universitas Telkom, S1 Teknik Komputer",
    "publish_year": "2024"
  },
  {
    "title": "PENGEMBANGAN APLIKASI UNTUK MENDUKUNG KETERLIBATAN MAHASISWA DALAM KEGIATAN PROGRAM STUDI TEKNIK KOMPUTER - Capstone ",
    "classification": "Karya Ilmiah - Skripsi (S1) - Reference",
    "type_publication": "Aplikasi",
    "subject": "44 kali",
    "abstract": "Perkembangan teknologi informasi khususnya di bidang komputer berdampak pada berbagai aspek kehidupan mahasiswa. Himpunan Mahasiswa Teknik Komputer (HMTK) berfungsi sebagai wadah bagi mahasiswa untuk mengembangkan kemampuan sosial dan kepemimpinan serta memfasilitasi pertukaran informasi terkait jurusan Teknik Komputer. Meskipun jejaring sosial menjadi sarana utama komunikasi dan pengumpulan informasi, namun masih terdapat beberapa ketidakefisienan dalam menerima dan berinteraksi informasi antar anggota HMTK. Masalah utama yang diidentifikasi adalah ketidakefektifan dalam penyebaran informasi melalui media sosial, yang menyebabkan keterlibatan mahasiswa dalam kegiatan akademik dan non-akademik menjadi kurang optimal. Media sosial digunakan oleh banyak mahasiswa untuk mendapatkan informasi tentang jurusan, tetapi informasi seringkali tersebar dan sulit diikuti, mengakibatkan kebingungan dan kurangnya partisipasi.\nPengembangan aplikasi My-HMTK dapat mengintegrasikan semua informasi yang relevan tentang kegiatan, acara, dan perkembangan jurusan disarankan. Aplikasi ini diharapkan dapat mempermudah mahasiswa dalam mengakses informasi, meningkatkan keterlibatan, dan mengoptimalkan komunikasi antara mahasiswa, dan dosen. Dengan adanya aplikasi ini, diharapkan mahasiswa dapat lebih aktif dalam kegiatan jurusan, yang akan berdampak positif pada pencapaian akademik, pengembangan keterampilan sosial, dan membangun rasa identitas serta keterikatan dengan jurusan.\nKata kunci : Teknologi Informasi, Teknik Komputer, HMTK, Ketidakefektifan",
    "keywords": "",
    "author": "JAISY MALIKULMULKI ARASY",
    "lecturer": "Anggunmeka Luhur Prasasti, Astri Novianty",
    "publisher": "Universitas Telkom, S1 Teknik Komputer",
    "publish_year": "2024"
  },
  {
    "title": "PENGEMBANGAN APLIKASI UNTUK MENDUKUNG KETERLIBATAN MAHASISWA DALAM KEGIATAN PROGRAM STUDI TEKNIK KOMPUTER - Capstone ",
    "classification": "Karya Ilmiah - Skripsi (S1) - Reference",
    "type_publication": "Aplikasi",
    "subject": "42 kali",
    "abstract": "Perkembangan teknologi informasi khususnya di bidang komputer berdampak pada berbagai aspek kehidupan mahasiswa. Himpunan Mahasiswa Teknik Komputer (HMTK) berfungsi sebagai wadah bagi mahasiswa untuk mengembangkan kemampuan sosial dan kepemimpinan serta memfasilitasi pertukaran informasi terkait jurusan Teknik Komputer. Meskipun jejaring sosial menjadi sarana utama komunikasi dan pengumpulan informasi, namun masih terdapat beberapa ketidakefisienan dalam menerima dan berinteraksi informasi antar anggota HMTK. Masalah utama yang diidentifikasi adalah ketidakefektifan dalam penyebaran informasi melalui media sosial, yang menyebabkan keterlibatan mahasiswa dalam kegiatan akademik dan non-akademik menjadi kurang optimal. Media sosial digunakan oleh banyak mahasiswa untuk mendapatkan informasi tentang jurusan, tetapi informasi seringkali tersebar dan sulit diikuti, mengakibatkan kebingungan dan kurangnya partisipasi.\nPengembangan aplikasi My-HMTK dapat mengintegrasikan semua informasi yang relevan tentang kegiatan, acara, dan perkembangan jurusan disarankan. Aplikasi ini diharapkan dapat mempermudah mahasiswa dalam mengakses informasi, meningkatkan keterlibatan, dan mengoptimalkan komunikasi antara mahasiswa, dan dosen. Dengan adanya aplikasi ini, diharapkan mahasiswa dapat lebih aktif dalam kegiatan jurusan, yang akan berdampak positif pada pencapaian akademik, pengembangan keterampilan sosial, dan membangun rasa identitas serta keterikatan dengan jurusan?.",
    "keywords": "",
    "author": "IVAN DANIAR ARYAPUTRA PURIMAHUA",
    "lecturer": "Anggunmeka Luhur Prasasti, Astri Novianty",
    "publisher": "Universitas Telkom, S1 Teknik Komputer",
    "publish_year": "2024"
  },
  {
    "title": "PENGEMBANGAN APLIKASI UNTUK MENDUKUNG KETERLIBATAN MAHASISWA DALAM KEGIATAN PROGRAM STUDI TEKNIK KOMPUTER - Capstone ",
    "classification": "Karya Ilmiah - Skripsi (S1) - Reference",
    "type_publication": "Aplikasi",
    "subject": "41 kali",
    "abstract": "Perkembangan teknologi informasi khususnya di bidang komputer berdampak pada berbagai aspek kehidupan mahasiswa. Himpunan Mahasiswa Teknik Komputer (HMTK) berfungsi sebagai wadah bagi mahasiswa untuk mengembangkan kemampuan sosial dan kepemimpinan serta memfasilitasi pertukaran informasi terkait jurusan Teknik Komputer. Meskipun jejaring sosial menjadi sarana utama komunikasi dan pengumpulan informasi, namun masih terdapat beberapa ketidakefisienan dalam menerima dan berinteraksi informasi antar anggota HMTK. Masalah utama yang diidentifikasi adalah ketidakefektifan dalam penyebaran informasi melalui media sosial, yang menyebabkan keterlibatan mahasiswa dalam kegiatan akademik dan non-akademik menjadi kurang optimal. Media sosial digunakan oleh banyak mahasiswa untuk mendapatkan informasi tentang jurusan, tetapi informasi seringkali tersebar dan sulit diikuti, mengakibatkan kebingungan dan kurangnya partisipasi.\nPengembangan aplikasi My-HMTK dapat mengintegrasikan semua informasi yang relevan tentang kegiatan, acara, dan perkembangan jurusan disarankan. Aplikasi ini diharapkan dapat mempermudah mahasiswa dalam mengakses informasi, meningkatkan keterlibatan, dan mengoptimalkan komunikasi antara mahasiswa, dan dosen. Dengan adanya aplikasi ini, diharapkan mahasiswa dapat lebih aktif dalam kegiatan jurusan, yang akan berdampak positif pada pencapaian akademik, pengembangan keterampilan sosial, dan membangun rasa identitas serta keterikatan dengan jurusan?.\nKata kunci : Teknologi Informasi, Teknik Komputer, HMTK, Ketidakefektifan",
    "keywords": "",
    "author": "RIZKA RAHMADINA",
    "lecturer": "Anggunmeka Luhur Prasasti, Astri Novianty",
    "publisher": "Universitas Telkom, S1 Teknik Komputer",
    "publish_year": "2024"
  },
  {
    "title": "PENGEMBANGAN DIGITAL BABY SCALE-BED (DBS-BED) SERTA APLIKASI INFORMATIF “STUVENT” SEBAGAI ALAT PEMANTAUAN TUMBUH KEMBANG BAYI DAN UPAYA PENDETEKSI DINI STUNTING - Capstone ",
    "classification": "Karya Ilmiah - Skripsi (S1) - Reference",
    "type_publication": "Embedeb System",
    "subject": "37 kali",
    "abstract": "Penelitian ini mengajukan pengembangan sistem timbangan bayi interaktif sebagai langkah inovatif dalam pemantauan pertumbuhan dan deteksi dini stunting. Stunting, sebagai permasalahan kesehatan global, memiliki dampak yang signifikan terhadap perkembangan anak-anak. Sistem yang akan dikembangkan dirancang untuk menyediakan pengukuran berat badan dan tinggi badan yang akurat, sekaligus memanfaatkan konektivitas BLE dan aplikasi untuk meningkatkan pemantauan kesehatan anak secara berkala untuk pendeteksian dini stunting.\nPenelitian ini mencakup desain perangkat keras yang ergonomis dan mudah digunakan, serta pengembangan perangkat lunak yang memungkinkan pengumpulan dan analisis data secara real-time. Fitur interaktif termasuk tampilan grafis perkembangan anak dan yang utama adalah pengukuran serta penampilan hasil deteksi dini stunting. Proposal ini juga merinci uji coba lapangan untuk mengukur efektivitas dan respon pengguna terhadap sistem timbangan bayi interaktif ini.\nPenerapan sistem ini diharapkan dapat memberikan kontribusi dalam mendeteksi perubahan berat badan dan tinggi badan yang signifikan. Melalui pemantauan yang lebih aktif, diharapkan sistem ini dapat menjadi alat yang efektif dalam upaya pencegahan stunting dan peningkatan kesehatan bayi secara menyeluruh. Kata kunci: Stunting, timbangan, aplikasi, pengukuran",
    "keywords": "",
    "author": "DHI'FAN DWI NUGRAHA",
    "lecturer": "Willy Anugrah Cahyadi, Husneni Mukhtar",
    "publisher": "Universitas Telkom, S1 Teknik Elektro",
    "publish_year": "2024"
  },
  {
    "title": "PENGEMBANGAN DIGITAL BABY SCALE-BED (DBS-BED) SERTA APLIKASI INFORMATIF “STUVENT” SEBAGAI ALAT PEMANTAUAN TUMBUH KEMBANG BAYI DAN UPAYA PENDETEKSI DINI STUNTING - Dalam bentuk buku karya ilmiah ",
    "classification": "Karya Ilmiah - Skripsi (S1) - Reference",
    "type_publication": "Embedded System",
    "subject": "38 kali",
    "abstract": "Penelitian ini mengajukan pengembangan sistem timbangan bayi interaktif sebagai langkah inovatif dalam pemantauan pertumbuhan dan deteksi dini stunting. Stunting, sebagai permasalahan kesehatan global, memiliki dampak yang signifikan terhadap perkembangan anak-anak. Sistem yang akan dikembangkan dirancang untuk menyediakan pengukuran berat badan dan tinggi badan yang akurat, sekaligus memanfaatkan konektivitas BLE dan aplikasi untuk meningkatkan pemantauan kesehatan anak secara berkala untuk pendeteksian dini stunting.\nPenelitian ini mencakup desain perangkat keras yang ergonomis dan mudah digunakan, serta pengembangan perangkat lunak yang memungkinkan pengumpulan dan analisis data secara real-time. Fitur interaktif termasuk tampilan grafis perkembangan anak dan yang utama adalah pengukuran serta penampilan hasil deteksi dini stunting. Proposal ini juga merinci uji coba lapangan untuk mengukur efektivitas dan respon pengguna terhadap sistem timbangan bayi interaktif ini.\nPenerapan sistem ini diharapkan dapat memberikan kontribusi dalam mendeteksi perubahan berat badan dan tinggi badan yang signifikan. Melalui pemantauan yang lebih aktif, diharapkan sistem ini dapat menjadi alat yang efektif dalam upaya pencegahan stunting dan peningkatan kesehatan bayi secara menyeluruh.\n \nKata kunci: Stunting, timbangan, aplikasi, pengukuran.\n\n ",
    "keywords": "",
    "author": "DEMINAR RUT EL SHADAY SIRAIT",
    "lecturer": "Willy Anugrah Cahyadi, Husneni Mukhtar",
    "publisher": "Universitas Telkom, S1 Teknik Elektro",
    "publish_year": "2024"
  },
  {
    "title": "Pengembangan Sistem Informasi Manajemen Aset Berbasis Cloud pada Rumah Sakit - Capstone ",
    "classification": "Karya Ilmiah - Skripsi (S1) - Reference",
    "type_publication": "Sistem Informasi",
    "subject": "47 kali",
    "abstract": "Pada era digital, pengelolaan aset di rumah sakit menghadapi tantangan signifikan terkait efisiensi dan efektivitas. Sistem pengelolaan aset tradisional seringkali mengalami kendala dalam pelacakan real-time, ketidakakuratan data, dan keterbatasan akses informasi. Masalah utama penelitian ini adalah inefisiensi dalam pengelolaan aset yang disebabkan oleh sistem manajemen yang kurang terintegrasi dan modern.\nSolusi yang ditawarkan adalah pengembangan sistem informasi manajemen aset berbasis cloud untuk rumah sakit, yang disebut HOCARES. Sistem ini dirancang untuk mengintegrasikan berbagai proses bisnis dan memudahkan pelacakan, pemeliharaan, dan pengelolaan aset secara real-time. Dengan menggunakan teknologi cloud, sistem ini dapat memberikan aksesibilitas yang tinggi, meningkatkan transparansi, dan mendukung pengambilan keputusan yang lebih baik.\nHasil pengujian menunjukkan bahwa sistem HOCARES mampu meningkatkan efisiensi operasional dalam pengelolaan aset rumah sakit. Pengguna melaporkan bahwa sistem ini mudah digunakan dan membantu dalam memantau serta mengelola aset dengan lebih efektif. Sistem ini memberikan solusi yang tepat untuk meningkatkan kualitas pelayanan dan efisiensi operasional di rumah sakit.",
    "keywords": "",
    "author": "AL GHIFARY AKMAL NASHEERI",
    "lecturer": "Roswan Latuconsina, Purba Daru Kusuma",
    "publisher": "Universitas Telkom, S1 Teknik Komputer",
    "publish_year": "2024"
  },
  {
    "title": "Pengembangan Sistem Informasi Manajemen Aset Berbasis Cloud pada Rumah Sakit - Capstone ",
    "classification": "Karya Ilmiah - Skripsi (S1) - Reference",
    "type_publication": "Sistem Informasi",
    "subject": "39 kali",
    "abstract": "Pada era digital, pengelolaan aset di rumah sakit menghadapi tantangan signifikan terkait efisiensi dan efektivitas. Sistem pengelolaan aset tradisional seringkali mengalami kendala dalam pelacakan real-time, ketidakakuratan data, dan keterbatasan akses informasi. Masalah utama penelitian ini adalah inefisiensi dalam pengelolaan aset yang disebabkan oleh sistem manajemen yang kurang terintegrasi dan modern.\nSolusi yang ditawarkan adalah pengembangan sistem informasi manajemen aset berbasis cloud untuk rumah sakit, yang disebut HOCARES. Sistem ini dirancang untuk mengintegrasikan berbagai proses bisnis dan memudahkan pelacakan, pemeliharaan, dan pengelolaan aset secara real-time. Dengan menggunakan teknologi cloud, sistem ini dapat memberikan aksesibilitas yang tinggi, meningkatkan transparansi, dan mendukung pengambilan keputusan yang lebih baik.\nHasil pengujian menunjukkan bahwa sistem HOCARES mampu meningkatkan efisiensi operasional dalam pengelolaan aset rumah sakit. Pengguna melaporkan bahwa sistem ini mudah digunakan dan membantu dalam memantau serta mengelola aset dengan lebih efektif. Sistem ini memberikan solusi yang tepat untuk meningkatkan kualitas pelayanan dan efisiensi operasional di rumah sakit.",
    "keywords": "",
    "author": "ALVAN ALFIANSYAH",
    "lecturer": "Roswan Latuconsina, Purba Daru Kusuma",
    "publisher": "Universitas Telkom, S1 Teknik Komputer",
    "publish_year": "2024"
  },
  {
    "title": "Pengembangan Sistem Informasi Manajemen Aset Berbasis Cloud pada Rumah Sakit - Capstone ",
    "classification": "Karya Ilmiah - Skripsi (S1) - Reference",
    "type_publication": "Sistem Informasi",
    "subject": "39 kali",
    "abstract": "Pada era digital, pengelolaan aset di rumah sakit menghadapi tantangan signifikan terkait efisiensi dan efektivitas. Sistem pengelolaan aset tradisional seringkali mengalami kendala dalam pelacakan real-time, ketidakakuratan data, dan keterbatasan akses informasi. Masalah utama penelitian ini adalah inefisiensi dalam pengelolaan aset yang disebabkan oleh sistem manajemen yang kurang terintegrasi dan modern.\nSolusi yang ditawarkan adalah pengembangan sistem informasi manajemen aset berbasis cloud untuk rumah sakit, yang disebut HOCARES. Sistem ini dirancang untuk mengintegrasikan berbagai proses bisnis dan memudahkan pelacakan, pemeliharaan, dan pengelolaan aset secara real-time. Dengan menggunakan teknologi cloud, sistem ini dapat memberikan aksesibilitas yang tinggi, meningkatkan transparansi, dan mendukung pengambilan keputusan yang lebih baik.\nHasil pengujian menunjukkan bahwa sistem HOCARES mampu meningkatkan efisiensi operasional dalam pengelolaan aset rumah sakit. Pengguna melaporkan bahwa sistem ini mudah digunakan dan membantu dalam memantau serta mengelola aset dengan lebih efektif. Sistem ini memberikan solusi yang tepat untuk meningkatkan kualitas pelayanan dan efisiensi operasional di rumah sakit.",
    "keywords": "",
    "author": "NABILAH SALWA",
    "lecturer": "Roswan Latuconsina, Purba Daru Kusuma",
    "publisher": "Universitas Telkom, S1 Teknik Komputer",
    "publish_year": "2024"
  },
  {
    "title": "PERANCANGAN ALAT UKUR KOMPOSISI TUBUH  DENGAN BIOELECTRICAL IMPEDANCE ANALYSIS PADA TIMBANGAN BERAT BADAN - Dalam bentuk buku karya ilmiah ",
    "classification": "Karya Ilmiah - Skripsi (S1) - Reference",
    "type_publication": "Microprocessors-design And Construction",
    "subject": "32 kali",
    "abstract": "Kesehatan merupakan hal yang perlu diperhatikan, terutama kesehatan secara fisik. Salah satu cara untuk memantau kesehatan fisik adalah dengan melakukan monitoring atau pemeriksaan komposisi tubuh. Komposisi tubuh perlu diketahui kadar atau jumlahnya sebagai langkah menjaga kesehatan dan mengantisipasi penyakit. Cara paling efektik untuk mengukur komposisi tubuh adalah dengan menggunakan body composition analyzer atau body fat monitor secara mandiri. Namun, alat-alat tersebut masih kurang praktis karena tidak dapat mengukur tinggi badan secara otomatis dan prosedur penggunaannya masih kurang sederhana. Pada penelitian ini, penulis merancang alat ukur komposisi tubuh yang dapat mengukur berat badan, tinggi badan, persentase lemak tubuh, persentase kadar air, dan nilai BMI atau Body Mass Index. Perancangan alat ukur komposisi tubuh ini menggunakan rumus pendekatan hubungan antara panjang telapak kaki dengan tinggi badan untuk mendapatkan nilai tinggi badan, dan metode Bioelectrical Impedance Analysis untuk mendapatkan persentase massa lemak tubuh. Metode BIA atau Bioelectrical Impedance Analysismemanfaatkan nilai impedansi tubuh. Nilai impedansi tubuh didapat dengan mengukur tegangan yang dihasilkan dari proses mengalirkan arus AC pada frekuensi tertentu secara konstan ke dalam tubuh. Selain impedansi tubuh, variabel yang dibutuhkan untuk metode BIA adalah berat badan, tinggi badan, umur, dan jenis kelamin. Penelitian ini menghasilkan rancangan alat ukur komposisi tubuh yang dapat mengukur berat badan, tinggi badan, persentase massa lemak tubuh, persentase total kadar air, dan BMI atau Body Mass Index dengan menggunakan sistem BIA. Alat ukur komposisi tubuh pada penilitian ini memiliki tingkat akurasi sebesar 99,283% pada pengukuran berat badan, 98,989% pada pengukuran tinggi badan, 92,884% pada pengukuran persentase massa lemak tubuh, 94,440% pada pengukuran persentase total kadar air tubuh, dan 98,284% pada pengukuran BMI atau Body Mass Index.",
    "keywords": "",
    "author": "MUHAMMAD NAUFAL FADHLURRAHMAN",
    "lecturer": "Muhammad Hablul Barri, Hilman Fauzi Tresna Sania Putra",
    "publisher": "Universitas Telkom, S1 Teknik Elektro",
    "publish_year": "2024"
  },
  {
    "title": "PERANCANGAN ARSITEKTUR SISTEM INFORMASI PADA DINAS PEKERJAAN UMUM SUMBER DAYA AIR PROVINSI JAWA TIMUR MENGGUNAKAN PENDEKATAN KERANGKA KERJA TOGAF ADM v9.2 - Dalam bentuk buku karya ilmiah ",
    "classification": "Karya Ilmiah - Skripsi (S1) - Reference",
    "type_publication": "Enterprise-architecture",
    "subject": "58 kali",
    "abstract": "Revolusi digital telah membawa perubahan signifikan dalam berbagai aspek kehidupan, khususnya dalam penggunaan teknologi informasi. Teknologi informasi menjadi faktor krusial dalam mendukung operasional perusahaan dan organisasi termasuk bagi Dinas Pekerjaan Umum Sumber Daya Air (DPU SDA) Provinsi Jawa Timur. DPU SDA bertanggung jawab dalam terwujudnya pengelolaan sumber daya air yang menyeluruh, terpadu dan berwawasan lingkungan di Provinsi Jawa Timur. Dalam melaksanakan serangkaian tugas dan memenuhi tanggung jawab, DPU SDA memiliki lima bidang didalamnya yang salah satunya adalah Bidang Sungai, Waduk dan Pantai (SWP). Bidang SWP memiliki proses bisnis mencakup aktivitas pemeliharaan sumber daya air serta penanganan kejadian bencana banjir yang menjadi kewenangan DPU SDA pada wilayah Provinsi Jawa Timur. Sebagai salah satu bidang yang juga berkontribusi penuh pada pencapaian visi dan misi DPU SDA, Bidang SWP memiliki sejumlah hambatan dan permasalahan yang berdampak pada kesejahteraan masyarakat dilihat dari hasil rekapitulasi data dan analisis terhadap kinerja dari bidang yang menunjukkan bahwa pada kurun waktu antara tahun 2023 sampai dengan periode tahun 2024, catatan terjadinya bencana banjir dalam Provinsi Jawa Timur mengalami peningkatan yang cukup signifikan. Berdasarkan informasi tersebut, penelitian ini dilakukan dengan berfokus pada Bidang SWP yang memiliki permasalahan dalam internal organisasi terkait dengan penyelarasan antara strategi bisnis dan strategi TI yang digunakan. Permasalahan yang dialami berupa otomatisasi dan integrasi proses bisnis serta sistem informasi yang belum dilakukan secara optimal, keterkaitan antar tugas dan fungsi dalam internal Bidang SWP yang tidak difasilitasi dengan penggunaan sistem informasi yang mendukung serta terdapat aktivitas manual sebagai akibat dari adanya sistem yang fungsinya tidak sesuai dengan kebutuhan. Dari permasalahan tersebut berdampak pada informasi dan data organisasi yang mengalami fragmentasi dan tidak terpadu sehingga menyebabkan kesulitan dalam koordinasi dan kerjasama antar bidang yang menimbulkan ketidakakuratan data pada pengambilan keputusan di penyelenggaraan operasional bisnis serta mempengaruhi kualitas pelayanan pada masyarakat. Permasalahan tersebut menunjukkan bahwa strategi TI yang diterapkan Bidang SWP memerlukan perbaikan dan belum selaras dengan proses bisnis yang ada. Maka dari itu, penelitian ini bertujuan melakukan pengembangan strategi melalui perancangan arsitektur sistem informasi menggunakan pendekatan terhadap framework sebagai konsep yang mendasari rencana pengembangan TI dalam memastikan dan menciptakan keselarasan antara strategi bisnis dan strategi teknologi informasi. Dalam penelitian ini, peneliti menggunakan pendekatan kerangka kerja TOGAF ADM v9.2 (The Open Group Architecture Framework - Architecture Development Method) yang berfokus pada Preliminary Phase dan tiga fase berikutnya yaitu Architecture Vision, Business Architecture, dan Information System Architecture. Hasil dari penelitian ini adalah sebuah arsitektur sistem informasi beserta roadmap sebagai gambaran usulan atau rekomendasi dari Enterprise Architecture (EA) terkait rencana pengembangan sistem informasi di masa depan dengan memberikan konsep yang jelas dan terstruktur tentang cara mengoptimalkan penggunaan teknologi informasi yang selaras dengan proses bisnis pada Bidang SWP untuk mendukung tercapainya tujuan serta visi & misi Dinas PU Sumber Daya Air Provinsi Jawa Timur.\n \nKata Kunci: Enterprise Architecture, TOGAF ADM v9.2, Architecture Vision, Business Architecture, Information System Architecture. ",
    "keywords": "",
    "author": "WANDA NADHIFA AINAYA",
    "lecturer": "Yupit Sudianto, Aris Kusumawati",
    "publisher": "Universitas Telkom, S1 Sistem Informasi - Kampus Surabaya",
    "publish_year": "2024"
  },
  {
    "title": "PERANCANGAN DAN REALISASI WEBSITE KOMPUTASI LINK POWER BUDGET DAN RISE TIME BUDGET DENGAN FITUR DAILY REPORT - Dalam bentuk buku karya ilmiah ",
    "classification": "Karya Ilmiah - Skripsi (S1) - Reference",
    "type_publication": "Website",
    "subject": "34 kali",
    "abstract": "Perancang jaringan fiber optic sering menghadapi beberapa tantangan dalam merencanakan dan merancang jaringan fiber optic. Salah satu tantangan yang dihadapi adalah belum optimalnya tools untuk mempermudah perhitungan LPB (Link Power Budget) dan RTB (Rise Time Budget) serta pelaporan hasil pekerjaan harian teknisi secara praktis. Selain itu, perubahan yang cepat dalam lingkungan bisnis dan teknologi mengharuskan para perancang dan teknisi jaringan untuk selalu memperbarui perencanaan mereka agar tetap relevan. Kesalahan dalam perencanaan, manajemen proyek yang tidak efisien, dan kebutuhan peningkatan produktifitas juga menjadi isu-isu penting yang perlu diatasi.\nSolusi dari permasalahan di atas adalah pembuatan website yang dapat membantu para perancang dan teknisi jaringan fiber optic dalam menghitung nilai LPB (Link Power Budget) dan RTB (Rise Time Budget) secara otomatis. Dengan adanya website ini, para perancang jaringan dapat meningkatkan efisiensi, mengurangi kesalahan, dan merancang jaringan fiber optic yang lebih efektif. Selain itu terdapat fitur Daily Report yang bertujuan untuk membantu para teknisi jaringan dalam melaporkan hasil pekerjaan harian, sehingga terciptanya transparansi antara teknisi dan team leader. Implementasi solusi pembuatan website dimulai dengan mendesain tampilan website yang user friendly dan informatif. Proses ini melibatkan identifikasi kebutuhan pengguna melalui wawancara langsung dengan user, hingga penentuan konten yang relevan seperti spesifikasi teknis.\nHasil pengujian keakuratan perhitungan LPB (Link Power Budget) dan RTB (Rise Time Budget) yang dilakukan dengan membandingkan hasil perhitungan secara manual dan secara sistem menggunakan website, diperoleh hasil tingkat keakuratan perhitungan LPB dan RTB masing-masing sebesar 99,96% dan 99,68%. Sedangkan hasil pengujian aspek fungsionalitas dan pengujian MOS (skala penilaian 1 sampai 5) untuk fitur Daily Report menyatakan seluruh aspek fungsionalitas telah berfungsi dengan optimal dan mendapatkan nilai tingkat kepuasan pengguna yang tinggi dengan nilai rata-rata MOS sebesar 4,61.",
    "keywords": "",
    "author": "THEOFANO ARNAND TARONI",
    "lecturer": "Uke Kurniawan Usman, Akhmad Hambali",
    "publisher": "Universitas Telkom, S1 Teknik Telekomunikasi",
    "publish_year": "2024"
  },
  {
    "title": "PERANCANGAN DESAIN PADA WEBSITE TANAFA  FURNITURE DENGAN PENDEKATAN DESIGN THINKING - Dalam bentuk buku karya ilmiah ",
    "classification": "Karya Ilmiah - Skripsi (S1) - Reference",
    "type_publication": "Design Thingking",
    "subject": "41 kali",
    "abstract": "Perancangan desain website Tanafa Furniture pada penelitian ini berfokus pada kebutuhan serta hambatan yang dihadapi oleh user. Tanafa Furniture merupakan sebuah UMKM yang bergerak pada bidang furniture dengan classic furniture, menawarkan berbagai perlengkapan rumah tangga seperti lemari, kursi, meja, dan tempat tidur. Seiring dengan kemajuan teknologi digital, masyarakat semakin sering melakukan pembelian barang secara online. Namun, Tanafa Furniture menghadapi kesulitan dalam menarik customer karena masih menggunakan penjualan secara offline yang mengharuskan customer untuk mengunjungi toko fisik serta pendataan stok di gudang juga masih dilakukan secara manual, yang sering menyebabkan ketidaksesuaian data. Penelitian ini merancang solusi yang dapat memenuhi kebutuhan pengguna dengan fokus pada meningkatan pengalaman pengguna (UX) dan antarmuka pengguna (UI) seperti aspek kegunaan seperti kemudahan dalam menjalankan fitur, tampilan desain menarik, dan pengalaman pengguna secara keseluruhan. Berdasarkan permasalahan yang dihadapi, penelitian ini mengembangkan desain website hingga tahap front-end untuk penjualan online dan pendataan stok furniture berbasis website. Tujuan penelitian ini untuk membuat website penjualan online yang mudah dipahami oleh user, serta sistem manajemen stok yang efisien dan akurat. Desain prototype dibuat dengan menggunakan aplikasi Figma dan pengimplementasikan desain pada website yang telah dirancang menggunakan bahasa pemrograman HTML, CSS, dan Javascript. Penggunaan metode Design Thinking dalam penelitian ini menjadi salah satu metode alternatif agar terfokus pada kebutuhan serta harapan user, lalu pengujian tampilan desain menggunakan Usability Testing Think Aloud. Berdasarkan hasil pengujian Usability Testing Think Aloud desain website Tanafa dengan menggunakan aplikasi Figma dan aplikasi Zoom Meeting, tidak ditemukan kendala dan tanggapan negatif saat responden melakukan task scenario yang telah ditentukan untuk menguji tampilan desain website e-commerce Tanafa dan website admin Tanafa.\nKata Kunci— Furniture, UI/UX, Design Thinking, Usability Testing, Prototype",
    "keywords": "",
    "author": "NABILA SYIFA RACHMADINI",
    "lecturer": "Ully Asfari, Rosyid Abdillah",
    "publisher": "Universitas Telkom, S1 Sistem Informasi - Kampus Surabaya",
    "publish_year": "2024"
  },
  {
    "title": "Perancangan Fiber To The Home Menggunakan Teknologi GPON Di Wilayah Bangkalan Selatan - Dalam bentuk buku karya ilmiah ",
    "classification": "Karya Ilmiah - Skripsi (S1) - Reference",
    "type_publication": "Fiber Optic Communications",
    "subject": "29 kali",
    "abstract": "Di era modern ini, teknologi internet berkembang pesat untuk memenuhi kebutuhan masyarakat Indonesia. Dengan meningkatnya permintaan akan koneksi cepat, teknologi GPON berbasis serat optik terus dikembangkan. Fiber To The Home (FTTH) menghubungkan serat optik langsung ke rumah pelanggan, meningkatkan kecepatan dan kualitas koneksi serta mengatasi keterbatasan kabel tembaga, menawarkan solusi internet yang lebih andal dan efisien.\nTujuan penelitian ini adalah menganalisis perancangan FTTH di Kecamatan Socah, Tragah, dan Modung menggunakan teknologi GPON, karena daerah tersebut belum memiliki fiber optik. Perancangan dilakukan dengan bantuan software Optisystem dan perhitungan matematis menggunakan metode Link Power Budget dan rise time budget. Parameter yang diperoleh mengacu pada standar ITU dan PT. Telkom: standar BER, nilai redaman maksimum Power Link Budget 28 dB, dan nilai Rise Time Budget 11,11 ns. Power Link Budget Downstream terbesar adalah 21,734 dB. Nilai daya terima (Prx) terbesar dari perhitungan manual untuk Power Link Budget Downstream adalah -18,734 dBm, sedangkan hasil simulasi menunjukkan Prx terbesar adalah -17,864 dBm di Desa Glisgis, Kecamatan Modung. Untuk Power Link Budget Upstream, nilai terbesar adalah 18,405 dB. Nilai Prx terbesar dari perhitungan manual untuk Power Link Budget Upstream adalah -15,405 dBm, sedangkan hasil simulasi menunjukkan Prx terbesar adalah -15,206 dBm di Desa Petaonan, Kecamatan Socah. Hasil Power Link Budget Downstream terbesar adalah 21,734 dB dengan daya terima (Prx) manual -18,734 dBm dan hasil simulasi -17,864 dBm di Desa Glisgis, Kecamatan Modung. Power Link Budget Upstream terbesar adalah 18,405 dB dengan Prx manual -15,405 dBm dan hasil simulasi -15,206 dBm di Desa Petaonan, Kecamatan Socah.",
    "keywords": "",
    "author": "EVAN IRSYAD SHARIM",
    "lecturer": "Walid Maulana Hadiansyah, Fannush Shofi Akbar",
    "publisher": "Universitas Telkom, S1 Teknik Telekomunikasi - Kampus Surabaya",
    "publish_year": "2024"
  },
  {
    "title": "PERANCANGAN PELUASAN DAERAH CAKUPAN WIFI  OUTDOOR DI LINGKUNGAN KAMPUS TELKOM  UNIVERISTY - Dalam bentuk buku karya ilmiah ",
    "classification": "Karya Ilmiah - Skripsi (S1) - Reference",
    "type_publication": "Tugas Akhir",
    "subject": "32 kali",
    "abstract": "Peningkatan aksesibilitas internet di lingkungan kampus merupakan salah satu upaya penting dalam mendukung kegiatan akademik maupun berselancar di dunia internet. Penelitian ini bertujuan untuk merencanakan perluasan cakupan jaringan WiFi outdoor di area outdoor kampus Telkom University dengan mempertimbangkan berbagai faktor seperti propagasi sinyal nirkabel, infrastruktur, dan struktur jaringan wireless. Pada perencanaan ini dilakukan walk test untuk melihat cakupan sinyal disekitar area outdoor kampus Telkom University, melakukan simulasi cakupan sinyal dan interferensi, menghitung link budget yang memiliki parameter pathloss, RSSI dan EIRP dan menghitung BoQ. Lalu dilakukan analisis dari hasil simulasi, perhitungan link budget dan BoQ untuk mendapatkan hasil perencanaan yang dijadikan sebagai rekomendasi perencanaan. Berdasarkan hasil analisis didapatkan bahwa skenario 4-C menjadi solusi akhir dan rekomendasi dalam perencanaan ini karena sudah mencakupi 3 parameter utama pemilihan solusi, spesifikasi perencanaan sudah sesuai dengan spesifikasi yang di targetkan dan memiliki nilai BoQ paling rendah dibandingkan dengan skenario lainnya, didapat nilai BoQ skenario 4 C sebesar Rp. 384.964.540, lalu untuk nilai rata-rata RSSI sebesar –33 dBm dan nilai EIRP sebesar 33 dBm yang sudah sesuai dengan spesifikasi perencanaan. Skenario 4-C ini dapat memperluas area cakupan sinyal WiFi outdoor Telkom University yang sebelumnya belum tercakupi sinyal seperti kantin deket Gedung TULT, selasar asrama TULT, parkiran Gedung GKU, joglo, kandang burung merak, selasar Gedung pasca sarjana, selasar Gedung Student Center, lapangan tenis dan diselesar depan Gedung Fakultas Komunikasi dan Bisnis.\n\nKata kunci: WiFi outdoor, perencanaan jaringan, cakupan sinyal, Telkom University",
    "keywords": "",
    "author": "RAYHAN SIDIQ KAFFA",
    "lecturer": "Uke Kurniawan Usman, Sakti Putro Wisetyo",
    "publisher": "Universitas Telkom, S1 Teknik Telekomunikasi",
    "publish_year": "2024"
  },
  {
    "title": "PERANCANGAN PELUASAN DAERAH CAKUPAN WIFI OUTDOOR DI LINGKUNGAN KAMPUS TELKOM UNIVERISTY  - Dalam bentuk buku karya ilmiah ",
    "classification": "Karya Ilmiah - Skripsi (S1) - Reference",
    "type_publication": "Tugas Akhir",
    "subject": "33 kali",
    "abstract": "Peningkatan aksesibilitas internet di lingkungan kampus merupakan salah satu upaya penting dalam mendukung kegiatan akademik maupun berselancar di dunia internet. Penelitian ini bertujuan untuk merencanakan perluasan cakupan jaringan WiFi outdoor di area outdoor kampus Telkom University dengan mempertimbangkan berbagai faktor seperti propagasi sinyal nirkabel, infrastruktur, dan struktur jaringan wireless. ",
    "keywords": "",
    "author": "ZHIKYA SEKAR LUTFI PURNOMO",
    "lecturer": "Uke Kurniawan Usman, Sakti Putro Wisetyo",
    "publisher": "Universitas Telkom, S1 Teknik Telekomunikasi",
    "publish_year": "2024"
  },
  {
    "title": "PERANCANGAN PELUASAN DAERAH CAKUPAN WIFI OUTDOOR DI LINGKUNGAN KAMPUS TELKOM UNIVERISTY - Capstone ",
    "classification": "Karya Ilmiah - Skripsi (S1) - Reference",
    "type_publication": "Tugas Akhir",
    "subject": "32 kali",
    "abstract": "Peningkatan aksesibilitas internet di lingkungan kampus merupakan salah satu upaya penting dalam mendukung kegiatan akademik maupun berselancar di dunia internet. Penelitian ini bertujuan untuk merencanakan perluasan cakupan jaringan WiFi outdoor di area outdoor kampus Telkom University dengan mempertimbangkan berbagai faktor seperti propagasi sinyal nirkabel, infrastruktur, dan struktur jaringan wireless.",
    "keywords": "",
    "author": "RANGGA FADHILLAH AKBAR",
    "lecturer": "Uke Kurniawan Usman, Sakti Putro Wisetyo",
    "publisher": "Universitas Telkom, S1 Teknik Telekomunikasi",
    "publish_year": "2024"
  },
  {
    "title": "PERANCANGAN SISTEM INFORMASI MANAJEMEN SUMBER DAYA MANUSIA BERBASIS CLOUD - HR HARMONY - Capstone ",
    "classification": "Karya Ilmiah - Skripsi (S1) - Reference",
    "type_publication": "Tugas Akhir",
    "subject": "38 kali",
    "abstract": "Dalam lanskap bisnis kontemporer, manajemen sumber daya manusia (SDM) yang efektif sangat diperlukan untuk keberhasilan organisasi. Ketika bisnis bertransisi menuju digitalisasi, sistem informasi manajemen SDM berbasis cloud muncul sebagai alat penting untuk menyederhanakan proses SDM dan mengoptimalkan manajemen tenaga kerja. Dokumen ini menyajikan pengembangan aplikasi sistem informasi manajemen SDM berbasis cloud komprehensif yang dirancang untuk memenuhi berbagai kebutuhan organisasi modern.\n\nAplikasi ini mencakup beragam fitur penting untuk manajemen SDM yang efisien, termasuk manajemen informasi karyawan, rekrutmen dan orientasi, evaluasi kinerja, pelatihan dan pengembangan, pemrosesan penggajian, dan manajemen cuti. Dengan memanfaatkan skalabilitas, aksesibilitas, dan fleksibilitas yang ditawarkan oleh komputasi awan, sistem yang diusulkan ini bertujuan untuk meningkatkan efisiensi SDM, mendorong keterlibatan karyawan, dan memfasilitasi pengambilan keputusan berdasarkan data. Menggunakan bahasa pemrograman terbarukan seperti Golang dan ReactJS aplikasi ini memungkinkan pengalaman pengguna yang sangat baik serta organisasi akan memperoleh wawasan berharga mengenai dinamika tenaga kerja, mengantisipasi kebutuhan talenta, dan menerapkan inisiatif SDM strategis.\n\nSistem informasi manajemen SDM ini telah melalui berbagai tahap pengujian yang komprehensif untuk memastikan kualitas dan efektivitasnya. Pengujian penerimaan pengguna (UAT) menunjukkan feedback yang sangat positif dari para pengguna, yang mengindikasikan bahwa aplikasi ini berhasil memenuhi kebutuhan dan harapan mereka. Selain itu, pengujian whitebox dan blackbox menghasilkan kinerja yang sempurna, membuktikan keandalan dan keamanan sistem. Pengujian kinerja pada infrastruktur cloud juga menunjukkan hasil yang maksimal, dengan aplikasi mampu menangani beban kerja yang tinggi dan memastikan aksesibilitas yang konsisten. Hal ini menegaskan bahwa aplikasi sistem informasi manajemen SDM berbasis cloud ini tidak hanya efisien dan user-friendly, tetapi juga robust dan scalable untuk mendukung berbagai kebutuhan organisasi modern.",
    "keywords": "",
    "author": "MUHAMMAD AIMAR RIZKI UTAMA",
    "lecturer": "Purba Daru Kusuma, Roswan Latuconsina",
    "publisher": "Universitas Telkom, S1 Teknik Komputer",
    "publish_year": "2024"
  },
  {
    "title": "PERANCANGAN SISTEM INFORMASI MANAJEMEN SUMBER DAYA MANUSIA BERBASIS CLOUD - HR HARMONY - Capstone ",
    "classification": "Karya Ilmiah - Skripsi (S1) - Reference",
    "type_publication": "Tugas Akhir",
    "subject": "33 kali",
    "abstract": "Dalam lanskap bisnis kontemporer, manajemen sumber daya manusia (SDM) yang efektif sangat diperlukan untuk keberhasilan organisasi. Ketika bisnis bertransisi menuju digitalisasi, sistem informasi manajemen SDM berbasis cloud muncul sebagai alat penting untuk menyederhanakan proses SDM dan mengoptimalkan manajemen tenaga kerja. Dokumen ini menyajikan pengembangan aplikasi sistem informasi manajemen SDM berbasis cloud komprehensif yang dirancang untuk memenuhi berbagai kebutuhan organisasi modern. \n\nAplikasi ini mencakup beragam fitur penting untuk manajemen SDM yang efisien, termasuk manajemen informasi karyawan, rekrutmen dan orientasi, evaluasi kinerja, pelatihan dan pengembangan, pemrosesan penggajian, dan manajemen cuti. Dengan memanfaatkan skalabilitas, aksesibilitas, dan fleksibilitas yang ditawarkan oleh komputasi awan, sistem yang diusulkan ini bertujuan untuk meningkatkan efisiensi SDM, mendorong keterlibatan karyawan, dan memfasilitasi pengambilan keputusan berdasarkan data. Menggunakan bahasa pemrograman terbarukan seperti Golang dan ReactJS aplikasi ini memungkinkan pengalaman pengguna yang sangat baik serta organisasi akan memperoleh wawasan berharga mengenai dinamika tenaga kerja, mengantisipasi kebutuhan talenta, dan menerapkan inisiatif SDM strategis. \n\nSistem informasi manajemen SDM ini telah melalui berbagai tahap pengujian yang komprehensif untuk memastikan kualitas dan efektivitasnya. Pengujian penerimaan pengguna (UAT) menunjukkan feedback yang sangat positif dari para pengguna, yang mengindikasikan bahwa aplikasi ini berhasil memenuhi kebutuhan dan harapan mereka. Selain itu, pengujian whitebox dan blackbox menghasilkan kinerja yang sempurna, membuktikan keandalan dan keamanan sistem. Pengujian kinerja pada infrastruktur cloud juga menunjukkan hasil yang maksimal, dengan aplikasi mampu menangani beban kerja yang tinggi dan memastikan aksesibilitas yang konsisten. Hal ini menegaskan bahwa aplikasi sistem informasi manajemen SDM berbasis cloud ini tidak hanya efisien dan user-friendly, tetapi juga robust dan scalable untuk mendukung berbagai kebutuhan organisasi modern.",
    "keywords": "",
    "author": "FAKHRITY HIKMAWAN",
    "lecturer": "Purba Daru Kusuma, Roswan Latuconsina",
    "publisher": "Universitas Telkom, S1 Teknik Komputer",
    "publish_year": "2024"
  },
  {
    "title": "PERANCANGAN SISTEM INFORMASI MANAJEMEN SUMBER DAYA MANUSIA BERBASIS CLOUD - HR HARMONY - Capstone ",
    "classification": "Karya Ilmiah - Skripsi (S1) - Reference",
    "type_publication": "Tugas Akhir",
    "subject": "30 kali",
    "abstract": "Dalam lanskap bisnis kontemporer, manajemen sumber daya manusia (SDM) yang efektif sangat diperlukan untuk keberhasilan organisasi. Ketika bisnis bertransisi menuju digitalisasi, sistem informasi manajemen SDM berbasis cloud muncul sebagai alat penting untuk menyederhanakan proses SDM dan mengoptimalkan manajemen tenaga kerja. Dokumen ini menyajikan pengembangan aplikasi sistem informasi manajemen SDM berbasis cloud komprehensif yang dirancang untuk memenuhi berbagai kebutuhan organisasi modern.\n\nAplikasi ini mencakup beragam fitur penting untuk manajemen SDM yang efisien, termasuk manajemen informasi karyawan, rekrutmen dan orientasi, evaluasi kinerja, pelatihan dan pengembangan, pemrosesan penggajian, dan manajemen cuti. Dengan memanfaatkan skalabilitas, aksesibilitas, dan fleksibilitas yang ditawarkan oleh komputasi awan, sistem yang diusulkan ini bertujuan untuk meningkatkan efisiensi SDM, mendorong keterlibatan karyawan, dan memfasilitasi pengambilan keputusan berdasarkan data. Menggunakan bahasa pemrograman terbarukan seperti Golang dan ReactJS aplikasi ini memungkinkan pengalaman pengguna yang sangat baik serta organisasi akan memperoleh wawasan berharga mengenai dinamika tenaga kerja, mengantisipasi kebutuhan talenta, dan menerapkan inisiatif SDM strategis.\n\nSistem informasi manajemen SDM ini telah melalui berbagai tahap pengujian yang komprehensif untuk memastikan kualitas dan efektivitasnya. Pengujian penerimaan pengguna (UAT) menunjukkan feedback yang sangat positif dari para pengguna, yang mengindikasikan bahwa aplikasi ini berhasil memenuhi kebutuhan dan harapan mereka. Selain itu, pengujian whitebox dan blackbox menghasilkan kinerja yang sempurna, membuktikan keandalan dan keamanan sistem. Pengujian kinerja pada infrastruktur cloud juga menunjukkan hasil yang maksimal, dengan aplikasi mampu menangani beban kerja yang tinggi dan memastikan aksesibilitas yang konsisten. Hal ini menegaskan bahwa aplikasi sistem informasi manajemen SDM berbasis cloud ini tidak hanya efisien dan user-friendly, tetapi juga robust dan scalable untuk mendukung berbagai kebutuhan organisasi modern.",
    "keywords": "",
    "author": "ARFARA YEMA SAMGUSDIAN",
    "lecturer": "Purba Daru Kusuma, Roswan Latuconsina",
    "publisher": "Universitas Telkom, S1 Teknik Komputer",
    "publish_year": "2024"
  },
  {
    "title": "PERENCANAAN ARSITEKTUR SISTEM INFORMASI DI  RUMAH SAKIT TNI AU SOEMITRO MENGGUNAKAN  PENDEKATAN TOGAF ADM 9.2 - Dalam bentuk buku karya ilmiah ",
    "classification": "Karya Ilmiah - Skripsi (S1) - Reference",
    "type_publication": "Enterprise-architecture",
    "subject": "32 kali",
    "abstract": "Kemajuan dalam teknologi informasi telah memberikan dampak besar di berbagai bidang, termasuk sektor kesehatan. Teknologi informasi memainkan peran kunci dalam meningkatkan efisiensi operasional, mempermudah pembuatan laporan, dan mendukung organisasi untuk mencapai tujuan strategis mereka. Meskipun banyak organisasi telah mengalokasikan sumber daya untuk teknologi informasi, sering kali mereka tidak mengalami peningkatan kinerja yang diinginkan. Hal ini biasanya disebabkan oleh kurangnya perencanaan strategis yang matang dalam implementasi sistem informasi. Rumah Sakit TNI AU Soemitro di Surabaya, yang terakreditasi paripurna dan berstatus sebagai rumah sakit tipe IV/D, adalah contoh kasus yang tepat untuk penelitian ini karena kebutuhan mendesaknya akan sistem informasi terintegrasi dalam meningkatkan efektivitas operasionalnya. Permasalahan yang dihadapi adalah Rumah Sakit TNI AU Soemitro masih menggunakan berkas rekam medis yang ditulis dan disimpan secara manual. Hal ini tidak selaras dengan Peraturan Menteri Kesehatan (PMK) nomor 24 tahun 2022 tentang Rekam Medis, yang mewajibkan fasilitas pelayanan kesehatan (Fasyankes) menjalankan sistem pencatatan riwayat medis pasien secara elektronik. Berkas rekam medis manual ini sering menyebabkan berbagai masalah, termasuk kesalahan penginputan data dan lambatnya proses pencarian informasi pasien, yang berdampak pada kualitas pelayanan kesehatan yang diberikan. Penelitian ini dimulai dengan pengumpulan data kualitatif melalui observasi dan wawancara dengan Sekretaris rumah sakit, IT Support, dan Koordinator Pelayanan Rekam Medis, untuk mengidentifikasi kebutuhan dan tantangan dalam penerapan sistem informasi medis elektronik. Data yang diperoleh kemudian dianalisis menggunakan model Spiral, melalui tahap deskripsi, reduksi, dan seleksi. Selanjutnya, hasil analisis spiral diolah menggunakan kerangka kerja The Open Group Architecture Framework (TOGAF) dengan pendekatan Architecture Development Method (ADM) Versi 9.2. TOGAF ADM dipilih karena sifatnya yang fleksibel dan open source, memungkinkan pengembangan perencanaan dan implementasi teknologi informasi yang lebih baik dan lebih terstruktur. Pendekatan ini berfokus pada lima empat fase utama, yaitu Preliminary Phase, Phase A: Architecture Vision, Phase B: Business Architecture, dan Phase C: Information System Architecture. Setiap fase ini dirancang untuk iii memastikan bahwa semua aspek dari sistem informasi diperhitungkan dan diintegrasikan dengan baik. Preliminary Phase berfungsi untuk menetapkan konteks dan tujuan arsitektur yang akan dikembangkan. Pada Phase A: Architecture Vision, visi dan sasaran strategis dari sistem informasi yang akan dibangun diidentifikasi. Phase B: Business Architecture berfokus pada analisis dan desain arsitektur bisnis yang mencakup proses bisnis utama dan kebutuhan informasi. Phase C: Information System Architecture mengembangkan model arsitektur data dan aplikasi yang dibutuhkan untuk mendukung arsitektur bisnis. Tahapan akhir penelitian ini adalah memvalidasi seluruh fase yang telah dirancang menggunakan triangulasi waktu. Berdasarkan pemaparan tersebut, penelitian ini mengusulkan topik terkait arsitektur sistem informasi yang berfokus pada unit rekam medis sehingga hasil akhirnya berupa dokumen perencanaan arsitektur sistem informasi. Hasil dari penelitian ini meliputi pemberian rekomendasi dan panduan dalam merencanakan serta mengimplementasikan arsitektur teknologi yang sesuai untuk menyelaraskan sistem informasi. Dengan perencanaan yang matang dan implementasi yang tepat, sistem informasi yang baru diharapkan dapat meningkatkan efektivitas operasional, mengurangi kesalahan penginputan data, dan memperjelas alur proses pelayanan pasien. Selain itu, hasil penelitian ini diharapkan dapat memperkaya pemahaman tentang penggunaan arsitektur sistem informasi dalam konteks manajemen teknologi informasi kesehatan, serta memberikan panduan yang bermanfaat bagi organisasi lain yang menghadapi tantangan serupa.",
    "keywords": "",
    "author": "BIRGITA YOLANDA FRISCIELA ARDHYA HERMAWAN",
    "lecturer": "Riza Akhsani Setyo Prayoga, Raulia Riski",
    "publisher": "Universitas Telkom, S1 Sistem Informasi",
    "publish_year": "2024"
  },
  {
    "title": "RANCANG BANGUN APLIKASI HELPDESK TICKETING VERSI 2.0 UNTUK SATUAN TUGAS STUDENT SERVICE CENTER (SSC) DI KAMPUS TELKOM UNIVERSITY SURABAYA - Dalam bentuk buku karya ilmiah ",
    "classification": "Karya Ilmiah - Skripsi (S1) - Reference",
    "type_publication": "Agile Software-development",
    "subject": "31 kali",
    "abstract": " ",
    "keywords": "",
    "author": "RIZAL JIHADI",
    "lecturer": "Rokhmatul Insani, Rizky Fenaldo Maulana",
    "publisher": "Universitas Telkom, S1 Sistem Informasi - Kampus Surabaya",
    "publish_year": "2024"
  },
  {
    "title": "RANCANG BANGUN APLIKASI MONITORING KELOMPOK TANI BERBASIS MULTIPLATFORM MENGGUNAKAN FRAMEWORK FLUTTER PADA KECAMATAN GUDO - Dalam bentuk buku karya ilmiah ",
    "classification": "Karya Ilmiah - Skripsi (S1) - Reference",
    "type_publication": "Pemograman",
    "subject": "27 kali",
    "abstract": "Kelompok tani atau poktan merupakan kumpulan petani/peternak/perkebunan yang dibentuk atas dasar kesamaan kepentingan, kesamaan kondisi lingkungan sosial, ekonomi, dan sumber daya, kesamaan komoditas, dan keakraban untuk meningkatkan dan mengembangkan usaha anggota. Saat ini permasalahan yang terjadi pada kelompok-kelompok tani khususnya kelompok tani Kecamatan Gudo Kabupaten Jombang antara lain bagi ketua kelompok tani pendataan petani masih dilakukan secara tradisional yaitu dengan menulis pada buku pendataan, sehingga rawan terjadinya kehilangan dan rusak, sedangkan pada dinas pertanian sistem monitoring lokasi masih secara tradisional yaitu datang secara langsung, pengajuan pupuk yang dilakukan secara tradisional yaitu dengan mendatangi penyuluh pertanian lapangan (PPL), kesulitan dalam monitoring pembagian pupuk bagi petani, serta informasi mengenai pengaduan penyalahgunaan pupuk masih dilakukan secara manual. Tujuan penelitian ini adalah untuk merancang aplikasi multiplatform dari web, android dan ios yang dapat membantu ketua kelompok tani, dan dinas pertanian Kecamatan Gudo untuk menyelesaikan kesulitan yang sedang  terjadi. Metode penelitian yang digunakan adalah Extreme Programming (XP) yang merupakan salah satu metode dari pengembangan Agile.  Dalam penelitian ini, metode UML (Unified Modeling Language) digunakan dalam tahap perencanaan dan desain perangkat lunak, sedangkan pengujian menggunakan metode Blackbox dengan Compatibility Testing. Penelitian ini menggunakan Framework Flutter sebagai pengembangan UI yang multiplatform mulai dari web, android, hingga ios, lalu back-end menggunakan platform Firebase. Berdasarkan pengujian blackbox dengan Compatibility Testing, tidak ditemukan kendala saat user melakukan skenario pengujian dan hasil pengujian Test Case sesuai dengan hasil yang diharapkan pada setiap tahapan iterasi.",
    "keywords": "",
    "author": "HUGO RAYHAN FIRMANSYAH",
    "lecturer": "Rokhmatul Insani, Purnama Anaking",
    "publisher": "Universitas Telkom, S1 Sistem Informasi",
    "publish_year": "2024"
  },
  {
    "title": "RANCANG BANGUN APLIKASI PEMBELAJARAN BAHASA JAWA BERBASIS ANDROID MENGGUNAKAN UML ICONIX PROCESS DENGAN STUDI KASUS : SDN KALIASIN 1 SURABAYA - Dalam bentuk buku karya ilmiah ",
    "classification": "Karya Ilmiah - Skripsi (S1) - Reference",
    "type_publication": "Perancangan Aplikasi",
    "subject": "27 kali",
    "abstract": "Bahasa adalah alat komunikasi antar manusia yang hidup di suatu daerah, termasuk Bahasa Jawa yang merupakan warisan budaya Indonesia. Namun, penggunaan Bahasa Jawa terutama bahasa jawa timur menurun di era digital karena kurangnya kesadaran akan pentingnya melestarikan bahasa tersebut. Hal ini menyebabkan kurangnya pemahaman masyarakat, terutama anak-anak terhadap tata karma bahasa serta ketidakmampuan membaca dan menulis aksara Jawa. SDN Kaliasin 1 Surabaya adalah salah satu lembaga pendidikan yang merasakan dampak ini selama beberapa tahun terakhir. Penelitian ini bertujuan membangun Aplikasi Pembelajaran Bahasa Jawa berbasis Android bernama Kajak dan Website Administrasi bernama Kajak-web. Kajak memungkinkan murid menerjemahkan kata-kata dari Bahasa Indonesia ke Bahasa Jawa menggunakan fitur OCR (Optical Character Recognition) dalam menerjemahkan kalimat dari gambar ke Bahasa Jawa (Ngoko, Krama Madya, dan Krama Inggil). Fitur lainnya termasuk Rupa-rupa Kawruh, Paramasastra, Kasustraan, Hanacaraka, dan Wulangan untuk membantu anak-anak menguji pemahaman berbahasa Jawa mereka. Sementara itu, Kajak-web berfokus pada pengelolaan data seperti penyimpanan data soal wulangan dan data akun. Metode UML ICONIX Process digunakan untuk perancangan sistem baik aplikasi maupun Website, sedangkan metode SDLC (Software Development Life Cycle) Waterfall digunakan untuk pengembangan aplikasi dan Website. Pengumpulan data dilakukan melalui wawancara dengan Kepala Sekolah, Guru Bahasa Jawa, dan beberapa murid kelas 6 SDN Kaliasin 1 Surabaya. Hasil pengujian UAT (User Acceptance Testing) menunjukkan nilai pada Kajak: kemudahan penggunaan 84,58%, tampilan 80,42%, ketepatan 77,98%, dan kinerja 84,17%; dan pada Kajak-web: kemudahan penggunaan 84,58%, tampilan 80,42%, ketepatan 77,98%, dan kinerja 84,17%. Berdasarkan hasil ini, terbukti bahwa Kajak dan Kajak-web memenuhi kebutuhan pengguna dalam membantu mengajarkan Bahasa Jawa di SDN Kaliasin 1 Surabaya.\nKata kunci— Bahasa Jawa, Aplikasi Android, UML Iconix Process, Kesadaran, Budaya.",
    "keywords": "",
    "author": "DIMAS ADITYA WAHONO",
    "lecturer": "Achmad Muzakki, Adzanil Rachmadhi Putra",
    "publisher": "Universitas Telkom, S1 Sistem Informasi - Kampus Surabaya",
    "publish_year": "2024"
  },
  {
    "title": "RANCANG BANGUN PROTOTIPE ROBOT BERODA UNTUK PENGIRIMAN PAKET  - Capstone ",
    "classification": "Karya Ilmiah - Skripsi (S1) - Reference",
    "type_publication": "Automatic Control Engineering",
    "subject": "28 kali",
    "abstract": "Semakin berkembangnya teknologi yang ada, khususnya robot autonomous sudah meliputi pekerjaan sehari-hari manusia maka pemakaian robot pengiriman paket saat ini dapat kita diterapkan di Indonesia. Di negara-negara seperti Jepang dan Korea yang menghadapi penurunan angka kelahiran serta peningkatan jumlah penduduk lanjut usia, jumlah tenaga kerja semakin berkurang. Kondisi ini mendorong pemanfaatan robot untuk menggantikan kurir atau petugas keamanan di berbagai lokasi pengiriman. Teknologi robotika, elektronika, dan teknologi canggih lainnya digunakan untuk memastikan proses pengiriman barang ke alamat tujuan berjalan lancar. Oleh karena itu, penulis tertarik untuk merancang robot pengirim paket otonom, di mana pengguna hanya perlu memberikan koordinat tujuan kepada robot, dan robot tersebut akan secara otomatis bergerak menuju titik koordinat yang ditentukan tanpa memerlukan kendali manusia. Berdasarkan lima spesifikasi yang diuji, yaitu kemampuan mencapai tujuan yang telah ditetapkan, kemampuan menavigasi jalur yang akan dilalui, mendeteksi titik-titik jalur (waypoint), kemampuan kembali ke titik awal pengiriman (Return to Home), serta kemampuan memberikan informasi dan monitoring, dapat disimpulkan bahwa semua spesifikasi tersebut berfungsi dengan baik.",
    "keywords": "",
    "author": "MUHAMMAD AGIV IZZATUR FIRASYAN",
    "lecturer": "Porman Pangaribuan, Irham Mulkan Rodiana",
    "publisher": "Universitas Telkom, S1 Teknik Elektro",
    "publish_year": "2024"
  },
  {
    "title": "RANCANG BANGUN PROTOTIPE ROBOT BERODA UNTUK PENGIRIMAN PAKET - Capstone ",
    "classification": "Karya Ilmiah - Skripsi (S1) - Reference",
    "type_publication": "Automatic Control Engineering",
    "subject": "28 kali",
    "abstract": "Semakin berkembangnya teknologi yang ada, khususnya robot autonomous sudah meliputi pekerjaan sehari-hari manusia maka pemakaian robot pengiriman paket saat ini dapat kita diterapkan di Indonesia. Di negara-negara seperti Jepang dan Korea yang menghadapi penurunan angka kelahiran serta peningkatan jumlah penduduk lanjut usia, jumlah tenaga kerja semakin berkurang. Kondisi ini mendorong pemanfaatan robot untuk menggantikan kurir atau petugas keamanan di berbagai lokasi pengiriman. Teknologi robotika, elektronika, dan teknologi canggih lainnya digunakan untuk memastikan proses pengiriman barang ke alamat tujuan berjalan lancar. Oleh karena itu, penulis tertarik untuk merancang robot pengirim paket otonom, di mana pengguna hanya perlu memberikan koordinat tujuan kepada robot, dan robot tersebut akan secara otomatis bergerak menuju titik koordinat yang ditentukan tanpa memerlukan kendali manusia. Berdasarkan lima spesifikasi yang diuji, yaitu kemampuan mencapai tujuan yang telah ditetapkan, kemampuan menavigasi jalur yang akan dilalui, mendeteksi titik-titik jalur (waypoint), kemampuan kembali ke titik awal pengiriman (Return to Home), serta kemampuan memberikan informasi dan monitoring, dapat disimpulkan bahwa semua spesifikasi tersebut berfungsi dengan baik.",
    "keywords": "",
    "author": "FARIS AQIL MUHAMMAD",
    "lecturer": "Porman Pangaribuan, Irham Mulkan Rodiana",
    "publisher": "Universitas Telkom, S1 Teknik Elektro",
    "publish_year": "2024"
  },
  {
    "title": "RANCANG BANGUN PROTOTIPE ROBOT BERODA UNTUK PENGIRIMAN PAKET - Capstone ",
    "classification": "Karya Ilmiah - Skripsi (S1) - Reference",
    "type_publication": "Automatic Control Engineering",
    "subject": "32 kali",
    "abstract": "Semakin berkembangnya teknologi yang ada, khususnya robot autonomous sudah meliputi pekerjaan sehari-hari manusia maka pemakaian robot pengiriman paket saat ini dapat kita diterapkan di Indonesia. Di negara-negara seperti Jepang dan Korea yang menghadapi penurunan angka kelahiran serta peningkatan jumlah penduduk lanjut usia, jumlah tenaga kerja semakin berkurang. Kondisi ini mendorong pemanfaatan robot untuk menggantikan kurir atau petugas keamanan di berbagai lokasi pengiriman. Teknologi robotika, elektronika, dan teknologi canggih lainnya digunakan untuk memastikan proses pengiriman barang ke alamat tujuan berjalan lancar. Oleh karena itu, penulis tertarik untuk merancang robot pengirim paket otonom, di mana pengguna hanya perlu memberikan koordinat tujuan kepada robot, dan robot tersebut akan secara otomatis bergerak menuju titik koordinat yang ditentukan tanpa memerlukan kendali manusia. Berdasarkan lima spesifikasi yang diuji, yaitu kemampuan mencapai tujuan yang telah ditetapkan, kemampuan menavigasi jalur yang akan dilalui, mendeteksi titik-titik jalur (waypoint), kemampuan kembali ke titik awal pengiriman (Return to Home), serta kemampuan memberikan informasi dan monitoring, dapat disimpulkan bahwa semua spesifikasi tersebut berfungsi dengan baik.",
    "keywords": "",
    "author": "NAOFAL MARTFA",
    "lecturer": "Porman Pangaribuan, Irham Mulkan Rodiana",
    "publisher": "Universitas Telkom, S1 Teknik Elektro",
    "publish_year": "2024"
  },
  {
    "title": "RANCANG BANGUN SISTEM INFORMASI MANAJEMEN  LAYANAN PUSAT BAHASA BERBASIS WEB DI  UNIVERSITAS TELKOM SURABAYA - Dalam bentuk buku karya ilmiah ",
    "classification": "Karya Ilmiah - Skripsi (S1) - Reference",
    "type_publication": "Pemograman Web",
    "subject": "38 kali",
    "abstract": "Layanan Pusat Bahasa adalah unit yang menyediakan layanan tes kecakapan serta kursus untuk meningkatkan kemampuan berkomunikasi dan penguasaan bahasa asing mahasiswa dan staf Universitas Telkom Surabaya. Namun, sistem informasi yang digunakan saat ini terbatas dalam hal fungsionalitas dan aksesibilitas. Permasalahan utama yang diidentifikasi dalam penelitian ini adalah pendaftaran, pembayaran kursus, dan penentuan jadwal kursus yang masih dilakukan secara manual. Selain itu, akses informasi terkait program bahasa yang ditawarkan juga terbatas dan dapat menghambat partisipasi mahasiswa sehingga mengurangi kepuasan pengguna. Tujuan penelitian ini adalah merancang dan membangun Sistem Informasi Manajemen Layanan Pusat Bahasa berbasis web untuk meningkatkan kualitas manajemen Pusat Bahasa dan memberikan akses yang lebih mudah kepada mahasiswa dan staf pengajar. Website ini dirancang menggunakan framework Laravel dan database MySQL dengan metode pengembangan Prototype, serta diuji menggunakan metode Black Box Testing. Hasil dari penelitian ini, mencakup fitur-fitur pendaftaran, pembayaran, dan penjadwalan kursus telah terintegrasi dengan baik. Website dirancang dengan antarmuka yang mudah digunakan sehingga dapat diakses dengan mudah oleh mahasiswa dan staf pengajar. Hasil pengujian menunjukkan bahwa semua fitur berfungsi sesuai spesifikasi dan performa sistem. Dengan demikian, penelitian ini berhasil menyelesaikan pembangunan sistem yang diharapkan dapat meningkatkan kualitas dan kemudahan akses operasional Pusat Bahasa di Universitas Telkom Surabaya, serta memberikan pengalaman yang lebih baik bagi pengguna. Penelitian ini juga dapat menjadi referensi bagi institusi pendidikan lainnya yang ingin meningkatkan layanan melalui teknologi informasi. Berdasarkan penelitian yang telah dilakukan mengenai Rancang Bangun Sistem Informasi Manajemen Layanan Pusat Bahasa Berbasis Web di Universitas Telkom Surabaya, ditemukan beberapa kendala yang telah dilakukan perbaikan sesuai dengan kebutuhan dan keinginan pengguna melalui tahapan iterasi.",
    "keywords": "",
    "author": "BAYU KEVIN FARINDRA",
    "lecturer": "Rokhmatul Insani, Purnama Anaking",
    "publisher": "Universitas Telkom, S1 Sistem Informasi",
    "publish_year": "2024"
  },
  {
    "title": "SECURITY SURVEILLANCE SYSTEM AREA TOWER  BTS BERBASIS IoT PADA PERUSAHAAN   PT DAYAMITRA TELEKOMUNIKASI - Dalam bentuk buku karya ilmiah ",
    "classification": "Karya Ilmiah - Skripsi (S1) - Reference",
    "type_publication": "Iot",
    "subject": "36 kali",
    "abstract": "Base Transceiver Station (BTS) adalah jenis infrastruktur telekomunikasi yang dibangun untuk memungkinkan perangkat telekomunikasi berkomunikasi dengan jaringan operator secara nirkabel. Perangkat-perangkat di BTS penting dalam sistem kerja telekomunikasi, tetapi pada kenyataannya masih banyak kasus pencurian terhadap perangkat-perangkat di area tower. Kasus pencurian paling banyak terjadi pada shelter seperti baterai dan juga area diluar shelter seperti kabel ground. Hal ini menyebabkan kualitas jaringan pada site yang dicuri menurun sehingga menyebabkan kerugian pada provider yang menggunakan site tersebut. Untuk mengatasi permasalahan ini, diperlukan sistem surveillance yang dapat di monitoring dari jarak jauh untuk mengawasi area sekitar tower. Sistem surveillance menggunakan perangkat keras seperti, kamera CCTV yang berfungsi untuk memantau area site dan RFID sebagai alat untuk petugas mengakses pintu masuk dan keluar area site. Selain perangkat keras, sistem ini juga menggunakan website untuk menampilkan seluruh informasi yang dikirimkan oleh alat menggunakan metode komunikasi MQTT dan HTTP, yang kemudian informasi tersebut tersimpan dalam database. Selain website, media lain untuk melihat informasi dari alat adalah Telegram yang berfungsi sebagai silent notification yang mengirimkan capture image saat kamera CCTV mendeteksi objek di area site. Berdasarkan hasil pengujian, kamera CCTV mampu mengambil gambar dan melakukan live streaming dengan protokol RTSP/IP Cam yang terhubung ke router dan menampilkan informasi di website dari pagi hingga malam hari. Sistem object detection pada CCTV menunjukkan tingkat accuracy 76% (pagi), 83% (siang), 89% (sore), 87% (malam); precision 93% (pagi), 88% (siang), 95% (sore), 93% (malam); dan sensitivity 78% (pagi), 88% (siang), 91% (sore), 93% (malam). RFID tipe RC522 High Frequency menunjukan kinerja baik dalam mendeteksi UID dan username tag serta mengendalikan status doorlock, dengan hanya tiga kegagalan dari lima belas percobaan dikarenakan belum terhubung ke WiFi. Pengujian komunikasi menggunakan protokol HTTP dan MQTT menunjukkan bahwa komunikasi antara hardware dan software berjalan dengan baik. Kamera CCTV terhubung ke website dalam 5 detik, sedangkan RFID memerlukan waktu 10 detik. Pengujian pada website menunjukan bahwa website dapat menerima dan menampilkan data yang dikirimkan oleh alat dengan baik. Kata Kunci: Surveillance System, CCTV, RFID, HTTP, BTS",
    "keywords": "",
    "author": "KAPRISIUS MARIO LUKAS PERA DOBE",
    "lecturer": "Inung Wijayanto, Denny Darlis",
    "publisher": "Universitas Telkom, S1 Teknik Telekomunikasi",
    "publish_year": "2024"
  },
  {
    "title": "SECURITY SURVEILLANCE SYSTEM AREA TOWER BTS BASED ON IoT IN THE  COMPANY PT DAYAMITRA TELECOMMUNICATION - Dalam bentuk buku karya ilmiah ",
    "classification": "Karya Ilmiah - Skripsi (S1) - Reference",
    "type_publication": "Iot",
    "subject": "29 kali",
    "abstract": "Base Transceiver Station (BTS) adalah jenis infrastruktur telekomunikasi yang dibangun untuk memungkinkan perangkat telekomunikasi berkomunikasi dengan jaringan operator secara nirkabel. Perangkat-perangkat di BTS penting dalam sistem kerja telekomunikasi, tetapi pada kenyataannya masih banyak kasus pencurian terhadap perangkat-perangkat di area tower. Kasus pencurian paling banyak terjadi pada shelter seperti baterai dan juga area diluar shelter seperti kabel ground. Hal ini menyebabkan kualitas jaringan pada site yang dicuri menurun sehingga menyebabkan kerugian pada provider yang menggunakan site tersebut. Untuk mengatasi permasalahan ini, diperlukan sistem surveillance yang dapat di monitoring dari jarak jauh untuk mengawasi area sekitar tower. Sistem surveillance menggunakan perangkat keras seperti, kamera CCTV yang berfungsi untuk memantau area site dan RFID sebagai alat untuk petugas mengakses pintu masuk dan keluar area site. Selain perangkat keras, sistem ini juga menggunakan website untuk menampilkan seluruh informasi yang dikirimkan oleh alat menggunakan metode komunikasi MQTT dan HTTP, yang kemudian informasi tersebut tersimpan dalam database. Selain website, media lain untuk melihat informasi dari alat adalah Telegram yang berfungsi sebagai silent notification yang mengirimkan capture image saat kamera CCTV mendeteksi objek di area site. Berdasarkan hasil pengujian, kamera CCTV mampu mengambil gambar dan melakukan live streaming dengan protokol RTSP/IP Cam yang terhubung ke router dan menampilkan informasi di website dari pagi hingga malam hari. Sistem object detection pada CCTV menunjukkan tingkat accuracy 76% (pagi), 83% (siang), 89% (sore), 87% (malam); precision 93% (pagi), 88% (siang), 95% (sore), 93% (malam); dan sensitivity 78% (pagi), 88% (siang), 91% (sore), 93% (malam). RFID tipe RC522 High Frequency menunjukan kinerja baik dalam mendeteksi UID dan username tag serta mengendalikan status doorlock, dengan hanya tiga kegagalan dari lima belas percobaan dikarenakan belum terhubung ke WiFi. Pengujian komunikasi menggunakan protokol HTTP dan MQTT menunjukkan bahwa komunikasi antara hardware dan software berjalan dengan baik. Kamera CCTV terhubung ke website dalam 5 detik, sedangkan RFID memerlukan waktu 10 detik. Pengujian pada website menunjukan bahwa website dapat menerima dan menampilkan data yang dikirimkan oleh alat dengan baik.\n\nKata Kunci: Surveillance System, CCTV, RFID, HTTP, BTS",
    "keywords": "",
    "author": "AULIA SYAHNAS",
    "lecturer": "Inung Wijayanto, Denny Darlis",
    "publisher": "Universitas Telkom, S1 Teknik Telekomunikasi - Pindahan",
    "publish_year": "2024"
  },
  {
    "title": "SECURITY SURVEILLANCE SYSTEM AREA TOWER BTS BASED ON IoT IN THE COMPANY PT DAYAMITRA TELECOMMUNICATION - Dalam bentuk buku karya ilmiah ",
    "classification": "Karya Ilmiah - Skripsi (S1) - Reference",
    "type_publication": "Iot",
    "subject": "26 kali",
    "abstract": "Base Transceiver Station (BTS) adalah jenis infrastruktur telekomunikasi yang dibangun untuk memungkinkan perangkat telekomunikasi berkomunikasi dengan jaringan operator secara nirkabel. Perangkat-perangkat di BTS penting dalam sistem kerja telekomunikasi, tetapi pada kenyataannya masih banyak kasus pencurian terhadap perangkat-perangkat di area tower. Kasus pencurian paling banyak terjadi pada shelter seperti baterai dan juga area diluar shelter seperti kabel ground. Hal ini menyebabkan kualitas jaringan pada site yang dicuri menurun sehingga menyebabkan kerugian pada provider yang menggunakan site tersebut.",
    "keywords": "",
    "author": "ANGEL BLESS TANIA",
    "lecturer": "Inung Wijayanto, Denny Darlis",
    "publisher": "Universitas Telkom, S1 Teknik Telekomunikasi",
    "publish_year": "2024"
  },
  {
    "title": "SISTEM INFORMASI MANAJEMEN RESTORAN DI JARINGAN RESTORAN CV BALIBUL - Capstone ",
    "classification": "Karya Ilmiah - Skripsi (S1) - Reference",
    "type_publication": "Aplikasi",
    "subject": "27 kali",
    "abstract": "Solusi berbasis kertas tradisional dalam sistem informasi manajemen restoran tidak efisien dan tidak sesuai karena rentan terhadap kesalahan manusia dan kurangnya kemampuan analisis data. Sistem ini menghambat kemampuan manajer untuk membuat keputusan yang tepat dan berdasarkan data. Proyek capstone design ini mengungkapkan masalah yang ada pada CV Balibul dalam penggunaan teknik manajemen manual yang tidak efisien dan tidak efektif untuk operasional manajemennya.\n\nUntuk mengatasi masalah ini, proyek ini memperkenalkan sistem manajemen restoran digital yang canggih yang khusus dirancang untuk Jaringan Restoran CV Balibul. Sistem ini mengintegrasikan teknologi canggih seperti komputasi awan dan pembelajaran mesin untuk melakukan otomatisasi operasional dan meningkatkan analisis data. Sistem ini menjamin operasi manajemen yang andal dan aman dengan memanfaatkan infrastruktur yang dapat diskalakan dan prosedur keamanan yang kuat dari Google Cloud.\n\nIntegrasi digital dari Sistem manajemen CV Balibul telah mencapai peningkatan yang signifikan dalam efisiensi operasional dan pengambilan keputusan bisnis. Hasilnya menunjukkan peningkatan signifikan dalam operasi sistem informasi manajemen, pemrosesan data, dan visualisasi data. Hasil pengujian aplikasi juga menunjukkan kepuasan tim manajemen terhadap kemampuan aplikasi dan memenuhi harapan tim pengembang serta tim manajemen seperti yang dijanjikan. Singkatnya, proyek capstone design ini membantu Manajemen CV Balibul meningkatkan efisiensi operasional dan membekali manajer dengan analisis data yang kuat untuk membantu pengambilan keputusan bisnis.\n\nKata kunci: Jaringan Restoran, Keputusan Strategis Bisnis, Komputasi Awan, Pembelajaran Mesin, Sistem Manajemen Digital.",
    "keywords": "",
    "author": "EVAN PRADIPTA HARDINATHA",
    "lecturer": "Anggunmeka Luhur Prasasti, Astri Novianty",
    "publisher": "Universitas Telkom, S1 Teknik Komputer",
    "publish_year": "2024"
  },
  {
    "title": "SISTEM INFORMASI MANAJEMEN RESTORAN DI JARINGAN RESTORAN CV BALIBUL - Capstone ",
    "classification": "Karya Ilmiah - Skripsi (S1) - Reference",
    "type_publication": "Aplikasi",
    "subject": "27 kali",
    "abstract": "Solusi berbasis kertas tradisional dalam sistem informasi manajemen restoran tidak efisien dan tidak sesuai karena rentan terhadap kesalahan manusia dan kurangnya kemampuan analisis data. Sistem ini menghambat kemampuan manajer untuk membuat keputusan yang tepat dan berdasarkan data. Proyek capstone design ini mengungkapkan masalah yang ada pada CV Balibul dalam penggunaan teknik manajemen manual yang tidak efisien dan tidak efektif untuk operasional manajemennya.\n\nUntuk mengatasi masalah ini, proyek ini memperkenalkan sistem manajemen restoran digital yang canggih yang khusus dirancang untuk Jaringan Restoran CV Balibul. Sistem ini mengintegrasikan teknologi canggih seperti komputasi awan dan pembelajaran mesin untuk melakukan otomatisasi operasional dan meningkatkan analisis data. Sistem ini menjamin operasi manajemen yang andal dan aman dengan memanfaatkan infrastruktur yang dapat diskalakan dan prosedur keamanan yang kuat dari Google Cloud.\n\nIntegrasi digital dari Sistem manajemen CV Balibul telah mencapai peningkatan yang signifikan dalam efisiensi operasional dan pengambilan keputusan bisnis. Hasilnya menunjukkan peningkatan signifikan dalam operasi sistem informasi manajemen, pemrosesan data, dan visualisasi data. Hasil pengujian aplikasi juga menunjukkan kepuasan tim manajemen terhadap kemampuan aplikasi dan memenuhi harapan tim pengembang serta tim manajemen seperti yang dijanjikan. Singkatnya, proyek capstone design ini membantu Manajemen CV Balibul meningkatkan efisiensi operasional dan membekali manajer dengan analisis data yang kuat untuk membantu pengambilan keputusan bisnis.\n\nKata kunci: Jaringan Restoran, Keputusan Strategis Bisnis, Komputasi Awan, Pembelajaran Mesin, Sistem Manajemen Digital.",
    "keywords": "",
    "author": "SAMUEL ROBERT ROMULUS SIDABALOK",
    "lecturer": "Anggunmeka Luhur Prasasti, Astri Novianty",
    "publisher": "Universitas Telkom, S1 Teknik Komputer",
    "publish_year": "2024"
  },
  {
    "title": "SISTEM INFORMASI MANAJEMEN RESTORAN DI JARINGAN RESTORAN CV BALIBUL - Capstone ",
    "classification": "Karya Ilmiah - Skripsi (S1) - Reference",
    "type_publication": "Aplikasi",
    "subject": "27 kali",
    "abstract": "Solusi berbasis kertas tradisional dalam sistem informasi manajemen restoran tidak efisien dan tidak sesuai karena rentan terhadap kesalahan manusia dan kurangnya kemampuan analisis data. Sistem ini menghambat kemampuan manajer untuk membuat keputusan yang tepat dan berdasarkan data. Proyek capstone design ini mengungkapkan masalah yang ada pada CV Balibul dalam penggunaan teknik manajemen manual yang tidak efisien dan tidak efektif untuk operasional manajemennya.\n\nUntuk mengatasi masalah ini, proyek ini memperkenalkan sistem manajemen restoran digital yang canggih yang khusus dirancang untuk Jaringan Restoran CV Balibul. Sistem ini mengintegrasikan teknologi canggih seperti komputasi awan dan pembelajaran mesin untuk melakukan otomatisasi operasional dan meningkatkan analisis data. Sistem ini menjamin operasi manajemen yang andal dan aman dengan memanfaatkan infrastruktur yang dapat diskalakan dan prosedur keamanan yang kuat dari Google Cloud.\n\nIntegrasi digital dari Sistem manajemen CV Balibul telah mencapai peningkatan yang signifikan dalam efisiensi operasional dan pengambilan keputusan bisnis. Hasilnya menunjukkan peningkatan signifikan dalam operasi sistem informasi manajemen, pemrosesan data, dan visualisasi data. Hasil pengujian aplikasi juga menunjukkan kepuasan tim manajemen terhadap kemampuan aplikasi dan memenuhi harapan tim pengembang serta tim manajemen seperti yang dijanjikan. Singkatnya, proyek capstone design ini membantu Manajemen CV Balibul meningkatkan efisiensi operasional dan membekali manajer dengan analisis data yang kuat untuk membantu pengambilan keputusan bisnis.\n\nKata kunci: Jaringan Restoran, Keputusan Strategis Bisnis, Komputasi Awan, Pembelajaran Mesin, Sistem Manajemen Digital.",
    "keywords": "",
    "author": "MUHAMMAD GARMA ASYAM RIANTO",
    "lecturer": "Anggunmeka Luhur Prasasti, Astri Novianty",
    "publisher": "Universitas Telkom, S1 Teknik Komputer",
    "publish_year": "2024"
  },
  {
    "title": "SISTEM INFORMASI PELAYANAN SURAT DESA  BERBASIS SINGLE PAGE APPLICATION MENGGUNAKAN  LARAVEL DAN SPLADE PADA DESA SAWO BRINGIN,  KOTA SURABAYA - Dalam bentuk buku karya ilmiah ",
    "classification": "Karya Ilmiah - Skripsi (S1) - Reference",
    "type_publication": "Information System Web",
    "subject": "30 kali",
    "abstract": "Desa Sawo Bringin merupakan sebuah daerah pedesaan yang berada pada Kelurahan Bringin dan Kecamatan Sambikerep, Kota Surabaya. Aktivitas administrasi pada desa ini masih memakai cara konservatif, di mana masyarakat perlu datang langsung ke balai desa ataupun ke tempat tinggal perangkat desa. Pada sisi perangkat desa, mereka masih memakai buku sebagai acuan untuk mencatat segala urusan administrasi desa. Pada saat ini di kota Surabaya telah ada website yang dapat membantu masyarakat dalam urusan administrasi yaitu Klampid New Generation. Pada website ini warga dapat mengurus berbagai surat pencatatan sipil secara mandiri, namun dalam penerapannya masih terdapat syarat untuk memasukkan surat keterangan desa. Oleh sebab itu perlu adanya sebuah sistem yang dapat membantu masyarakat untuk mengajukan surat keterangan desa secara mandiri tanpa perlu bertemu langsung dengan perangkat desa setempat. Tujuan dari penelitian ini memudahkan warga untuk mengurus surat keterangan desa tanpa perlu bertemu dengan perangkat desa. Pada pengembangan ini akan mendapat luaran sebuah program yang dapat digunakan pada multiplatform dengan berbasis web application. Dalam pengembangan website ini akan menggunakan metodologi pengembangan waterfall sedangkan pembuatan desain sistem Unified Modeling Language (UML) menggunakan metode Iconix Process. Pada web ini akan menggunakan teknologi framework Laravel dan Splade yakni sebuah package untuk mempermudah pembuatan Single Page Application (SPA). Pengunaan Splade ini terbukti mampu meningkatkan dari segi performa dengan skor 97 dan 100 untuk aksesibilitas, skor ini didapat dengan menguji website SIMPELAE pada platform PageSpeed Insights. Selain itu pengembangan ini akan menggunakan Progressive Web App (PWA) agar warga tidak perlu menggunakan laptop untuk mengaksesnya. Metode testing yang akan digunakan dalam pengembangan ini yaitu dengan Black Box Testing dan Usability Testing, yang nantinya responden testing yaitu dari perangkat desa dan warga desa yang bersangkutan. Dalam fase testing black box testing tidak ada masalah yang terjadi pada sistem, sedangkan pada usability testing mendapat skor 86,4 dengan kategori A atau bagus sekali. Kata Kunci: Administrasi Desa, Laravel, Single Page Application (SPA), Progressive Web App (PWA), Waterfall",
    "keywords": "",
    "author": "BAGUS CAHYO SULISTIYO",
    "lecturer": "Ahmad Wali Satria Bahari Johan, Purnama Anaking",
    "publisher": "Universitas Telkom, S1 Sistem Informasi - Kampus Surabaya",
    "publish_year": "2024"
  },
  {
    "title": "SISTEM PENDETEKSI KANTUK PADA  PENGENDARA RODA EMPAT MENGGUNAKAN  CONVOLUTIONAL NEURAL NETWORK - Dalam bentuk buku karya ilmiah ",
    "classification": "Karya Ilmiah - Skripsi (S1) - Reference",
    "type_publication": "Machine Learning",
    "subject": "42 kali",
    "abstract": "Kecelakaan lalu lintas adalah masalah serius yang mengancam keselamatan pengguna jalan, dan salah satu penyebab utama adalah kondisi pengemudi yang mengantuk. Penelitian ini bertujuan untuk mengidentifikasi dan mencegah kantuk pada pengemudi roda empat melalui sistem pendeteksi kantuk menggunakan metode Convolutional Neural Network (CNN). Tahap penelitian dimulai dengan pengumpulan dataset secara mandiri menggunakan OpenCV dan webcam untuk pengambilan citra. Dataset yang digunakan merupakan gabungan dari citra yang diambil sendiri dan data dari penelitian terdahulu, yang mencakup foto berlabel pengemudi dalam kondisi \"sadar\", \"mengantuk\", dan \"tertidur\". Sistem pengklasifikasian menggunakan metode CNN, yang dimulai dengan memasukkan dataset pada lapisan input, beberapa convolutional layers, dan diakhiri dengan lapisan output. Model machine learning dilatih menggunakan TensorFlow untuk mengenali kondisi pengemudi. Proses pelatihan model dilakukan berulang kali hingga mencapai akurasi yang diinginkan. Setelah itu, model digunakan untuk memprediksi kondisi pengemudi secara real-time melalui webcam menggunakan OpenCV. Berdasarkan prediksi tersebut, sistem memberikan peringatan berupa bunyi beep tiga kali jika pengemudi mengantuk dan alarm jika pengemudi tertidur. Hasil penelitian menunjukkan bahwa sistem ini mampu mendeteksi kantuk dengan akurasi yang cukup tinggi. Data yang dikumpulkan mencakup berbagai kondisi pengemudi dan diproses melalui tahap pembersihan, pelabelan, dan pembagian subset untuk pelatihan dan pengujian. Arsitektur model CNN yang digunakan terbukti efektif dalam mengidentifikasi kondisi kantuk dengan baik. Evaluasi performa model menunjukkan bahwa model ini memiliki tingkat akurasi yang memadai dalam mendeteksi kondisi sadar, mengantuk, dan tertidur pada pengemudi. Sistem ini diuji pada berbagai kondisi pengemudi untuk memastikan kemampuan model dan akurasi deteksi dalam situasi yang beragam. Selain itu, implementasi sistem ini menunjukkan bahwa model CNN dapat diintegrasikan dengan perangkat keras seperti kamera webcam yang umum digunakan. Ini menunjukkan bahwa sistem pendeteksi kantuk berbasis CNN ini tidak hanya efisien secara komputasi tetapi juga praktis untuk diimplementasikan dalam skenario dunia nyata. Sistem ini dirancang untuk memberikan peringatan dini kepada pengemudi melalui isyarat suara, yang membantu pengemudi menyadari kondisi mengantuk mereka sebelum situasi memburuk dan berpotensi menyebabkan kecelakaan. Kesimpulan dari penelitian ini menyatakan bahwa penggunaan CNN dalam mendeteksi kantuk pengemudi adalah metode yang efektif dan efisien. Namun, penelitian lebih lanjut disarankan untuk mengembangkan model dengan dataset yang lebih besar dan lebih beragam, serta integrasi dengan sistem kendaraan untuk otomatisasi peringatan dan pengambilan tindakan preventif. Selain itu, disarankan untuk mengeksplorasi penggunaan sensor tambahan seperti sensor detak jantung dan sensor gerakan kepala untuk meningkatkan akurasi deteksi kantuk. Dengan sistem ini, diharapkan dapat memberikan kontribusi dalam penurunan angka kecelakaan lalu lintas yang disebabkan oleh pengemudi yang mengantuk dan meningkatkan keselamatan berkendara secara keseluruhan. Penerapan sistem ini tidak hanya bermanfaat untuk pengemudi individu tetapi juga dapat diterapkan dalam industri transportasi untuk meningkatkan keselamatan operasional. Dalam jangka panjang, integrasi sistem deteksi kantuk dengan kendaraan otonom juga menjadi area penelitian yang menarik, di mana sistem ini dapat membantu kendaraan dalam mengambil alih kendali ketika mendeteksi pengemudi yang tidak lagi waspada. Ini akan membuka jalan bagi inovasi lebih lanjut dalam teknologi kendaraan pintar dan keselamatan jalan raya.",
    "keywords": "",
    "author": "RAMADITYA BHASKARA MAWANTA",
    "lecturer": "Ahmad Wali Satria Bahari Johan",
    "publisher": "Universitas Telkom, S1 Sistem Informasi - Kampus Surabaya",
    "publish_year": "2024"
  },
  {
    "title": "SYSTEM CONTROLLING & MONITORING FOR WATER QUALITY IN TILAPIA FISH BIOFLOC WITH FUZZY DECISION FOR CLASSIFICATION STATUS - Capstone ",
    "classification": "Karya Ilmiah - Skripsi (S1) - Reference",
    "type_publication": "Internet Of Things",
    "subject": "28 kali",
    "abstract": "Kualitas air sangat penting dalam budidaya ikan. PT Helmi Farm Mandiri melaporkan kematian ikan sekitar 7% akibat kurangnya pemantauan kualitas air. Saat ini, pemantauan dan pengelolaan kualitas air kolam masih dilakukan secara manual, di mana peternak harus mendatangi setiap kolam. Selain itu, harga alat ukur kualitas air yang tersedia di pasaran mahal, sehingga menambah beban biaya bagi peternak.\n   Dalam penelitian ini, dikembangkan sebuah sistem berbasis Internet of Things (IoT) untuk memantau kualitas air bioflok ikan nila. Sistem ini menggunakan jaringan WiFi untuk komunikasi jarak jauh, dan waktu pemantauan dapat diatur secara otomatis dan real-time sesuai kebutuhan. Data sensor dari node dikirim ke gateway, kemudian diteruskan ke platform IoT. Pengolahan data kualitas air dilakukan dengan metode fuzzy Mamdani untuk menentukan status kualitas air, dan metode if-else digunakan untuk pengendalian setiap parameter. Pengendali akan aktif ketika kondisi air tidak ideal.\n   Hasil pengujian menunjukkan bahwa sistem mampu melakukan pengambilan dan pengiriman data 48 kali per hari, mempertahankan setiap parameter dalam kondisi ideal yaitu pH antara 6,5 – 8,5, suhu 25-30°C dan kekeruhan 0 - 300 ppm. Pengendali berhasil mengembalikan kondisi air dari non-ideal ke ideal dalam waktu 30 menit.  Sistem berhasil menentukan status kualitas air menggunakan metode fuzzy dengan akurasi 100%, terbukti berdasarkan perbandingan antara expected fuzzy result dan obtained result yang diperoleh dari 20 data random, rata-rata persentase error pengukuran parameter pH dan suhu \n \nKata kunci: Kualitas air, Pemantauan, IoT, Budidaya ikan, Sistem monitoring, Bioflok, Fuzzy.",
    "keywords": "",
    "author": "HADI MARWAN AL MUNAWAR",
    "lecturer": "Erwin Susanto, Brahmantya Aji Pramudita",
    "publisher": "Universitas Telkom, S1 Teknik Elektro",
    "publish_year": "2024"
  },
  {
    "title": "SYSTEM CONTROLLING & MONITORING FOR WATER QUALITY IN TILAPIA FISH BIOFLOC WITH FUZZY DECISION FOR CLASSIFICATION STATUS - Capstone ",
    "classification": "Karya Ilmiah - Skripsi (S1) - Reference",
    "type_publication": "Internet Of Things",
    "subject": "34 kali",
    "abstract": "Kualitas air sangat penting dalam budidaya ikan. PT Helmi Farm Mandiri melaporkan kematian ikan sekitar 7% akibat kurangnya pemantauan kualitas air. Saat ini, pemantauan dan pengelolaan kualitas air kolam masih dilakukan secara manual, di mana peternak harus mendatangi setiap kolam. Selain itu, harga alat ukur kualitas air yang tersedia di pasaran mahal, sehingga menambah beban biaya bagi peternak.\nDalam penelitian ini, dikembangkan sebuah sistem berbasis Internet of Things (IoT) untuk memantau kualitas air bioflok ikan nila. Sistem ini menggunakan jaringan WiFi untuk komunikasi jarak jauh, dan waktu pemantauan dapat diatur secara otomatis dan real-time sesuai kebutuhan. Data sensor dari node dikirim ke gateway, kemudian diteruskan ke platform IoT. Pengolahan data kualitas air dilakukan dengan metode fuzzy Mamdani untuk menentukan status kualitas air, dan metode if-else digunakan untuk pengendalian setiap parameter. Pengendali akan aktif ketika kondisi air tidak ideal.\nHasil pengujian menunjukkan bahwa sistem mampu melakukan pengambilan dan pengiriman data 48 kali per hari, mempertahankan setiap parameter dalam kondisi ideal yaitu pH antara 6,5 – 8,5, suhu 25-30°C dan kekeruhan 0 - 300 ppm. Pengendali berhasil mengembalikan kondisi air dari non-ideal ke ideal dalam waktu 30 menit. Sistem berhasil menentukan status kualitas air menggunakan metode fuzzy dengan akurasi 100%, terbukti berdasarkan perbandingan antara expected fuzzy result dan obtained result yang diperoleh dari 20 data random, rata-rata persentase error pengukuran parameter pH dan suhu \nKata kunci: Kualitas air, Pemantauan, IoT, Budidaya ikan, Sistem monitoring, Bioflok, Fuzzy.\n<div id=\"urban-overlay\" style=\"\n      left: -10px;\n      top: -10px;\n      width: 0px;\n      height: 0px;\n    \"> ",
    "keywords": "",
    "author": "MUH. ADRIAN HIDAYAT",
    "lecturer": "Erwin Susanto, Brahmantya Aji Pramudita",
    "publisher": "Universitas Telkom, S1 Teknik Elektro",
    "publish_year": "2024"
  },
  {
    "title": "ANALISIS SISTEMATIS INSIDEN KERENTANAN ADOBE COLDFUSION DENGAN MITIGASI RISIKO DAN METODOLOGI MITRE ATTACK - Dalam bentuk buku karya ilmiah ",
    "classification": "Karya Ilmiah - TA (D3) - Reference",
    "type_publication": "Cybersecurity",
    "subject": "56 kali",
    "abstract": "Penelitian terkait insiden Adobe ColdFusion exploit lead to system compromise yang terjadi pada perusahaan pelanggan. Insiden ini menyebabkan kerugian finansial dan reputasi bagi perusahaan. Penelitian ini akan menganalisis akar permasalahan, dampak insiden, dan langkah-langkah mitigasi dan pencegahan yang dapat dilakukan.\n\nPenelitian ini bertujuan untuk menganalisis insiden tersebut secara sistematis dengan menggunakan kerangka kerja MITRE ATT&CK dan merumuskan strategi mitigasi risiko untuk mencegah insiden serupa.\n\nPenelitian ini menggunakan metode studi kasus dengan analisis log dan dokumentasi terkait insiden. Kerangka kerja MITRE ATT&CK digunakan untuk mengidentifikasi taktik, teknik, dan prosedur (TTP) yang digunakan dalam insiden. Hasil penelitian menunjukkan bahwa insiden tersebut dieksploitasi dengan menggunakan taktik dan teknik MITRE ATT&CK.\nHasil penelitian menunjukkan secara umum bahwa insiden tersebut disebabkan oleh beberapa faktor, antara lain:\n\n    Kerentanan pada perangkat lunak Adobe ColdFusion yang digunakan oleh perusahaan.\n    Kurangnya kontrol keamanan dan monitoring pada sistem yang menggunakan Adobe ColdFusion.\n    Kesalahan konfigurasi dan manajemen patch yang tidak memadai.\n\nPenelitian ini merekomendasikan beberapa Langkah mitigasi dan pencegahan untuk mencegah insiden serupa, antara lain:",
    "keywords": "",
    "author": "MULKAN AZHIMAN",
    "lecturer": "Yuli Sun Hariyani",
    "publisher": "Universitas Telkom, D3 Teknologi Telekomunikasi",
    "publish_year": "2024"
  },
  {
    "title": "Aplikasi Berbasis Web untuk Mencatat Perolehan, Penyusutan Aktiva Tetap dan Neraca Saldo (Studi Kasus : Toko AHS Putri Harahap, Medan) - Dalam bentuk pengganti sidang - Artikel Jurnal - Dalam bentuk pengganti sidang - Artikel Jurnal ",
    "classification": "Karya Ilmiah - TA (D3) - Reference",
    "type_publication": "Accounting Information Systems",
    "subject": "72 kali",
    "abstract": "Toko AHS Putri Harahap merupakan perusahaan yang bergerak sebagai distributor air mineral dan gas. Saat ini Toko AHS Putri Harahap masih belum memiliki pencatatan keuangan yang sesuai dengan standar akuntansi dan belum memiliki rincian mengenai data aktiva tetap yang dimiliki perusahaan dan mengakibatkan tidak diketahui nama aktiva tetap, tanggal perolehan, harga perolehan, jenis aktiva, taksiran masa penggunaan serta nilai residu aktiva tetap. Pada saat aktiva tetap yang dimiliki Toko AHS Putri Harahap mengalami kerusakan, pemilik baru mengetahui bahwa aktiva tetap tersebut tidak dapat digunakan untuk sementara waktu/tidak dapat digunakan kembali dalam artian pemilik harus mencari pengganti aktiva tetap yang rusak tersebut secara mendadak dan berdampak pada proses pendistribusian menjadi terhambat. Selain pencatatan perolehan aktiva tetap yang belum dimiliki Toko AHS Putri Harahap juga belum melakukan perhitungan penyusutan aktiva tetap yang dimiliki. Perhitungan penyusutan aktiva tetap berguna dalam membantu Toko AHS Putri Harahap mencegah pergantian aktiva tetap yang secara mendadak. Apabila pergantian aktiva tetap dilakukan secara mendadak pemilik menyatakan bahwa terkadang mendapat aktiva tetap yang kurang sesuai dengan spesifikasi aktiva tetap yang biasa digunakan sebelumnya. Aplikasi ini dibangun dengan metode berorientasi objek dan pengembangan model SDLC serta menggunakan Bahasa pemrograman PHP, Framework CodeIgniter serta menggunakan metode pengujian black box testing. Sistem dibuat untuk memberikan kemudahan pada pengguna sistem khususnya pada pemilik/admin dan bagian operasional dalam perhitungan harga perolehan, penyusutan aktiva tetap dan neraca saldo pada Toko AHS Putri Harahap, Medan.",
    "keywords": "",
    "author": "RAHMAT FAUZI",
    "lecturer": "Nelsi Wisna, Tora Fahrudin",
    "publisher": "Universitas Telkom, D3 Sistem Informasi Akuntansi",
    "publish_year": "2024"
  },
  {
    "title": "FOCKETFARM: APLIKASI BERBASIS WEBSITE UNTUK EDUKASI DAN PENGELOLAAN PERTANIAN BIOFARMAKA DI DESA PUTRAJAWA, KABUPATEN GARUT - Dalam bentuk buku karya ilmiah ",
    "classification": "Karya Ilmiah - TA (D3) - Reference",
    "type_publication": "Perancangan Aplikasi",
    "subject": "37 kali",
    "abstract": "Permasalahan dalam sektor pertanian biofarmaka di Indonesia saat ini mencakup beberapa aspek penting yang menghambat perkembangan dan produktivitasnya. Salah satu masalah utama adalah kurangnya infrastruktur dan akses terhadap teknologi pertanian modern. Banyak petani masih menggunakan metode tradisional karena keterbatasan teknologi. Untuk mengatasi hal ini, dikembangkanlah FocketFarm, sebuah platform edukasi berbasis web untuk pertanian greenhouse. Tujuannya adalah memberikan pengetahuan dan keterampilan praktis dalam pertanian greenhouse kepada pengguna. Pengguna FocketFarm dapat memperoleh informasi tentang teknik bertani, perawatan tanaman, pengelolaan sumber daya, dan praktik-praktik pertanian yang berkelanjutan. Untuk mengembangkan website FocketFarm, yaitu dengan menggunakan metode Framework for the Application of System Thinking (FAST) tujuan nya adalah untuk menyusun desain sistem secara lebih efisien dan sesuai dengan tujuan yang ditetapkan. Webste FocketFarm dapat memperoleh informasi tentang teknik bertani di dalam greenhouse, perawatan tanaman, pengelolaan sumber daya, dan praktik-praktik pertanian yang berkelanjutan. Dengan antarmuka yang mudah digunakan, FocketFarm memungkinkan akses yang intuitif bagi pengguna dari latar belakang yang beragam. Dengan demikian, FocketFarm berfungsi sebagai alat efektif dalam meningkatkan pemahaman dan keterampilan dalam pertanian greenhouse melalui platform web yang mudah diakses",
    "keywords": "",
    "author": "DADAN HAMDANI",
    "lecturer": "Bayu Rima Aditya, Pramuko Aji",
    "publisher": "Universitas Telkom, D3 Sistem Informasi",
    "publish_year": "2024"
  },
  {
    "title": "GPS Tracker LoRaWAN Communication - Dalam bentuk buku karya ilmiah ",
    "classification": "Karya Ilmiah - TA (D3) - Reference",
    "type_publication": "Gps",
    "subject": "33 kali",
    "abstract": "GPS Tracker adalah perangkat yang memanfaatkan Sistem Pemosisian Global (GPS) untuk menentukan dan melacak lokasi objek tertentu dari jarak jauh. Perangkat ini terdiri dari penerima GPS yang terhubung ke serangkaian satelit untuk menentukan lokasi perangkat. GPS Tracker dengan komunikasi LoRaWAN digunakan untuk mendapatkan koordinat dari armada atau aset yang berada di daerah pertambangan yang terpencil. Modul GPS Quectel L86 digunakan untuk memperoleh posisi secara akurat, memanfaatkan teknologi GPS yang canggih untuk memastikan keakuratan dan keandalan data lokasi. Sedangkan, modul LoRa digunakan untuk mengirimkan data tersebut melalui jaringan LoRaWAN, yang memungkinkan transmisi data jarak jauh dengan konsumsi daya yang rendah, ideal untuk penggunaan di lokasi area pertambangan.",
    "keywords": "",
    "author": "ZIDHAN YOGA PRATAMA",
    "lecturer": "Sugondo Hadiyoso",
    "publisher": "Universitas Telkom, D3 Teknologi Telekomunikasi",
    "publish_year": "2024"
  },
  {
    "title": "MIKROSTRIP ANTENA ARRAY DENGAN PATCH BERBENTUK LOGO ITERA UNTUK FEEDER ANTENA TELESKOP RADIO - Dalam bentuk buku karya ilmiah ",
    "classification": "Karya Ilmiah - TA (D3) - Reference",
    "type_publication": "Communications Engineering-transmission",
    "subject": "31 kali",
    "abstract": "Teleskop radio adalah sistem penerima sinyal radio yang dipancarkan oleh benda-benda langit. Teleskop radio terdiri dari beberapa komponen seperti feeder, reflector, amplifier, dan lain-lain. Agar teleskop radio dapat menerima sinyal radio dari benda-benda langit, frekuensi resonansi feeder teleskop harus mendekati frekuensi sinyal yang diterima. ITERA bekerja sama dengan D3 Teknologi Telekomunikasi (D3TT), Universitas Telkom, untuk membuat feeder dari sistem teleskop radio. Agar teleskop dapat berfungsi dengan baik, feeder teleskop harus beresonansi di sekitar frekuensi hidrogen netral, yaitu 1,42 GHz.",
    "keywords": "",
    "author": "EL NISSI HAMASIAH",
    "lecturer": "Radial Anwar, Unang Sunarya",
    "publisher": "Universitas Telkom, D3 Teknologi Telekomunikasi",
    "publish_year": "2024"
  },
  {
    "title": "MODEL MACHINE LEARNING UNTUK SMART  PORTABLE CROP RECOMMENDATION TOOL - Dalam bentuk buku karya ilmiah ",
    "classification": "Karya Ilmiah - TA (D3) - Reference",
    "type_publication": "Machine Learning",
    "subject": "34 kali",
    "abstract": "Indonesia adalah salah satu negara dengan potensi pertanian yang sangat besar, dengan didukung kondisi sumber daya alam dan iklim yang sangat baik. Namun, pemanfaatan sistem rekomendasi pertanian dalam aktivitas pertanian di Indonesia masih belum banyak dikembangkan. Padahal, minimnya pengetahuan para petani tentang hal-hal yang terkait dalam pengambilan keputusan pertanian juga masih menjadi kendala dalam menghambat produktifitas pertanian, seperti kapan waktu tanam terbaik, bagaimana performansi lahan, apa komoditias tani yang harus ditanam di waktu tertentu, dan lain sebagainya. Apabila hal ini terus dibiarkan, maka aktivitas pertanian menjadi tidak optimal yang berdampak pada kebutuhan hasil pertanian di Indonesia tidak akan tercukupi dengan baik. Berdasarkan pemasalahan tersebut, penelitian ini bertujuan untuk mengembangkan Machine Learning untuk memberikan rekomendasi yang tepat kepada petani dalam memilih lahan pertanian yang sesuai dengan jenis tanaman yang diinginkan. Studi yang dilakukan akan menggunakan pedekatan dengan metode pengembangan Machine Learning. Hasil penelitian ini berupa sistem rekomendasi pertanian untuk penentuan kesesuaian lahan pertanian dengan komoditas tani yang ditanam. Diharapkan hasil penelitian ini dapat berkontribusi pada produktifitas hasil pangan di Indonesia",
    "keywords": "",
    "author": "MUHAMMAD QANIT AL-HIJRAN",
    "lecturer": "Bayu Rima Aditya, Elis Hernawati",
    "publisher": "Universitas Telkom, D3 Sistem Informasi",
    "publish_year": "2024"
  },
  {
    "title": "PEMBANGUNAN BACK-END APLIKASI CLEIN BERBASIS MOBILE UNTUK TABUNGAN SAMPAH BOTOL PLASTIK IOT DI DESA BOJONGSOANG - Dalam bentuk buku karya ilmiah ",
    "classification": "Karya Ilmiah - TA (D3) - Reference",
    "type_publication": "Waste Management",
    "subject": "34 kali",
    "abstract": "Desa Bojongsoang adalah desa yang berada di wilayah Kecamatan Bojongsoang yang memiliki jumlah penduduk sekitar 24.524 jiwa. Namun, desa Bojongsoang memiliki tantangan dalam pengelolaan sampah botol plastik yang efektif dan berkelanjutan. Tujuan dari pembuatan aplikasi ini yaitu untuk meningkatkan partisipasi masyarakat dalam pengelolaan sampah botol plastik, sekaligus mendorong kesadaran akan pentingnya menjaga lingkungan dengan memanfaatkan aplikasi “CLEIN” yang dibangun menggunakan Flutter Framework dan Flask Framework. Penelitian ini dapat menunjukkan peningkatan jumlah partisipasi masyarakat secara langsung dengan memanfaatkan tabungan sampah botol plastik yang tercatat melalui sistem informasi \"CLEIN”. Penelitian ini menunjukkan bahwa penerapan teknologi informasi dalam pengelolaan sampah dapat memberikan kontribusi signifikan dalam upaya menjaga kebersihan lingkungan serta meningkatkan kesadaran masyarakat akan pentingnya daur ulang. Hal ini menunjukkan bahwa penerapan teknologi informasi dalam manajemen sampah dapat menjadi solusi yang efektif untuk mengatasi masalah lingkungan di tingkat lokal.",
    "keywords": "",
    "author": "GANESA APRILYAN PHANAMA",
    "lecturer": "Suryatiningsih, Patrick Adolf Telnoni",
    "publisher": "Universitas Telkom, D3 Sistem Informasi",
    "publish_year": "2024"
  },
  {
    "title": "PENDETEKSIAN KESEHATAN HAMSTER UNTUK LABORATORIUM PENELITIAN PT.BIOFARMA MENGGUNAKAN ALGORITMA YOLO-V8 - Dalam bentuk buku karya ilmiah ",
    "classification": "Karya Ilmiah - TA (D3) - Reference",
    "type_publication": "Computer Vision",
    "subject": "39 kali",
    "abstract": "Salah satu hewan yang digunakan untuk uji coba penelitian adalah hamster. Karena hamster sangat rentan terhadap penyakit, dokter harus memastikan kondisi kesehatan hamster. Saat ini, penilaian kesehatan dilakukan secara langsung melalui kunjungan ke dokter hewan. Dokter hewan memantau perilaku, suhu, dan fisik hamster. Tujuan studi ini adalah untuk membuat sistem computer vision yang dapat mendeteksi kesehatan hamster secara real-time dengan menggunakan kamera. Sistem ini akan dikembangkan menggunakan Python. Selain itu, tujuan dari studi ini yaitu membantu dokter hewan dalam memantau kesehatan hamster, mengidentifikasi hamster yang sehat, dan memberikan informasi awal tentang masalah kesehatan hamster. Tujuannya adalah untuk mengurangi penyebaran penyakit ke hamster lain dan mengurangi  kontak fisik dengan hewan tersebut. Untuk mengidentifikasi dan mengklasifikasikan hamster yang sehat dengan akurat, metodologi penelitian menggunakan teknik deep learning dan algoritma YOLOv8. 9,445 dataset digunakan, dengan 4,601 dataset hamster yang sehat dan 4,844 dataset hamster yang sakit. Kinerja sistem ini dilakukan melalui uji coba menggunakan dataset hewan pada hamster. Uji coba ini melibatkan hamster yang sehat dan sakit untuk mendapatkan informasi cepat dan akurat tentang kondisi kesehatan hamster, yang memungkinkan untuk mendeteksi dini gejala penyakit. Hasil penelitian menunjukkan bahwa sistem ini dapat dengan akurat mengidentifikasi status kesehatan hamster dengan confidence antara 85% hingga 89% dalam waktu kurang dari 60 detik.\n \nKata Kunci: Computer Vision, Hamster, Mendeteksi Kesehatan, Real-Time, YOLOv8",
    "keywords": "",
    "author": "ALYA MAULIDA",
    "lecturer": "Muhammad Ikhsan Sani, Muhammad Rizqy Alfarisi",
    "publisher": "Universitas Telkom, D3 Teknologi Komputer",
    "publish_year": "2024"
  },
  {
    "title": "PENERAPAN SISTEM PEMANTAUAN TANAH DAN LINGKUNGAN UNTUK PERTANIAN CERDAS - Dalam bentuk buku karya ilmiah ",
    "classification": "Karya Ilmiah - TA (D3) - Reference",
    "type_publication": "Monitoring",
    "subject": "45 kali",
    "abstract": "Pertanian memegang peran strategis dalam ketahanan pangan dan ekonomi, namun menghadapi tantangan seperti inflasi dan gagal panen akibat iklim dan hama. Penelitian ini bertujuan mengembangkan sistem pemantauan tanah dan lingkungan berbasis website untuk smart agriculture, memanfaatkan teknologi IoT. Sistem ini memberikan data real-time mengenai kondisi lahan pertanian, seperti kadar NPK, suhu, kelembaban, dan faktor lingkungan lainnya, yang ditampilkan dalam bentuk visualisasi grafik garis dan gauge. Data dikumpulkan melalui sensor IoT dan diakses secara remote melalui website, yang menerapkan client-side rendering dengan stale-while-revalidate pada framework Next.js untuk revalidasi data dalam rentang waktu tertentu. Selain itu, sistem menyediakan fitur notifikasi peringatan untuk parameter abnormal dan opsi pengunduhan data dalam bentuk excel. Dengan sistem ini, petani dapat mengelola lahan secara lebih efektif dan mengurangi risiko gagal panen. Implementasi sistem monitoring ini diharapkan mampu mendukung pertanian yang lebih efektif dan efisien melalui pemantauan kondisi tanah dan lingkungan secara akurat dan real-time.",
    "keywords": "",
    "author": "MUHAMMAD BINTANG RAMADHAN",
    "lecturer": "Bayu Rima Aditya, Pramuko Aji",
    "publisher": "Universitas Telkom, D3 Sistem Informasi",
    "publish_year": "2024"
  },
  {
    "title": "PENGEMBANGAN APLIKASI API GATEWAY  MANAGEMENT DALAM LAYANAN  PERBANKAN PADA PT BANK PERMATA TBK - Dalam bentuk buku karya ilmiah ",
    "classification": "Karya Ilmiah - TA (D3) - Reference",
    "type_publication": "Application Software-development",
    "subject": "34 kali",
    "abstract": "Tujuan dari proyek ini adalah untuk membuat kebijakan REST API yang sesuai untuk layanan perbankan mortgage PT Bank Permata Tbk. Untuk mencapai tujuan ini, akan digunakan Axway Policy Studio untuk menggabungkan REST API dan SOAP API. Untuk mengelola siklus hidup API secara menyeluruh, proyek ini menggunakan platform Manajemen Pintu API untuk menangani masalah manajemen, keamanan, dan kinerja API yang terus meningkat. Proses pengembangan yang digunakan adalah SDLC Waterfall yang dimodifikasi. Tahap inisiasi, desain sistem, implementasi, integrasi, pengujian, dan pemeliharaan adalah semua bagian dari metode pengembangan ini. Meskipun backend menggunakan SOAP API, API mortgage dapat digunakan dengan mudah oleh klien. Konversi antara REST/JSON dan SOAP/XML berjalan dengan baik, memastikan bahwa API mortgage beroperasi dengan baik sesuai kebutuhan dan standar keamanan yang ditetapkan.\n\nKata Kunci: APIs, API Gateway management, Kebijakan API, Axway Policy Studio",
    "keywords": "",
    "author": "AUDIANSYAH MUHAMAD SYAWALHAN",
    "lecturer": "Heru Nugroho, Guntur Prabawa Kusuma",
    "publisher": "Universitas Telkom, D3 Sistem Informasi",
    "publish_year": "2024"
  },
  {
    "title": "Pengujian Keamanan Menggunakan Teknik Penetration Testing Dan Vulnerability Assessment Terhadap Aplikasi Web Logistic Service Integrator Apical Group - Dalam bentuk buku karya ilmiah ",
    "classification": "Karya Ilmiah - TA (D3) - Reference",
    "type_publication": "Cyber Security",
    "subject": "29 kali",
    "abstract": "Dalam era digital yang terus berkembang, penggunaan aplikasi web untuk mendukung berbagai kegiatan bisnis menjadi semakin umum. Salah satu sektor yang sangat tergantung pada teknologi informasi adalah industri logistik. Namun, semakin kompleks aplikasi tersebut juga meningkatkan potensi untuk celah keamanan. Apical Group merupakan salah satu pengolah, produsen, pedagang, dan distributor minyak sawit terintegrasi vertikal terbesar di Indonesia. Apical Group bersama PT Indo Trans Teknologi (TransTRACK) telah mengembangkan Aplikasi Web Logistic Service Integrator (LSI) yang kompleks untuk mengelola operasi logistik mereka dengan lebih efisien. Penelitian ini dilakukan untuk menguji keamanan aplikasi web Logistic Service Integrator Apical Group menggunakan teknik penetration testing dan vulnerability assessment. Tujuan dari penelitian ini adalah untuk mengidentifikasi potensi kerentanan dan menilai tingkat keamanan aplikasi tersebut. Metode yang digunakan mencakup pengumpulan informasi, penilaian kerentanan, dan pengujian keamanan menggunakan berbagai alat seperti Subfinder, TheHarvester, dan Nuclei. Hasil penelitian menunjukkan bahwa aplikasi web tersebut memiliki tingkat keamanan yang baik dengan tidak adanya kerentanan yang signifikan.",
    "keywords": "",
    "author": "SULISTYO WINARDI",
    "lecturer": "Indrarini Dyah Irawati",
    "publisher": "Universitas Telkom, D3 Teknologi Telekomunikasi",
    "publish_year": "2024"
  },
  {
    "title": "Perancangan dan Implementasi Alat Grounding Perangkat FDM Telkom Indonesia Pada Digitalisasi SPBU Pertamina Kota Semarang - Dalam bentuk buku karya ilmiah ",
    "classification": "Karya Ilmiah - TA (D3) - Reference",
    "type_publication": "Perancangan Sistem",
    "subject": "35 kali",
    "abstract": "Perancangan dan implementasi alat grounding FDM ini dapat berguna untuk mengurangi atau meniadakan resiko kerusakan perangkat-perangkat Telkom dan Pertamina, khususnya Forecourt Controller (FCC) dan Forecourt Device Management (FDM). Dengan mengurangi atau meniadakan kerusakan perangkat tersebut akan memperlancar proses pendistribusian bahan bakar minyak, termasuk proses pencatatan transaksi. Dengan adanya alat grounding FDM ini juga akan menghemat biaya perawatan perangkat-perangkat tersebut.",
    "keywords": "",
    "author": "KARDO AGUSMAN SITUNGKIR",
    "lecturer": "Radial Anwar",
    "publisher": "Universitas Telkom, D3 Teknologi Telekomunikasi",
    "publish_year": "2024"
  },
  {
    "title": "PERANCANGAN SISTEM KOMUNIKASI BERBASIS LORA DAN AESTHETIC ANTENA - Dalam bentuk buku karya ilmiah ",
    "classification": "Karya Ilmiah - TA (D3) - Reference",
    "type_publication": "Antena Mikrostrip",
    "subject": "28 kali",
    "abstract": "Long Range Access (LoRa) adalah teknologi yang memungkinkan pengiriman data jarak jauh berdaya rendah dengan frekuensi radio pada pita 433 MHz, 868 MHz, atau 915 MHz. Teknologi ini digunakan pada jaringan IoT (Internet of Things), pemantauan sesuatu jarak jauh (remote monitoring), dan teknologi modulasi CSS (Chirp Spread Spectrum). Dalam pengimplementasiannya, kebanyakan modul LoRa menggunakan antena monopole yang terdiri dari satu batang konduktor lurus untuk pengiriman data karena ukurannya tidak terlalu besar untuk perangkat IoT. Modul ini akan diintegrasikan dengan kendaaraan tanpa awak sebagai pemancar pada sistem komunikasi yang digunakan. Kendaraan ini akan berfungsi menjadi sebuah bantuan pada kejadian yang tidak dapat melibatkan manusia secara langsung. Oleh karena itu, antena yang digunakan pada sistem komunikasi akan diganti menjadi aesthetic antena agar tidak mudah dikenali serta untuk memperindah kendaraan tanpa awak.\n        Proyek Akhir ini mengimplementasikan aesthetic antena logo Tel-U pada sistem komunikasi kendaraan tanpa awak, khususnya bagian transmitter. Pada sistem ini antena dirancang menggunakan mikrostrip antena, sehingga dapat diintegrasikan pada kendaraan tanpa awak sebagai aksesori. Antena yang dirancang digunakan untuk menggantikan antena existing pada modul LoRa yang bekerja pada frekuensi 433 MHz. Pada perancangan antena menggunakan teknik Defected Ground Structure (DGS) untuk meminiaturisasi dimensi antena dengan memanfaatkan bentuk baru pada groundplane.\n        Pengujian hanya terbatas pada proses pembuktian adanya sinyal saat antena mengirimkan data melalui software XCOM. Dikarenakan aplikasi yang dibutuhkan pada proses pengiriman data tidak tersedia. Antena logo Tel-U menghasilkan nilai parameter yang diinginkan pada simulasi nilai VSWR sebesar 1,12, return loss sebesar -24,69 dB dan gain 1,474 dBi. Dan hasil parameter pengukuran dengan nilai VSWR sebesar 1,12, return loss -24,83 dB.\n \nKata Kunci: LoRa, Aesthetic Antena, Telkom University, sistem komunikasi.",
    "keywords": "",
    "author": "VEBINA BERLIANTY BR BARUS",
    "lecturer": "Radial Anwar, Hasanah Putri",
    "publisher": "Universitas Telkom, D3 Teknologi Telekomunikasi",
    "publish_year": "2024"
  },
  {
    "title": "PERANCANGAN SMART PORTABLE CROP RECOMMENDATION TOOL DENGAN MENGGUNAKAN HUMAN MACHINE INTERFACE - Dalam bentuk buku karya ilmiah ",
    "classification": "Karya Ilmiah - TA (D3) - Reference",
    "type_publication": "User Interface Design",
    "subject": "30 kali",
    "abstract": "Dalam melakukan pemilihan lokasi lahan tanam, petani belum memahami dan mempertimbangkan dengan tepat apakah tanah atau lahan tersebut sesuai untuk ditanami tanaman yang diinginkan. 7 dari 9 responden yang bekerja sebagai penyuluh pertanian menyatakan bahwa mereka pernah menemukan kasus kegagalan panen akibat kesalahan dalam memilih kecocokan lahan. Apabila hal ini terus dibiarkan, maka aktivitas pertanian menjadi tidak optimal yang berdampak pada kebutuhan hasil pertanian. Berdasarkan pemasalahan tersebut, penelitian ini bertujuan untuk mengimplementasikan Human Machine Interface (HMI) untuk smart portable tool sistem rekomendasi pertanian yang berfokus pada kebutuhan pengguna. Studi yang dilakukan akan menggunakan pedekatan Human-Centered Design (HCD) melibatkan analisis konteks penggunaan alat, kebutuhan pengguna, pengembangan prototipe HMI, dan pengujian pengguna. Hasil penelitian ini berupa prototype interface sistem rekomendasi pertanian untuk penentuan kesesuaian lahan pertanian dengan komoditas tani yang ditanam dengan evaluasi yang bertuju pada indikator effectiveness, efficiency, dan satisfaction yang memiliki nilai sebessar 93% yang dapat dikategorikan sangat baik. Dengan demikian, dapat disimpulkan bahwa implementasi HMI untuk smart portable tool sistem rekomendasi pertanian telah sesuai dengan ke butuhan pengguna dan memberikan hasil yang sangat baik dalam konteks pertanian.",
    "keywords": "",
    "author": "ANINDIA AGUSTA KEN NADILA",
    "lecturer": "Bayu Rima Aditya, Suryatiningsih",
    "publisher": "Universitas Telkom, D3 Sistem Informasi",
    "publish_year": "2024"
  },
  {
    "title": "SISTEM MONITORING MAGASIN PADA SENAPAN SERBU SS1-V1 UNTUK GUDANG SENJATA YONZIPUR III PANGALENGAN DENGAN SENSOR LOAD CELL BERBASIS WEB - Dalam bentuk buku karya ilmiah ",
    "classification": "Karya Ilmiah - TA (D3) - Reference",
    "type_publication": "Inovasi",
    "subject": "26 kali",
    "abstract": "SS1-V1 adalah model senapan serbu yang dilengkapi dengan magasin sebagai salah satu komponen utama pada senjata. Magasin berperan penting dalam penyimpanan dan pengisian amunisi. Namun, penyimpanan magasin harus disimpan terpisah dengan senjata karena dapat menimbulkan risiko untuk keamanan suatu negara. Oleh karena itu, penelitian ini mengusulkan sistem berbasis web yang mampu mengidentifikasi keberadaan magasin pada senjata berbasis web secara real-time. Sistem ini didukung oleh beberapa perangkat keras, termasuk sensor Load Cell, modul sensor HX711, Arduino UNO R3, dan Ethernet shield untuk konektivitas jaringan. Antarmuka pengguna untuk menampilkan status dari senjata dikembangkan dengan menggunakan bahasa pemrograman PHP, framework Laravel. Selain itu, API digunakan untuk pengelolaan data, yang kemudian disimpan dalam database. Hasil penelitian ini menunjukkan bahwa response time rata-rata setiap rak dalam satu lemari adalah antara 2,7 detik hingga 3,3 detik, sementara untuk rak yang berperan sebagai slave adalah antara 14,16 detik hingga 15,01 detik. Berdasarkan hasil pengujian identifikasi senjata berdasarkan berat, terdapat selisih berat sebesar 0,1 kg hingga 0,2 kg. Hasil ini menyatakan bahwa semua pengujian berhasil diidentifikasi oleh web sesuai dengan kondisi senjata pada rak.",
    "keywords": "",
    "author": "YASIKHA FARRAS ISMAIL",
    "lecturer": "Muhammad Ikhsan Sani, Muhammad Rizqy Alfarisi",
    "publisher": "Universitas Telkom, D3 Teknologi Komputer",
    "publish_year": "2024"
  },
  {
    "title": "TransitNearMe : Perancangan Antarmuka Pengguna Aplikasi Transportasi Publik Untuk Penyandang Disabilitas - Dalam bentuk buku karya ilmiah ",
    "classification": "Karya Ilmiah - TA (D3) - Reference",
    "type_publication": "Ui/ux",
    "subject": "32 kali",
    "abstract": "Sistem mobilitas cerdas berpotensi meningkatkan aksesibilitas dan kemandirian bagi penyandang tunarungu dan tuna wicara. Namun, desain sistem yang efektif memerlukan pemahaman mendalam tentang kebutuhan dan pengalaman pengguna. Penelitian ini membahas perkembangan persona pengguna untuk merancang sistem mobilitas cerdas yang ramah dan inklusif bagi tunarungu dan tuna wicara dengan menggunakan metode penelitian kualitatif yang melibatkan wawancara dan observasi mendalam. Penelitian ini menunjukkan bahwa dari 16 sampel penyandang disabilitas ruwi merasa fasilitas untuk disabilitas kurang ramah, terutama pengetahuan petugas mengenai bahasa isyarat. Mereka butuh sistem yang memberikan sebuah informasi lengkap mengenai transportasi publik dan dapat berkomunikasi menggunakan JBI. Hasil penelitian menunjukkan bahwa persona pengguna dapat membantu desainer memahami keragaman kebutuhan dan pengalaman pengguna tunarungu dan tuna wicara. Pemahaman ini dapat digunakan untuk merancang sistem mobilitas cerdas yang lebih efektif dan sesuai dengan kebutuhan pengguna.\n \nKata Kunci : Antarmuka Pengguna, Transportasi Publik, Penyandang Disabilitas, Pengalaman Pengguna, Desain Universal",
    "keywords": "",
    "author": "PUTRI KAMALIYAH KIRANA DEWI",
    "lecturer": "Bayu Rima Aditya, Pikir Wisnu Wijayanto",
    "publisher": "Universitas Telkom, D3 Sistem Informasi",
    "publish_year": "2024"
  }
]
